{
  "questions": [
    {
      "type": "LONG",
      "statement": "What is ExpressJS?",
      "explanation": "Fast, unopinionated, minimalist web framework for Node.js,Express is a project of the Node.js Foundation.it is open source and click [here](https://github.com/expressjs/express/) to view,it is mainly used for building networking services (web applications) and applications,it is builds on top of node js features to provide easy to use functionality that satisfy the needs for building web applications.it has lots of pre-built packages and also many framework are built on top of it like  \n**Feathers**: Build prototypes in minutes and production ready real-time apps in days  \n**NestJs**: A progressive Node.js framework for building efficient, scalable, and enterprise-grade server-side applications on top of TypeScript & JavaScript (ES6, ES7, ES8)  \n**Sails**: MVC framework for Node.js for building practical, production-ready apps."
    },
    {
      "type": "LONG",
      "statement": "What are some of the salient features of express?",
      "explanation": "**Middlewares**: Set up middlewares in order to respond to HTTP/RESTful Requests.  \n**Routing**: It is possible to defines a routing table in order to perform different HTTP operations.  \n**Templates**: Dynamically renders HTML Pages based on passing arguments to templates.  \n**High Performance**: Express prepare a thin layer, therefore, the performance is adequate.  \n**Database Support**: Express supports RDBMS as well as NoSQL databases.  \n**MVC Support**: Organize the web application into an MVC architecture. **Manages everything from routes** to rendering view and preforming HTTP request."
    },
    {
      "type": "LONG",
      "statement": "Explain with an example a working of a simple express app?",
      "explanation": "I have given you the code, you explain , don't expect me to do all the stuff\n\n    const express = require('express')\n    const port = 3000\n    const app = express()\n    app.get('/', function(req, res) {\n      res.send('Hello World!')\n    })\n    app.listen(port, function(){\n      console.log('listening on port',port)\n    })"
    },
    {
      "type": "LONG",
      "statement": "Mention few properties of request parameter in express?",
      "explanation": "here is a list of few req methods needed for you to knows"
    },
    {
      "type": "LONG",
      "statement": "How to get the name parameters in express?",
      "explanation": "This property is an object containing properties mapped to the named route “parameters”. For example, if you have the route /user/:name, then the “name” property is available as req.params.name. This object defaults to {}.\n\n    // GET /user/tj\n    req.params.name\n    // => \"tj\""
    },
    {
      "type": "LONG",
      "statement": "How to retrieve the get query string parameters using express?",
      "explanation": "The query string is the part that comes after the URL path, and starts with a question mark ?.\n\n    ?height=6&weight=60\n    //req.query.height - 6\n    //req.query.weight - 60"
    },
    {
      "type": "LONG",
      "statement": "How to send a response back using express?",
      "explanation": "we can use any one of these commands\n\n    function(req, res) {\n    \tres.send('Hello World!')\n    }\n    function(req, res) {\n    \tres.end('Hello World!')\n    }\n    function(req, res) {\n    \tres.json({title:'Hello World!'})\n    }"
    },
    {
      "type": "LONG",
      "statement": "How to set http response status using express?",
      "explanation": "we can either use **res.status()** or **res.sendStatus()**\n\n    res.status(404).send('File not found')\n    \n    //if sendStatus we no need to write send method , i will pre send a few inbuilt messages upon using that\n    \n    res.sendStatus(200)\n    // === res.status(200).send('OK')\n    \n    res.sendStatus(403)\n    // === res.status(403).send('Forbidden')\n    \n    res.sendStatus(404)\n    // === res.status(404).send('Not Found')\n    \n    res.sendStatus(500)\n    // === res.status(500).send('Internal Server Error')"
    },
    {
      "type": "LONG",
      "statement": "What are the different http status codes?",
      "explanation": "| Code | Message | Description | | ---- | ------------------------------- | ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- | | 100 | Continue | Only a part of the request has been received by the server, but as long as it has not been rejected, the client should continue with the request | | 101 | Switching Protocols | The server switches protocol | | 200 | OK | The request is OK. | | 201 | Created | The request is complete, and a new resource is created | | 202 | Accepted | The request is accepted for processing, but the processing is not complete | | 203 | Non-authoritative Information | The information in the entity header is from a local or third-party copy, not from the original server. | | 204 | No Content | A status code and a header are given in the response but there is no entity-body in the reply | | 205 | Reset Content | The browser should clear the form used for this transaction for additional input | | 206 | Partial Content | The server is returning partial data of the size requested. Used in response to a request specifying a Range header. The server must specify the range included in the response with the Content-Range header | | 300 | Multiple Choices | A link list. The user can select a link and go to that location. Maximum five addresses | | 301 | Moved Permanently | The requested page has moved to a new url | | 302 | Found | The requested page has moved temporarily to a new url | | 303 | See Other | The requested page can be found under a different url | | 304 | Not Modified | This is the response code to an If-Modified-Since or If-None-Match header, where the URL has not been modified since the specified date | | 305 | Use Proxy | The requested URL must be accessed through the proxy mentioned in the Location header | | 306 | Unused | This code was used in a previous version. It is no longer used, but the code is reserved | | 307 | Temporary Redirect | The requested page has moved temporarily to a new url | | 400 | Bad Request | The server did not understand the request | | 401 | Unauthorized | The requested page needs a username and a password | | 402 | Payment Required | You can not use this code yet. | | 403 | Forbidden | Access is forbidden to the requested page. | | 404 | Not Found | The server can not find the requested page. | | 405 | Method Not Allowed | The method specified in the request is not allowed | | 406 | Not Acceptable | The server can only generate a response that is not accepted by the client | | 407 | Proxy Authentication Required | You must authenticate with a proxy server before this request can be served | | 408 | Request Timeout | The request took longer than the server was prepared to wait | | 409 | Conflict | The request could not be completed because of a conflict | | 410 | Gone | The requested page is no longer available | | 411 | Length Required | The \"Content-Length\" is not defined. The server will not accept the request without it . | | 412 | Precondition Failed | The pre condition given in the request evaluated to false by the server | | 413 | Request Entity Too Large | The server will not accept the request, because the request entity is too large. | | 414 | Request-url Too Long | The server will not accept the request, because the url is too long. Occurs when you convert a \"post\" request to a \"get\" request with a long query information | | 415 | Unsupported Media Type | The server will not accept the request, because the mediatype is not supported | | 416 | Requested Range Not Satisfiable | The requested byte range is not available and is out of bounds | | 417 | Expectation Failed | The expectation given in an Expect request-header field could not be met by this server. | | 500 | Internal Server Error | The request was not completed. The server met an unexpected condition. | | 501 | Not Implemented | The request was not completed. The server did not support the functionality required. | | 502 | Bad Gateway | The request was not completed. The server received an invalid response from the upstream server. | | 503 | Service Unavailable | The request was not completed. The server is temporarily overloading or down. | | 504 | Gateway Timeout | The gateway has timed out. | | 505 | HTTP Version Not Supported | The server does not support the \"http protocol\" version |"
    },
    {
      "type": "LONG",
      "statement": "Mention few properties of request parameter in express?",
      "explanation": "You can access all the HTTP headers using the Request.headers property:\n\n    app.get('/', (req, res) => {\n    console.log(req.headers)\n    })\n    \n    app.get('/', (req, res) => {\n    req.header('User-Agent')\n    })"
    },
    {
      "type": "LONG",
      "statement": "How can you change http header value of a response?",
      "explanation": "You can change any HTTP header value using Response.set():\n\n    res.set('Content-Type', 'text/html')\n    res.type('json')\n    // => 'application/json'\n    \n    res.type('application/json')\n    // => 'application/json'\n    \n    res.type('png')\n    // => image/png:"
    },
    {
      "type": "LONG",
      "statement": "How to redirect to other pages server-side?",
      "explanation": "Redirects are common in Web Development. You can create a redirect using the Response.redirect() method:  \n\n    res.redirect('/go-there')\n    //it can be either a url or a path of file\n    res.redirect(301, '/go-there')"
    },
    {
      "type": "LONG",
      "statement": "How does routing work in express?",
      "explanation": "Routing is the process of determining what should happen when a URL is called, or also which parts of the application should handle a specific incoming request.  \n\nIn the Hello World example we used this code  \n\n    app.get('/', function(req, res) {\n     /* */\n    })\n    //This creates a route that maps accessing the root domain URL / using the HTTP GET method to the response we want to provide."
    },
    {
      "type": "LONG",
      "statement": "What are the tasks that a middleware can do?",
      "explanation": "Middleware functions can perform the following tasks:  \n\nExecute any code.  \nMake changes to the request and the response objects.  \nEnd the request-response cycle.  \nCall the next middleware function in the stack."
    },
    {
      "type": "LONG",
      "statement": "What are the different types of middleware?",
      "explanation": "An Express application can use the following types of middleware:  \n\nApplication-level middleware  \nRouter-level middleware  \nError-handling middleware  \nBuilt-in middleware  \nThird-party middleware"
    },
    {
      "type": "LONG",
      "statement": "How to serve static assests from express?",
      "explanation": "It’s common to have images, CSS and more in a public subfolder, and expose them to the root level:\n\n    const express = require('express')\n    const app = express()\n    \n    app.use(express.static('public'))\n    \n    \n    app.listen(3000, () => console.log('Server ready'))"
    },
    {
      "type": "LONG",
      "statement": "How to provide file download using express?",
      "explanation": "Express provides a handy method to transfer a file as attachment: Response.download().  \n\nOnce a user hits a route that sends a file using this method, browsers will prompt the user for download.  \n\nThe Response.download() method allows you to send a file attached to the request, and the browser instead of showing it in the page, it will save it to disk.  \n\n    app.get('/', (req, res) => res.download('./file.pdf'))"
    },
    {
      "type": "LONG",
      "statement": "How to use the Response.cookie() method to manipulate your cookies?",
      "explanation": "Cookies are small pieces of data sent from a website and are stored in user's web browser while user is browsing that website. Every time the user loads that website back, the browser sends that stored data back to website or server, to distinguish user's previous activity.\n\n    res.cookie('username', 'Adam')\n    \n    This method accepts a third parameter which contains various options:\n    res.cookie('username', 'Adam', { domain: '.bangalore.com', path: '/administrator', secure: true })\n    \n    res.cookie('username', 'Adam', { expires: new Date(Date.now() + 900000), httpOnly: true })\n    \n    //clear cookie\n    res.clearCookie('username')\n    \n\nThe most useful parameters you can set are: | Value | Description | | ----- | ----------- | | domain | the cookie domain name| |expires|set the cookie expiration date. If missing, or 0, the cookie is a session cookie| |httpOnly|set the cookie to be accessible only by the web server. See HttpOnly| |maxAge|set the expiry time relative to the current time, expressed in milliseconds| |path|the cookie path. Defaults to /| |secure|Marks the cookie HTTPS only| |signed| set the cookie to be signed| |sameSite|Value of SameSite|"
    },
    {
      "type": "LONG",
      "statement": "How to manage sessions using express?",
      "explanation": "We’ll use the express-session module, which is maintained by the Express team.When implemented, every user of you API or website will be assigned a unique session, and this allows you to store the userstate.as by default Express requests are sequential and no request can be linked to each other. There is no way to know if this request comes from a client that already performed a request previously.\n\n    const express = require('express')\n    const session = require('express-session')\n    \n    const app = express()\n    app.use(session(\n    'secret': '343ji43j4n3jn4jk3n'\n    ))\n    \n\nAll solutions store the session id in a cookie, and keep the data server-side. The client will receive the session id in a cookie, and will send it along with every HTTP request.\n\nWe’ll reference that server-side to associate the session id with the data stored locally.\n\nMemory is the default, it requires no special setup on your part, it’s the simplest thing but it’s meant only for development purposes.\n\nThe best choice is a memory cache like Redis, for which you need to setup its own infrastructure."
    },
    {
      "type": "LONG",
      "statement": "How to process forms using Express?",
      "explanation": "The form data will be sent in the POST request body.\n\nTo extract it, you will use the express.urlencoded() middleware, provided by Express:\n\n    const express = require('express')\n    const app = express()\n    \n    app.use(express.urlencoded())\n    \n\nNow you need to create a POST endpoint on the /submit-form route, and any data will be available on Request.body:\n\n    app.post('/submit-form', (req, res) => {\n    const username = req.body.username\n    //...\n    res.end()\n    })"
    },
    {
      "type": "LONG",
      "statement": "How To Allow Cors In Expressjs Explain With An Example?",
      "explanation": "In order to allow CORS in Express.js, add the following code in server.js:\n\n    app.all('*', function(req, res, next) {\n    res.set('Access-Control-Allow-Origin', '*');\n    res.set('Access-Control-Allow-Methods', 'GET, POST, DELETE, PUT');\n    res.set('Access-Control-Allow-Headers', 'X-Requested-With, Content-Type');\n    if ('OPTIONS' == req.method) return res.send(200);\n    next();\n    });\n    \n\nor you can install a package called cors ,CORS is a node.js package for providing a Connect/Express middleware that can be used to enable CORS with various options.[link](https://www.npmjs.com/package/cors)\n\n    var express = require('express')\n    var cors = require('cors')\n    var app = express()\n    \n    app.use(cors())"
    }
  ]
}
