{
  "questions": [
    {
      "type": "LONG",
      "statement": "What is NodeJS?",
      "explanation": "Node.js is an open-source, cross-platform, **JavaScript runtime environment that executes JavaScript code outside of a browser**. Node JS was created by [Ryan Dahl](https://github.com/ry), Ryan Dahl is a software engineer and the original developer of the Node.js JavaScript runtime."
    },
    {
      "type": "LONG",
      "statement": "How can you avoid callback hells?",
      "explanation": "There are lots of ways to solve the issue of callback hells:  \n1.modularization: break callbacks into independent functions,  \n2.use a control flow library, like async.  \n3.use generators with Promises,  \n4.use async/await (note that it is only available in the latest v7 release and not in the LTS version"
    },
    {
      "type": "LONG",
      "statement": "When are background or worker processes useful?",
      "explanation": "Worker processes are extremely useful if you'd like to do data processing in the background, like sending out emails or processing images.  \nThere are lots of options for this like RabbitMQ or Kafka."
    },
    {
      "type": "LONG",
      "statement": "Why is NodeJS Single threaded?",
      "explanation": "Node.js is single-threaded for async processing. By doing async processing on a single-thread under typical web loads, more performance and scalability can be achieved as opposed to the typical thread-based implementation."
    },
    {
      "type": "LONG",
      "statement": "Name the types of API functions in Node?",
      "explanation": "There are two types of functions in Node.js.  \n1.Blocking functions - In a blocking operation, all other code is blocked from executing until an I/O event that is being waited on occurs. Blocking functions execute synchronously.  \n2.Non-blocking functions - In a non-blocking operation, multiple I/O calls can be performed without the execution of the program being halted. Non-blocking functions execute asynchronously."
    },
    {
      "type": "LONG",
      "statement": "Explain chaining in Nodejs?",
      "explanation": "Chaining is a mechanism whereby the output of one stream is connected to another stream creating a chain of multiple stream operations."
    },
    {
      "type": "LONG",
      "statement": "What are streams in Nodejs Explain the different types of streams present in Nodejs?",
      "explanation": "Streams are objects that allow the reading of data from the source and writing of data to the destination as a continuous process.  \nThere are four types of streams.  \nto facilitate the reading operation.  \nto facilitate the writing operation.  \nto facilitate both read and write operations.  \nis a form of Duplex stream that performs computations based on the available input."
    },
    {
      "type": "LONG",
      "statement": "What is package json?",
      "explanation": "The package.json file in Node.js is the heart of the entire application. It is basically the manifest file that contains the metadata of the project where we define the properties of a package."
    },
    {
      "type": "LONG",
      "statement": "Explain the purpose of module exports?",
      "explanation": "A module in Node.js is used to encapsulate all the related codes into a single unit of code which can be interpreted by shifting all related functions into a single file"
    },
    {
      "type": "LONG",
      "statement": "List down the major security implementations within Nodejs?",
      "explanation": "Major security implementations in Node.js are:Authentications,Error Handling"
    },
    {
      "type": "LONG",
      "statement": "Explain the concept of URL module?",
      "explanation": "The URL module splits up a web address into readable parts"
    },
    {
      "type": "LONG",
      "statement": "Explain the concept of middleware in Nodejs?",
      "explanation": "In general, middleware is a function receives the Request and Response objects. In other words, in an application’s request-response cycle these functions have access to various request & response objects along with the next function of the cycle,The next function of middleware is represented with the help of a variable, usually named next. Most commonly performed tasks by the middleware functions are  \n\nExecute any type of code  \nUpdate or modify the request and the response objects  \nFinish the request-response cycle  \nInvoke the next middleware in the stack"
    },
    {
      "type": "LONG",
      "statement": "Explain libuv?",
      "explanation": "Libuv is a multi-platform support library of Node.js which majorly is used for asynchronous I/O. It was primarily developed for Node.js, with time it is popularly practiced with other systems like as Luvit, pyuv, Julia, etc. Libuv is basically an abstraction around libev/ IOCP depending on the platform, providing users an API based on libev. A few of the important features of libuv are:  \n\nFull-featured event loop backed  \nFile system events  \nAsynchronous file & file system operations  \nAsynchronous TCP & UDP sockets  \nChild processes"
    },
    {
      "type": "LONG",
      "statement": "List down the two arguments that async.queue takes as input?",
      "explanation": "Below are the two arguments that async.queue takes as input - Task Function & Concurrency Value"
    },
    {
      "type": "LONG",
      "statement": "Differentiate between spawn and fork methods in Nodejs?",
      "explanation": "In Node.js, the spawn() is used to launch a new process with the provided set of commands. This method doesn’t create a new V8 instance and just one copy of the node module is active on the processor. When your child process returns a large amount of data to the Node you can invoke this method."
    },
    {
      "type": "LONG",
      "statement": "Explain the purpose of ExpressJS package?",
      "explanation": "Express.js is a framework built on top of Node.js that facilitates the management of the flow of data between server and routes in the server-side applications. It is a lightweight and flexible framework that provides a wide range of features required for the web as well as mobile application development. Express.js is developed on the middleware module of Node.js called connect. The connect module further makes use of http module to communicate with Node.js. Thus, if you are working with any of the connect based middleware modules, then you can easily integrate with Express.js."
    },
    {
      "type": "LONG",
      "statement": "Explain the usage of a buffer class in Nodejs?",
      "explanation": "Buffer class in Node.js is used for storing the raw data in a similar manner of an array of integers. But it corresponds to a raw memory allocation that is located outside the V8 heap. It is a global class that is easily accessible can be accessed in an application without importing a buffer module. Buffer class is used because pure JavaScript is not compatible with binary data. So, when dealing with TCP streams or the file system, it’s necessary to handle octet streams."
    },
    {
      "type": "LONG",
      "statement": "How does Nodejs handle the child threads?",
      "explanation": "In general, Node.js is a single threaded process and doesn’t expose the child threads or thread management methods. But you can still make use of the child threads using spawn() for some specific asynchronous I/O tasks which execute in the background and don’t usually execute any JS code or hinder with the main event loop in the application. If you still want to use the threading concept in your application you have to include a module called ChildProcess explicitly."
    },
    {
      "type": "LONG",
      "statement": "Explain stream in Nodejs along with its various types?",
      "explanation": "Streams in Node.js are the collection of data similar to arrays and strings. They are objects using which you can read data from a source or write data to a destination in a continuous manner. It might not be available at once and need not to have fit in the memory. These streams are especially useful for reading and processing a large set of data. In Node.js, there are four fundamental types of streams:  \nReadable: Used for reading large chunks of data from the source.  \nWriteable: Use for writing large chunks of data to the destination.  \nDuplex: Used for both the functions; read and write.  \nTransform: It is a duplex stream that is used for modifying the data."
    },
    {
      "type": "LONG",
      "statement": "Describe the exit codes of Nodejs?",
      "explanation": "In Node.js, exit codes are a set of specific codes which are used for finishing a specific process. These processes can include the global object as well. Below are some of the exit codes used in Node.js:  \n\\*Uncaught fatal exception  \n\\*Unused  \n\\*Fatal Error  \n\\*Internal Exception handler Run-time failure  \n\\*Internal JavaScript Evaluation Failure"
    },
    {
      "type": "LONG",
      "statement": "Is cryptography supported in Nodejs?",
      "explanation": "Yes, Node.js does support cryptography through a module called Crypto. This module provides various cryptographic functionalities like cipher, decipher, sign and verify functions, a set of wrappers for open SSL’s hash HMAC etc.  \n\n    const crypto = require'crypto');\n    const secret = 'akerude';\n    const hash = crypto.createHmac('swaEdu', secret).update('Welcome to Edureka').digest('hex');\n    console.log(hash);"
    },
    {
      "type": "LONG",
      "statement": "Explain the reason as to why Express app and server folder must be kept separate?",
      "explanation": "Express ‘app’ and ‘server’ must be kept separate as by doing this, you will be separating the API declaration from the network related configuration which benefits in the below listed ways:  \n\\*It allows testing the API in-process without having to perform the network calls  \n\\*Faster testing execution  \n\\*Getting wider coverage metrics of the code  \n\\*Allows deploying the same API under flexible and different network conditions  \n\\*Better separation of concerns and cleaner code"
    },
    {
      "type": "LONG",
      "statement": "What is the role of asset module in nodejs?",
      "explanation": "The assert module provides a set of assertion functions for verifying invariants"
    },
    {
      "type": "LONG",
      "statement": "What is the role of async\\_hooks module in nodejs?",
      "explanation": "The async\\_hooks module provides an API to track asynchronous resources. It can be accessed using:\n\n    const async_hooks = require('async_hooks');"
    },
    {
      "type": "LONG",
      "statement": "What are buffer objects in nodejs?",
      "explanation": "In Node.js, Buffer objects are used to represent binary data in the form of a sequence of bytes. Many Node.js APIs, for example streams and file system operations, support Buffers, as interactions with the operating system or other processes generally always happen in terms of binary data"
    },
    {
      "type": "LONG",
      "statement": "What are the different ways of implementing Addons in NodeJS?",
      "explanation": "There are three options for implementing Addons:  \nN-API  \nnan direct use of internal V8  \nlibuv  \nNode.js libraries"
    },
    {
      "type": "LONG",
      "statement": "How can we spawn the child process asynchronously without blocking the Nodejs event loop?",
      "explanation": "**child\\_process.spawn()** method spawns the child process asynchronously, without blocking the Node.js event loop,The child\\_process.  \n**spawnSync()** function provides equivalent functionality in a synchronous manner that blocks the event loop until the spawned process either exits or is terminated"
    },
    {
      "type": "LONG",
      "statement": "How can we take advantage of multi-core system in Nodejs as nodejs works on single thread?",
      "explanation": "We can use node js cluster to use multicores in the hardware,The cluster module allows easy creation of child processes that all share server ports  \n\n    const cluster = require('cluster');\n    const http = require('http');\n    const numCPUs = require('os').cpus().length;\n    \n    if (cluster.isMaster) {\n    console.log(`Master ${process.pid} is running`);\n    \n    // Fork workers.\n    \tfor (let i = 0; i < numCPUs; i++) {\n    cluster.fork();\n    }\n    \n    cluster.on('exit', (worker, code, signal) => {\n    console.log(`worker ${worker.process.pid} died`);\n    \t});\n    }\n    else {\n    \t// Workers can share any TCP connection\n    \t// In this case it is an HTTP server\n    http.createServer((req, res) => {\n    res.writeHead(200);\n    res.end('hello world\\n');\n    }).listen(8000);\n    \n    console.log(`Worker ${process.pid} started`);\n    }\n    \n    //Running Node.js will now share port 8000 between the workers:\n    \n    $ node server.js\n    Master 3596 is running\n    Worker 4324 started\n    Worker 4520 started\n    Worker 6056 started\n    Worker 5644 started"
    },
    {
      "type": "LONG",
      "statement": "What is the datatype of console?",
      "explanation": "The datatype of console is an **object**"
    },
    {
      "type": "LONG",
      "statement": "Which are the different console methods available?",
      "explanation": "There are around 21 inbuilt console methods , we can also built our own prototypes using new Console constructor function  \nhere are a few popular one's  \n1.**console.clear()** will clear only the output in the current terminal viewport for the Node.js binary.  \n2.**console.error(\\[data\\]\\[, ...args\\])** Prints to stderr with newline. Multiple arguments can be passed, with the first used as the primary message and all additional used as substitution  \n3.**console.table(tabularData\\[, properties\\])** a table with the columns of the properties of tabularData (or use properties) and rows of tabularData and log it."
    },
    {
      "type": "LONG",
      "statement": "Can node js perform cryptographic functions?",
      "explanation": "Yes,The crypto module provides cryptographic functionality that includes a set of wrappers for OpenSSL's hash, HMAC, cipher, decipher, sign, and verify functions.  \n\nUse require('crypto') to access this module."
    },
    {
      "type": "LONG",
      "statement": "How can we read or write files in node js?",
      "explanation": "The fs module provides an API for interacting with the file system in a manner closely modeled around standard POSIX functions. To use this module:  \n\nconst fs = require('fs');  \nThere are a few methods like  \nfs.readFile(file, data\\[, options\\], callback)  \nfs.writeFile(file, data\\[, options\\], callback)"
    },
    {
      "type": "LONG",
      "statement": "Which are the global objects in Node JS?",
      "explanation": "\\*\\*dirname  \n\\*\\*filename  \nclearImmediate(immediateObject)  \nclearInterval(intervalObject)  \nclearTimeout(timeoutObject)  \nconsole  \nexports  \nglobal  \nmodule  \nprocess  \nqueueMicrotask(callback)  \nrequire()  \nsetImmediate(callback\\[, ...args\\])  \nsetInterval(callback, delay\\[, ...args\\])  \nsetTimeout(callback, delay\\[, ...args\\])  \nTextDecoder  \nTextEncoder  \nURL  \nURLSearchParams  \nWebAssembly"
    },
    {
      "type": "LONG",
      "statement": "How can we perform asynchronous network API in Node JS?",
      "explanation": "The net module provides an asynchronous network API for creating stream-based TCP or IPC servers (net.createServer()) and clients (net.createConnection()).\n\nIt can be accessed using:  \n\nconst net = require('net');"
    },
    {
      "type": "LONG",
      "statement": "What are the utilities of OS module in NodeJS?",
      "explanation": "The os module provides operating system-related utility methods and properties. It can be accessed using:  \n\nconst os = require('os');."
    },
    {
      "type": "LONG",
      "statement": "Which are the areas where it is suitable to use NodeJS?",
      "explanation": "    I/O bound Applications<br/>\n    Data Streaming Applications<br/>\n    Data Intensive Real-time Applications (DIRT)<br/>\n    JSON APIs based Applications<br/>\n    Single Page Applications<br/>\n    \n\n."
    },
    {
      "type": "LONG",
      "statement": "Which are the areas where it is not suitable to use NodeJS?",
      "explanation": "it’s not suitable for heavy applications involving more of CPU usage"
    },
    {
      "type": "LONG",
      "statement": "What Are The Key Features Of NodeJs?",
      "explanation": "    **Asynchronous event driven IO** helps concurrent request handling – All APIs of Node.js are asynchronous. This feature means that if a Node receives a request for some Input/Output operation, it will execute that operation in the background and continue with the processing of other requests. Thus it will not wait for the response from the previous requests.<br/>\n    **Fast in Code execution** – Node.js uses the V8 JavaScript Runtime engine, the one which is used by Google Chrome. Node has a wrapper over the JavaScript engine which makes the runtime engine much faster and hence processing of requests within Node.js also become faster.<br/>\n    **Single Threaded but Highly Scalable** – Node.js uses a single thread model for event looping. The response from these events may or may not reach the server immediately. However, this does not block other operations. Thus making Node.js highly scalable. Traditional servers create limited threads to handle requests while Node.js creates a single thread that provides service to much larger numbers of such requests.<br/>\n    **Node.js library uses JavaScript** – This is another important aspect of Node.js from the developer’s point of view. The majority of developers are already well-versed in JavaScript. Hence, development in Node.js becomes easier for a developer who knows JavaScript.<br/>\n    **There is an Active and vibrant community for the Node.js** framework – The active community always keeps the framework updated with the latest trends in the web development.<br/>\n    **No Buffering** – Node.js applications never buffer any data. They simply output the data in chunks.<br/>\n    \n\n."
    },
    {
      "type": "LONG",
      "statement": "Explain REPL In NodeJs?",
      "explanation": "The REPL stands for “Read Eval Print Loop”. It is a simple program that accepts the commands, evaluates them, and finally prints the results. REPL provides an environment similar to that of Unix/Linux shell or a window console, in which we can enter the command and the system, in turn, responds with the output. REPL performs the following tasks.  \n\n**READ** - It Reads the input from the user, parses it into JavaScript data structure and then stores it in the memory.  \n**EVAL** - It Executes the data structure.  \n**PRINT** - It Prints the result obtained after evaluating the command.  \n**LOOP** - It Loops the above command until the user presses Ctrl+C two times."
    },
    {
      "type": "LONG",
      "statement": "Can you write CRUD operations in Node js without using frameworks?",
      "explanation": "Yes,we can use inbuilt http library for that , here is a simple code for the same:\n\n    var http = require('http');//create a server object:\n    http.createServer(function (req, res) {\n    res.writeHead(200, {'Content-Type': 'text/html'}); // http headervar \turl = req.url;\n    if(url ==='/about'){\n    \tres.write('<h1>about us page<h1>'); //write a response\n    \tres.end(); //end the response\n    }else if(url ==='/contact'){\n    \tres.write('<h1>contact us page<h1>'); //write a response\n    \tres.end(); //end the response\n    }else{\n    \tres.write('<h1>Hello World!<h1>'); //write a response\n    \tres.end(); //end the response\n    }}).listen(3000, function(){\n    console.log(\"server start at port 3000\"); //the server object listens on port 3000\n    });"
    },
    {
      "type": "LONG",
      "statement": "What Is The Difference Between Nodejs AJAX And JQuery?",
      "explanation": "The one common trait between Node.js, AJAX, and jQuery is that all of them are the advanced implementation of JavaScript. However, they serve completely different purposes.  \n\n**Node.Js** :  \n\nIt is a server-side platform for developing client-server applications. For example, if we’ve to build an online employee management system, then we won’t do it using client-side JS. But the Node.js can certainly do it as it runs on a server similar to Apache, Django not in a browser.  \n\n**AJAX** (Aka Asynchronous Javascript And XML) :  \n\nIt is a client-side scripting technique, primarily designed for rendering the contents of a page without refreshing it. There are a no. of large companies utilizing AJAX such as Facebook and Stack Overflow to display dynamic content.  \n\n**JQuery** :  \n\nIt is a famous JavaScript module which complements AJAX, DOM traversal, looping and so on. This library provides many useful functions to help in JavaScript development. However, it’s not mandatory to use it but as it also manages cross-browser compatibility, so can help you produce highly maintainable web applications."
    },
    {
      "type": "LONG",
      "statement": "What Is EventEmitter In NodeJs?",
      "explanation": "    Events module in Node.js allows us to create and handle custom events. The Event module contains “EventEmitter” class which can be used to raise and handle custom events. It is accessible via the following code.<br/>\n    ```\n    // Import events module\n    var events = require('events');\n    \n    // Create an eventEmitter object\n    var eventEmitter = new events.EventEmitter();\n    ```\n    <br/>\n    When an EventEmitter instance encounters an error, it emits an “error” event. When a new listener gets added, it fires a “newListener” event and when a listener gets removed, it fires a “removeListener” event.\n    \n    EventEmitter provides multiple properties like “on” and “emit”. The “on” property is used to bind a function to the event and “emit” is used to fire an event.\n    \n\n."
    },
    {
      "type": "LONG",
      "statement": "What Is A Child\\_process Module In NodeJs?",
      "explanation": "Node.js supports the creation of child processes to help in parallel processing along with the event-driven model.  \n\nThe Child processes always have three streams <child.stdin>, child.stdout, and child.stderr. The stream of the parent process shares the streams of the child process.  \n\nNode.js provides a <child\\_process> module which supports following three methods to create a child process.  \n\n    **exec** – <child_process.exec> method runs a command in a shell/console and buffers the output.\n    **spawn** – <child_process.spawn> launches a new process with a given command.\n    **fork** – <child_process.fork> is a special case of the spawn() method to create child processes."
    }
  ]
}
