{
  "questions": [
    {
      "type": "LONG",
      "statement": "What are the possible ways to create objects in JavaScript",
      "explanation": "There are many ways to create objects in javascript as below\n\n1.  **Object constructor:**\n    \n    The simplest way to create an empty object is using the Object constructor. Currently this approach is not recommended.\n    \n        var object = new Object();\n        \n    \n2.  **Object's create method:**\n    \n    The create method of Object creates a new object by passing the prototype object as a parameter\n    \n        var object = Object.create(null);\n        \n    \n3.  **Object literal syntax:**\n    \n    The object literal syntax is equivalent to create method when it passes null as parameter\n    \n        var object = {};\n        \n    \n4.  **Function constructor:**\n    \n    Create any function and apply the new operator to create object instances,\n    \n        function Person(name) {\n          var object = {};\n          object.name = name;\n          object.age = 21;\n          return object;\n        }\n        var object = new Person(\"Sudheer\");\n        \n    \n5.  **Function constructor with prototype:**\n    \n    This is similar to function constructor but it uses prototype for their properties and methods,\n    \n        function Person() {}\n        Person.prototype.name = \"Sudheer\";\n        var object = new Person();\n        \n    \n    This is equivalent to an instance created with an object create method with a function prototype and then call that function with an instance and parameters as arguments.\n    \n        function func {};\n        \n        new func(x, y, z);\n        \n    \n    **(OR)**\n    \n        // Create a new instance using function prototype.\n        var newInstance = Object.create(func.prototype)\n        \n        // Call the function\n        var result = func.call(newInstance, x, y, z),\n        \n        // If the result is a non-null object then use it otherwise just use the new instance.\n        console.log(result && typeof result === 'object' ? result : newInstance);\n        \n    \n6.  **ES6 Class syntax:**\n    \n    ES6 introduces class feature to create the objects\n    \n        class Person {\n          constructor(name) {\n            this.name = name;\n          }\n        }\n        \n        var object = new Person(\"Sudheer\");\n        \n    \n7.  **Singleton pattern:**\n    \n    A Singleton is an object which can only be instantiated one time. Repeated calls to its constructor return the same instance and this way one can ensure that they don't accidentally create multiple instances.\n    \n        var object = new (function () {\n          this.name = \"Sudheer\";\n        })();"
    },
    {
      "type": "LONG",
      "statement": "What is a prototype chain",
      "explanation": "**Prototype chaining** is used to build new types of objects based on existing ones. It is similar to inheritance in a class based language. The prototype on object instance is available through **Object.getPrototypeOf(object)** or **proto** property whereas prototype on constructors function is available through object.prototype."
    },
    {
      "type": "LONG",
      "statement": "What is the difference between Call, Apply and Bind",
      "explanation": "The difference between Call, Apply and Bind can be explained with below examples,\n\n**Call:** The call() method invokes a function with a given `this` value and arguments provided one by one\n\n    var employee1 = { firstName: \"John\", lastName: \"Rodson\" };\n    var employee2 = { firstName: \"Jimmy\", lastName: \"Baily\" };\n    \n    function invite(greeting1, greeting2) {\n      console.log(\n        greeting1 + \" \" + this.firstName + \" \" + this.lastName + \", \" + greeting2\n      );\n    }\n    \n    invite.call(employee1, \"Hello\", \"How are you?\"); // Hello John Rodson, How are you?\n    invite.call(employee2, \"Hello\", \"How are you?\"); // Hello Jimmy Baily, How are you?\n    \n\n**Apply:** Invokes the function and allows you to pass in arguments as an array\n\n    var employee1 = { firstName: \"John\", lastName: \"Rodson\" };\n    var employee2 = { firstName: \"Jimmy\", lastName: \"Baily\" };\n    \n    function invite(greeting1, greeting2) {\n      console.log(\n        greeting1 + \" \" + this.firstName + \" \" + this.lastName + \", \" + greeting2\n      );\n    }\n    \n    invite.apply(employee1, [\"Hello\", \"How are you?\"]); // Hello John Rodson, How are you?\n    invite.apply(employee2, [\"Hello\", \"How are you?\"]); // Hello Jimmy Baily, How are you?\n    \n\n**bind:** returns a new function, allowing you to pass in an array and any number of arguments\n\n    var employee1 = { firstName: \"John\", lastName: \"Rodson\" };\n    var employee2 = { firstName: \"Jimmy\", lastName: \"Baily\" };\n    \n    function invite(greeting1, greeting2) {\n      console.log(\n        greeting1 + \" \" + this.firstName + \" \" + this.lastName + \", \" + greeting2\n      );\n    }\n    \n    var inviteEmployee1 = invite.bind(employee1);\n    var inviteEmployee2 = invite.bind(employee2);\n    inviteEmployee1(\"Hello\", \"How are you?\"); // Hello John Rodson, How are you?\n    inviteEmployee2(\"Hello\", \"How are you?\"); // Hello Jimmy Baily, How are you?\n    \n\nCall and apply are pretty interchangeable. Both execute the current function immediately. You need to decide whether it’s easier to send in an array or a comma separated list of arguments. You can remember by treating Call is for comma (separated list) and Apply is for Array. Whereas Bind creates a new function that will have `this` set to the first parameter passed to bind()."
    },
    {
      "type": "LONG",
      "statement": "What is JSON and its common operations",
      "explanation": "**JSON** is a text-based data format following JavaScript object syntax, which was popularized by `Douglas Crockford`. It is useful when you want to transmit data across a network and it is basically just a text file with an extension of .json, and a MIME type of application/json **Parsing:** Converting a string to a native object\n\n    JSON.parse(text);\n    \n\nStringification: \\*\\*converting a native object to a string so it can be transmitted across the network\n\n    JSON.stringify(object);"
    },
    {
      "type": "LONG",
      "statement": "What is the purpose of the array slice method",
      "explanation": "The **slice()** method returns the selected elements in an array as a new array object. It selects the elements starting at the given start argument, and ends at the given optional end argument without including the last element. If you omit the second argument then it selects till the end. Some of the examples of this method are,\n\n    let arrayIntegers = [1, 2, 3, 4, 5];\n    let arrayIntegers1 = arrayIntegers.slice(0, 2); // returns [1,2]\n    let arrayIntegers2 = arrayIntegers.slice(2, 3); // returns [3]\n    let arrayIntegers3 = arrayIntegers.slice(4); //returns [5]\n    \n\n**Note:** Slice method won't mutate the original array but it returns the subset as a new array."
    },
    {
      "type": "LONG",
      "statement": "What is the purpose of the array splice method",
      "explanation": "The **splice()** method is used either adds/removes items to/from an array, and then returns the removed item. The first argument specifies the array position for insertion or deletion whereas the option second argument indicates the number of elements to be deleted. Each additional argument is added to the array. Some of the examples of this method are,\n\n    let arrayIntegersOriginal1 = [1, 2, 3, 4, 5];\n    let arrayIntegersOriginal2 = [1, 2, 3, 4, 5];\n    let arrayIntegersOriginal3 = [1, 2, 3, 4, 5];\n    \n    let arrayIntegers1 = arrayIntegersOriginal1.splice(0, 2); // returns [1, 2]; original array: [3, 4, 5]\n    let arrayIntegers2 = arrayIntegersOriginal2.splice(3); // returns [4, 5]; original array: [1, 2, 3]\n    let arrayIntegers3 = arrayIntegersOriginal3.splice(3, 1, \"a\", \"b\", \"c\"); //returns [4]; original array: [1, 2, 3, \"a\", \"b\", \"c\", 5]\n    \n\n**Note:** Splice method modifies the original array and returns the deleted array."
    },
    {
      "type": "LONG",
      "statement": "What is the difference between slice and splice",
      "explanation": "Some of the major difference in a tabular form\n\n| Slice | Splice | | -------------------------------------------- | ----------------------------------------------- | | Doesn't modify the original array(immutable) | Modifies the original array(mutable) | | Returns the subset of original array | Returns the deleted elements as array | | Used to pick the elements from array | Used to insert or delete elements to/from array |"
    },
    {
      "type": "LONG",
      "statement": "How do you compare Object and Map",
      "explanation": "**Objects** are similar to **Maps** in that both let you set keys to values, retrieve those values, delete keys, and detect whether something is stored at a key. Due to this reason, Objects have been used as Maps historically. But there are important differences that make using a Map preferable in certain cases.\n\n1.  The keys of an Object are Strings and Symbols, whereas they can be any value for a Map, including functions, objects, and any primitive.\n2.  The keys in Map are ordered while keys added to Object are not. Thus, when iterating over it, a Map object returns keys in order of insertion.\n3.  You can get the size of a Map easily with the size property, while the number of properties in an Object must be determined manually.\n4.  A Map is an iterable and can thus be directly iterated, whereas iterating over an Object requires obtaining its keys in some fashion and iterating over them.\n5.  An Object has a prototype, so there are default keys in the map that could collide with your keys if you're not careful. As of ES5 this can be bypassed by using map = Object.create(null), but this is seldom done.\n6.  A Map may perform better in scenarios involving frequent addition and removal of key pairs."
    },
    {
      "type": "LONG",
      "statement": "What is the difference between == and === operators",
      "explanation": "JavaScript provides both strict(===, !==) and type-converting(==, !=) equality comparison. The strict operators take type of variable in consideration, while non-strict operators make type correction/conversion based upon values of variables. The strict operators follow the below conditions for different types,\n\n1.  Two strings are strictly equal when they have the same sequence of characters, same length, and same characters in corresponding positions.\n2.  Two numbers are strictly equal when they are numerically equal. i.e, Having the same number value. There are two special cases in this,\n    1.  NaN is not equal to anything, including NaN.\n    2.  Positive and negative zeros are equal to one another.\n3.  Two Boolean operands are strictly equal if both are true or both are false.\n4.  Two objects are strictly equal if they refer to the same Object.\n5.  Null and Undefined types are not equal with ===, but equal with ==. i.e, null===undefined --> false but null==undefined --> true\n\nSome of the example which covers the above cases,\n\n    0 == false   // true\n    0 === false  // false\n    1 == \"1\"     // true\n    1 === \"1\"    // false\n    null == undefined // true\n    null === undefined // false\n    '0' == false // true\n    '0' === false // false\n    []==[] or []===[] //false, refer different objects in memory\n    {}=={} or {}==={} //false, refer different objects in memory"
    },
    {
      "type": "LONG",
      "statement": "What are lambda or arrow functions",
      "explanation": "An arrow function is a shorter syntax for a function expression and does not have its own **this, arguments, super, or new.target**. These functions are best suited for non-method functions, and they cannot be used as constructors."
    },
    {
      "type": "LONG",
      "statement": "What is a first class function",
      "explanation": "In Javascript, functions are first class objects. First-class functions means when functions in that language are treated like any other variable.\n\nFor example, in such a language, a function can be passed as an argument to other functions, can be returned by another function and can be assigned as a value to a variable. For example, in the below example, handler functions assigned to a listener\n\n    const handler = () => console.log(\"This is a click handler function\");\n    document.addEventListener(\"click\", handler);"
    },
    {
      "type": "LONG",
      "statement": "What is a first order function",
      "explanation": "First-order function is a function that doesn’t accept another function as an argument and doesn’t return a function as its return value.\n\n    const firstOrder = () => console.log(\"I am a first order function!\");"
    },
    {
      "type": "LONG",
      "statement": "What is a higher order function",
      "explanation": "Higher-order function is a function that accepts another function as an argument or returns a function as a return value.\n\n    const firstOrderFunc = () =>\n      console.log(\"Hello I am a First order function\");\n    const higherOrder = (ReturnFirstOrderFunc) => ReturnFirstOrderFunc();\n    higherOrder(firstOrderFunc);"
    },
    {
      "type": "LONG",
      "statement": "What is a unary function",
      "explanation": "Unary function (i.e. monadic) is a function that accepts exactly one argument. Let us take an example of unary function. It stands for a single argument accepted by a function.\n\n    const unaryFunction = (a) => console.log(a + 10); // Add 10 to the given argument and display the value"
    },
    {
      "type": "LONG",
      "statement": "What is the currying function",
      "explanation": "Currying is the process of taking a function with multiple arguments and turning it into a sequence of functions each with only a single argument. Currying is named after a mathematician Haskell Curry. By applying currying, a n-ary function turns it into a unary function. Let's take an example of n-ary function and how it turns into a currying function\n\n    const multiArgFunction = (a, b, c) => a + b + c;\n    const curryUnaryFunction = (a) => (b) => (c) => a + b + c;\n    curryUnaryFunction(1); // returns a function: b => c =>  1 + b + c\n    curryUnaryFunction(1)(2); // returns a function: c => 3 + c\n    curryUnaryFunction(1)(2)(3); // returns the number 6\n    \n\nCurried functions are great to improve code reusability and functional composition."
    },
    {
      "type": "LONG",
      "statement": "What is a pure function",
      "explanation": "A **Pure function** is a function where the return value is only determined by its arguments without any side effects. i.e, If you call a function with the same arguments 'n' number of times and 'n' number of places in the application then it will always return the same value. Let's take an example to see the difference between pure and impure functions,\n\n    //Impure\n    let numberArray = [];\n    const impureAddNumber = (number) => numberArray.push(number);\n    //Pure\n    const pureAddNumber = (number) => (argNumberArray) =>\n      argNumberArray.concat([number]);\n    \n    //Display the results\n    console.log(impureAddNumber(6)); // returns 1\n    console.log(numberArray); // returns [6]\n    console.log(pureAddNumber(7)(numberArray)); // returns [6, 7]\n    console.log(numberArray); // returns [6]\n    \n\nAs per above code snippets, Push function is impure itself by altering the array and returning an push number index which is independent of parameter value. Whereas Concat on the other hand takes the array and concatenates it with the other array producing a whole new array without side effects. Also, the return value is a concatenation of the previous array. Remember that Pure functions are important as they simplify unit testing without any side effects and no need for dependency injection. They also avoid tight coupling and make it harder to break your application by not having any side effects. These principles are coming together with **Immutability** concept of ES6 by giving preference to **const** over **let** usage."
    },
    {
      "type": "LONG",
      "statement": "What is the purpose of the let keyword",
      "explanation": "The `let` statement declares a **block scope local variable**. Hence the variables defined with let keyword are limited in scope to the block, statement, or expression on which it is used. Whereas variables declared with the var keyword used to define a variable globally, or locally to an entire function regardless of block scope. Let's take an example to demonstrate the usage,\n\n    let counter = 30;\n    if (counter === 30) {\n      let counter = 31;\n      console.log(counter); // 31\n    }\n    console.log(counter); // 30 (because if block variable won't exist here)"
    },
    {
      "type": "LONG",
      "statement": "What is the difference between let and var",
      "explanation": "You can list out the differences in a tabular format\n\n| var | let | | ----------------------------------------------------- | --------------------------- | | It is been available from the beginning of JavaScript | Introduced as part of ES6 | | It has function scope | It has block scope | | Variables will be hoisted | Hoisted but not initialized |\n\nLet's take an example to see the difference,\n\n    function userDetails(username) {\n      if (username) {\n        console.log(salary); // undefined(due to hoisting)\n        console.log(age); // error: age is not defined\n        let age = 30;\n        var salary = 10000;\n      }\n      console.log(salary); //10000 (accessible to due function scope)\n      console.log(age); //error: age is not defined(due to block scope)\n    }"
    },
    {
      "type": "LONG",
      "statement": "What is the reason to choose the name let as a keyword",
      "explanation": "Let is a mathematical statement that was adopted by early programming languages like Scheme and Basic. It has been borrowed from dozens of other languages that use let already as a traditional keyword as close to var as possible."
    },
    {
      "type": "LONG",
      "statement": "How do you redeclare variables in switch block without an error",
      "explanation": "If you try to redeclare variables in a `switch block` then it will cause errors because there is only one block. For example, the below code block throws a syntax error as below,\n\n    let counter = 1;\n    switch (x) {\n      case 0:\n        let name;\n        break;\n    \n      case 1:\n        let name; // SyntaxError for redeclaration.\n        break;\n    }\n    \n\nTo avoid this error, you can create a nested block inside a case clause and create a new block scoped lexical environment.\n\n    let counter = 1;\n    switch (x) {\n      case 0: {\n        let name;\n        break;\n      }\n      case 1: {\n        let name; // No SyntaxError for redeclaration.\n        break;\n      }\n    }"
    },
    {
      "type": "LONG",
      "statement": "What is the Temporal Dead Zone",
      "explanation": "The Temporal Dead Zone is a behavior in JavaScript that occurs when declaring a variable with the let and const keywords, but not with var. In ECMAScript 6, accessing a let or const variable before its declaration (within its scope) causes a ReferenceError. The time span when that happens, between the creation of a variable’s binding and its declaration, is called the temporal dead zone. Let's see this behavior with an example,\n\n    function somemethod() {\n      console.log(counter1); // undefined\n      console.log(counter2); // ReferenceError\n      var counter1 = 1;\n      let counter2 = 2;\n    }"
    },
    {
      "type": "LONG",
      "statement": "What is IIFE(Immediately Invoked Function Expression)",
      "explanation": "IIFE (Immediately Invoked Function Expression) is a JavaScript function that runs as soon as it is defined. The signature of it would be as below,\n\n    (function () {\n      // logic here\n    })();\n    \n\nThe primary reason to use an IIFE is to obtain data privacy because any variables declared within the IIFE cannot be accessed by the outside world. i.e, If you try to access variables with IIFE then it throws an error as below,\n\n    (function () {\n      var message = \"IIFE\";\n      console.log(message);\n    })();\n    console.log(message); //Error: message is not defined"
    },
    {
      "type": "LONG",
      "statement": "What is the benefit of using modules",
      "explanation": "There are a lot of benefits to using modules in favour of a sprawling. Some of the benefits are,\n\n1.  Maintainability\n2.  Reusability\n3.  Namespacing"
    },
    {
      "type": "LONG",
      "statement": "What is memoization",
      "explanation": "Memoization is a programming technique which attempts to increase a function’s performance by caching its previously computed results. Each time a memoized function is called, its parameters are used to index the cache. If the data is present, then it can be returned, without executing the entire function. Otherwise the function is executed and then the result is added to the cache. Let's take an example of adding function with memoization,\n\n    const memoizAddition = () => {\n      let cache = {};\n      return (value) => {\n        if (value in cache) {\n          console.log(\"Fetching from cache\");\n          return cache[value]; // Here, cache.value cannot be used as property name starts with the number which is not a valid JavaScript  identifier. Hence, can only be accessed using the square bracket notation.\n        } else {\n          console.log(\"Calculating result\");\n          let result = value + 20;\n          cache[value] = result;\n          return result;\n        }\n      };\n    };\n    // returned function from memoizAddition\n    const addition = memoizAddition();\n    console.log(addition(20)); //output: 40 calculated\n    console.log(addition(20)); //output: 40 cached"
    },
    {
      "type": "LONG",
      "statement": "What is Hoisting",
      "explanation": "Hoisting is a JavaScript mechanism where variables and function declarations are moved to the top of their scope before code execution. Remember that JavaScript only hoists declarations, not initialisation. Let's take a simple example of variable hoisting,\n\n    console.log(message); //output : undefined\n    var message = \"The variable Has been hoisted\";\n    \n\nThe above code looks like as below to the interpreter,\n\n    var message;\n    console.log(message);\n    message = \"The variable Has been hoisted\";"
    },
    {
      "type": "LONG",
      "statement": "What are classes in ES6",
      "explanation": "In ES6, Javascript classes are primarily syntactic sugar over JavaScript’s existing prototype-based inheritance. For example, the prototype based inheritance written in function expression as below,\n\n    function Bike(model, color) {\n      this.model = model;\n      this.color = color;\n    }\n    \n    Bike.prototype.getDetails = function () {\n      return this.model + \" bike has\" + this.color + \" color\";\n    };\n    \n\nWhereas ES6 classes can be defined as an alternative\n\n    class Bike {\n      constructor(color, model) {\n        this.color = color;\n        this.model = model;\n      }\n    \n      getDetails() {\n        return this.model + \" bike has\" + this.color + \" color\";\n      }\n    }"
    },
    {
      "type": "LONG",
      "statement": "What are closures",
      "explanation": "A closure is the combination of a function and the lexical environment within which that function was declared. i.e, It is an inner function that has access to the outer or enclosing function’s variables. The closure has three scope chains\n\n1.  Own scope where variables defined between its curly brackets\n2.  Outer function’s variables\n3.  Global variables Let's take an example of closure concept,\n\n    function Welcome(name) {\n      var greetingInfo = function (message) {\n        console.log(message + \" \" + name);\n      };\n      return greetingInfo();\n    }\n    var myFunction = Welcome(\"John\");\n    myFunction(\"Welcome \"); //Output: Welcome John\n    myFunction(\"Hello Mr.\"); //output: Hello Mr.John\n    \n\nAs per the above code, the inner function(greetingInfo) has access to the variables in the outer function scope(Welcome) even after the outer function has returned."
    },
    {
      "type": "LONG",
      "statement": "What are modules",
      "explanation": "Modules refer to small units of independent, reusable code and also act as the foundation of many JavaScript design patterns. Most of the JavaScript modules export an object literal, a function, or a constructor"
    },
    {
      "type": "LONG",
      "statement": "Why do you need modules",
      "explanation": "Below are the list of benefits using modules in javascript ecosystem\n\n1.  Maintainability\n2.  Reusability\n3.  Namespacing"
    },
    {
      "type": "LONG",
      "statement": "What is scope in javascript",
      "explanation": "Scope is the accessibility of variables, functions, and objects in some particular part of your code during runtime. In other words, scope determines the visibility of variables and other resources in areas of your code."
    },
    {
      "type": "LONG",
      "statement": "What is a service worker",
      "explanation": "A Service worker is basically a script (JavaScript file) that runs in the background, separate from a web page and provides features that don't need a web page or user interaction. Some of the major features of service workers are Rich offline experiences(offline first web application development), periodic background syncs, push notifications, intercept and handle network requests and programmatically managing a cache of responses."
    },
    {
      "type": "LONG",
      "statement": "How do you manipulate DOM using a service worker",
      "explanation": "Service worker can't access the DOM directly. But it can communicate with the pages it controls by responding to messages sent via the `postMessage` interface, and those pages can manipulate the DOM."
    },
    {
      "type": "LONG",
      "statement": "How do you reuse information across service worker restarts",
      "explanation": "The problem with service worker is that it gets terminated when not in use, and restarted when it's next needed, so you cannot rely on global state within a service worker's `onfetch` and `onmessage` handlers. In this case, service workers will have access to IndexedDB API in order to persist and reuse across restarts."
    },
    {
      "type": "LONG",
      "statement": "What is IndexedDB",
      "explanation": "IndexedDB is a low-level API for client-side storage of larger amounts of structured data, including files/blobs. This API uses indexes to enable high-performance searches of this data."
    },
    {
      "type": "LONG",
      "statement": "What is web storage",
      "explanation": "Web storage is an API that provides a mechanism by which browsers can store key/value pairs locally within the user's browser, in a much more intuitive fashion than using cookies. The web storage provides two mechanisms for storing data on the client.\n\n1.  **Local storage:** It stores data for current origin with no expiration date.\n2.  **Session storage:** It stores data for one session and the data is lost when the browser tab is closed."
    },
    {
      "type": "LONG",
      "statement": "What is a post message",
      "explanation": "Post message is a method that enables cross-origin communication between Window objects.(i.e, between a page and a pop-up that it spawned, or between a page and an iframe embedded within it). Generally, scripts on different pages are allowed to access each other if and only if the pages follow same-origin policy(i.e, pages share the same protocol, port number, and host)."
    },
    {
      "type": "LONG",
      "statement": "What is a Cookie",
      "explanation": "A cookie is a piece of data that is stored on your computer to be accessed by your browser. Cookies are saved as key/value pairs. For example, you can create a cookie named username as below,\n\n    document.cookie = \"username=John\";"
    },
    {
      "type": "LONG",
      "statement": "Why do you need a Cookie",
      "explanation": "Cookies are used to remember information about the user profile(such as username). It basically involves two steps,\n\n1.  When a user visits a web page, the user profile can be stored in a cookie.\n2.  Next time the user visits the page, the cookie remembers the user profile."
    },
    {
      "type": "LONG",
      "statement": "What are the options in a cookie",
      "explanation": "There are few below options available for a cookie,\n\n1.  By default, the cookie is deleted when the browser is closed but you can change this behavior by setting expiry date (in UTC time).\n\n    document.cookie = \"username=John; expires=Sat, 8 Jun 2019 12:00:00 UTC\";\n    \n\n1.  By default, the cookie belongs to a current page. But you can tell the browser what path the cookie belongs to using a path parameter.\n\n    document.cookie = \"username=John; path=/services\";"
    },
    {
      "type": "LONG",
      "statement": "How do you delete a cookie",
      "explanation": "You can delete a cookie by setting the expiry date as a passed date. You don't need to specify a cookie value in this case. For example, you can delete a username cookie in the current page as below.\n\n    document.cookie =\n      \"username=; expires=Fri, 07 Jun 2019 00:00:00 UTC; path=/;\";\n    \n\n**Note:** You should define the cookie path option to ensure that you delete the right cookie. Some browsers doesn't allow to delete a cookie unless you specify a path parameter."
    },
    {
      "type": "LONG",
      "statement": "What are the differences between cookie, local storage and session storage",
      "explanation": "Below are some of the differences between cookie, local storage and session storage,\n\n| Feature | Cookie | Local storage | Session storage | | --------------------------------- | ---------------------------------- | ---------------- | ------------------- | | Accessed on client or server side | Both server-side & client-side | client-side only | client-side only | | Lifetime | As configured using Expires option | until deleted | until tab is closed | | SSL support | Supported | Not supported | Not supported | | Maximum data size | 4KB | 5 MB | 5MB |"
    },
    {
      "type": "LONG",
      "statement": "What is the main difference between localStorage and sessionStorage",
      "explanation": "LocalStorage is the same as SessionStorage but it persists the data even when the browser is closed and reopened(i.e it has no expiration time) whereas in sessionStorage data gets cleared when the page session ends."
    },
    {
      "type": "LONG",
      "statement": "How do you access web storage",
      "explanation": "The Window object implements the `WindowLocalStorage` and `WindowSessionStorage` objects which has `localStorage`(window.localStorage) and `sessionStorage`(window.sessionStorage) properties respectively. These properties create an instance of the Storage object, through which data items can be set, retrieved and removed for a specific domain and storage type (session or local). For example, you can read and write on local storage objects as below\n\n    localStorage.setItem(\"logo\", document.getElementById(\"logo\").value);\n    localStorage.getItem(\"logo\");"
    },
    {
      "type": "LONG",
      "statement": "What are the methods available on session storage",
      "explanation": "The session storage provided methods for reading, writing and clearing the session data\n\n    // Save data to sessionStorage\n    sessionStorage.setItem(\"key\", \"value\");\n    \n    // Get saved data from sessionStorage\n    let data = sessionStorage.getItem(\"key\");\n    \n    // Remove saved data from sessionStorage\n    sessionStorage.removeItem(\"key\");\n    \n    // Remove all saved data from sessionStorage\n    sessionStorage.clear();"
    },
    {
      "type": "LONG",
      "statement": "What is a storage event and its event handler",
      "explanation": "The StorageEvent is an event that fires when a storage area has been changed in the context of another document. Whereas onstorage property is an EventHandler for processing storage events. The syntax would be as below\n\n    window.onstorage = functionRef;\n    \n\nLet's take the example usage of onstorage event handler which logs the storage key and it's values\n\n    window.onstorage = function (e) {\n      console.log(\n        \"The \" +\n          e.key +\n          \" key has been changed from \" +\n          e.oldValue +\n          \" to \" +\n          e.newValue +\n          \".\"\n      );\n    };"
    },
    {
      "type": "LONG",
      "statement": "Why do you need web storage",
      "explanation": "Web storage is more secure, and large amounts of data can be stored locally, without affecting website performance. Also, the information is never transferred to the server. Hence this is a more recommended approach than Cookies."
    },
    {
      "type": "LONG",
      "statement": "How do you check web storage browser support",
      "explanation": "You need to check browser support for localStorage and sessionStorage before using web storage,\n\n    if (typeof Storage !== \"undefined\") {\n      // Code for localStorage/sessionStorage.\n    } else {\n      // Sorry! No Web Storage support..\n    }"
    },
    {
      "type": "LONG",
      "statement": "How do you check web workers browser support",
      "explanation": "You need to check browser support for web workers before using it\n\n    if (typeof Worker !== \"undefined\") {\n      // code for Web worker support.\n    } else {\n      // Sorry! No Web Worker support..\n    }"
    },
    {
      "type": "LONG",
      "statement": "Give an example of a web worker",
      "explanation": "You need to follow below steps to start using web workers for counting example\n\n1.  Create a Web Worker File: You need to write a script to increment the count value. Let's name it as counter.js\n\n    let i = 0;\n    \n    function timedCount() {\n      i = i + 1;\n      postMessage(i);\n      setTimeout(\"timedCount()\", 500);\n    }\n    \n    timedCount();\n    \n\nHere postMessage() method is used to post a message back to the HTML page\n\n1.  Create a Web Worker Object: You can create a web worker object by checking for browser support. Let's name this file as web\\_worker\\_example.js\n\n    if (typeof w == \"undefined\") {\n      w = new Worker(\"counter.js\");\n    }\n    \n\nand we can receive messages from web worker\n\n    w.onmessage = function (event) {\n      document.getElementById(\"message\").innerHTML = event.data;\n    };\n    \n\n1.  Terminate a Web Worker: Web workers will continue to listen for messages (even after the external script is finished) until it is terminated. You can use the terminate() method to terminate listening to the messages.\n\n    w.terminate();\n    \n\n1.  Reuse the Web Worker: If you set the worker variable to undefined you can reuse the code\n\n    w = undefined;"
    },
    {
      "type": "LONG",
      "statement": "What are the restrictions of web workers on DOM",
      "explanation": "WebWorkers don't have access to below javascript objects since they are defined in an external files\n\n1.  Window object\n2.  Document object\n3.  Parent object"
    },
    {
      "type": "LONG",
      "statement": "What is a promise",
      "explanation": "A promise is an object that may produce a single value some time in the future with either a resolved value or a reason that it’s not resolved(for example, network error). It will be in one of the 3 possible states: fulfilled, rejected, or pending.\n\nThe syntax of Promise creation looks like below,\n\n    const promise = new Promise(function (resolve, reject) {\n      // promise description\n    });\n    \n\nThe usage of a promise would be as below,\n\n    const promise = new Promise(\n      (resolve) => {\n        setTimeout(() => {\n          resolve(\"I'm a Promise!\");\n        }, 5000);\n      },\n      (reject) => {}\n    );\n    \n    promise.then((value) => console.log(value));\n    \n\nThe action flow of a promise will be as below,"
    },
    {
      "type": "LONG",
      "statement": "Why do you need a promise",
      "explanation": "Promises are used to handle asynchronous operations. They provide an alternative approach for callbacks by reducing the callback hell and writing the cleaner code."
    },
    {
      "type": "LONG",
      "statement": "What are the three states of promise",
      "explanation": "Promises have three states:\n\n1.  **Pending:** This is an initial state of the Promise before an operation begins\n2.  **Fulfilled:** This state indicates that the specified operation was completed.\n3.  **Rejected:** This state indicates that the operation did not complete. In this case an error value will be thrown."
    },
    {
      "type": "LONG",
      "statement": "What is a callback function",
      "explanation": "A callback function is a function passed into another function as an argument. This function is invoked inside the outer function to complete an action. Let's take a simple example of how to use callback function\n\n    function callbackFunction(name) {\n      console.log(\"Hello \" + name);\n    }\n    \n    function outerFunction(callback) {\n      let name = prompt(\"Please enter your name.\");\n      callback(name);\n    }\n    \n    outerFunction(callbackFunction);"
    },
    {
      "type": "LONG",
      "statement": "Why do we need callbacks",
      "explanation": "The callbacks are needed because javascript is an event driven language. That means instead of waiting for a response javascript will keep executing while listening for other events. Let's take an example with the first function invoking an API call(simulated by setTimeout) and the next function which logs the message.\n\n    function firstFunction() {\n      // Simulate a code delay\n      setTimeout(function () {\n        console.log(\"First function called\");\n      }, 1000);\n    }\n    function secondFunction() {\n      console.log(\"Second function called\");\n    }\n    firstFunction();\n    secondFunction();\n    \n    Output;\n    // Second function called\n    // First function called\n    \n\nAs observed from the output, javascript didn't wait for the response of the first function and the remaining code block got executed. So callbacks are used in a way to make sure that certain code doesn’t execute until the other code finishes execution."
    },
    {
      "type": "LONG",
      "statement": "What is a callback hell",
      "explanation": "Callback Hell is an anti-pattern with multiple nested callbacks which makes code hard to read and debug when dealing with asynchronous logic. The callback hell looks like below,\n\n    async1(function(){\n        async2(function(){\n            async3(function(){\n                async4(function(){\n                    ....\n                });\n            });\n        });\n    });"
    },
    {
      "type": "LONG",
      "statement": "What are server-sent events",
      "explanation": "Server-sent events (SSE) is a server push technology enabling a browser to receive automatic updates from a server via HTTP connection without resorting to polling. These are a one way communications channel - events flow from server to client only. This has been used in Facebook/Twitter updates, stock price updates, news feeds etc."
    },
    {
      "type": "LONG",
      "statement": "How do you receive server-sent event notifications",
      "explanation": "The EventSource object is used to receive server-sent event notifications. For example, you can receive messages from server as below,\n\n    if (typeof EventSource !== \"undefined\") {\n      var source = new EventSource(\"sse_generator.js\");\n      source.onmessage = function (event) {\n        document.getElementById(\"output\").innerHTML += event.data + \"<br>\";\n      };\n    }"
    },
    {
      "type": "LONG",
      "statement": "How do you check browser support for server-sent events",
      "explanation": "You can perform browser support for server-sent events before using it as below,\n\n    if (typeof EventSource !== \"undefined\") {\n      // Server-sent events supported. Let's have some code here!\n    } else {\n      // No server-sent events supported\n    }"
    },
    {
      "type": "LONG",
      "statement": "What are the events available for server sent events",
      "explanation": "Below are the list of events available for server sent events | Event | Description | |---- | --------- | onopen | It is used when a connection to the server is opened | | onmessage | This event is used when a message is received | | onerror | It happens when an error occurs|"
    },
    {
      "type": "LONG",
      "statement": "What are the main rules of promise",
      "explanation": "A promise must follow a specific set of rules,\n\n1.  A promise is an object that supplies a standard-compliant `.then()` method\n2.  A pending promise may transition into either fulfilled or rejected state\n3.  A fulfilled or rejected promise is settled and it must not transition into any other state.\n4.  Once a promise is settled, the value must not change."
    },
    {
      "type": "LONG",
      "statement": "What is callback in callback",
      "explanation": "You can nest one callback inside in another callback to execute the actions sequentially one by one. This is known as callbacks in callbacks.\n\n    loadScript(\"/script1.js\", function (script) {\n      console.log(\"first script is loaded\");\n    \n      loadScript(\"/script2.js\", function (script) {\n        console.log(\"second script is loaded\");\n    \n        loadScript(\"/script3.js\", function (script) {\n          console.log(\"third script is loaded\");\n          // after all scripts are loaded\n        });\n      });\n    });"
    },
    {
      "type": "LONG",
      "statement": "What is promise chaining",
      "explanation": "The process of executing a sequence of asynchronous tasks one after another using promises is known as Promise chaining. Let's take an example of promise chaining for calculating the final result,\n\n    new Promise(function (resolve, reject) {\n      setTimeout(() => resolve(1), 1000);\n    })\n      .then(function (result) {\n        console.log(result); // 1\n        return result * 2;\n      })\n      .then(function (result) {\n        console.log(result); // 2\n        return result * 3;\n      })\n      .then(function (result) {\n        console.log(result); // 6\n        return result * 4;\n      });\n    \n\nIn the above handlers, the result is passed to the chain of .then() handlers with the below work flow,\n\n1.  The initial promise resolves in 1 second,\n2.  After that `.then` handler is called by logging the result(1) and then return a promise with the value of result \\* 2.\n3.  After that the value passed to the next `.then` handler by logging the result(2) and return a promise with result \\* 3.\n4.  Finally the value passed to the last `.then` handler by logging the result(6) and return a promise with result \\* 4."
    },
    {
      "type": "LONG",
      "statement": "What is promise.all",
      "explanation": "Promise.all is a promise that takes an array of promises as an input (an iterable), and it gets resolved when all the promises get resolved or any one of them gets rejected. For example, the syntax of promise.all method is below,\n\n    Promise.all([Promise1, Promise2, Promise3]) .then(result) => {   console.log(result) }) .catch(error => console.log(`Error in promises ${error}`))\n    \n\n**Note:** Remember that the order of the promises(output the result) is maintained as per input order."
    },
    {
      "type": "LONG",
      "statement": "What is the purpose of the race method in promise",
      "explanation": "Promise.race() method will return the promise instance which is firstly resolved or rejected. Let's take an example of race() method where promise2 is resolved first\n\n    var promise1 = new Promise(function (resolve, reject) {\n      setTimeout(resolve, 500, \"one\");\n    });\n    var promise2 = new Promise(function (resolve, reject) {\n      setTimeout(resolve, 100, \"two\");\n    });\n    \n    Promise.race([promise1, promise2]).then(function (value) {\n      console.log(value); // \"two\" // Both promises will resolve, but promise2 is faster\n    });"
    },
    {
      "type": "LONG",
      "statement": "What is a strict mode in javascript",
      "explanation": "Strict Mode is a new feature in ECMAScript 5 that allows you to place a program, or a function, in a “strict” operating context. This way it prevents certain actions from being taken and throws more exceptions. The literal expression `\"use strict\";` instructs the browser to use the javascript code in the Strict mode."
    },
    {
      "type": "LONG",
      "statement": "Why do you need strict mode",
      "explanation": "Strict mode is useful to write \"secure\" JavaScript by notifying \"bad syntax\" into real errors. For example, it eliminates accidentally creating a global variable by throwing an error and also throws an error for assignment to a non-writable property, a getter-only property, a non-existing property, a non-existing variable, or a non-existing object."
    },
    {
      "type": "LONG",
      "statement": "How do you declare strict mode",
      "explanation": "The strict mode is declared by adding \"use strict\"; to the beginning of a script or a function. If declared at the beginning of a script, it has global scope.\n\n    \"use strict\";\n    x = 3.14; // This will cause an error because x is not declared\n    \n\nand if you declare inside a function, it has local scope\n\n    x = 3.14; // This will not cause an error.\n    myFunction();\n    \n    function myFunction() {\n      \"use strict\";\n      y = 3.14; // This will cause an error\n    }"
    },
    {
      "type": "LONG",
      "statement": "What is the purpose of double exclamation",
      "explanation": "The double exclamation or negation(!!) ensures the resulting type is a boolean. If it was falsey (e.g. 0, null, undefined, etc.), it will be false, otherwise, true. For example, you can test IE version using this expression as below,\n\n    let isIE8 = false;\n    isIE8 = !!navigator.userAgent.match(/MSIE 8.0/);\n    console.log(isIE8); // returns true or false\n    \n\nIf you don't use this expression then it returns the original value.\n\n    console.log(navigator.userAgent.match(/MSIE 8.0/)); // returns either an Array or null\n    \n\n**Note:** The expression !! is not an operator, but it is just twice of ! operator."
    },
    {
      "type": "LONG",
      "statement": "What is the purpose of the delete operator",
      "explanation": "The delete keyword is used to delete the property as well as its value.\n\n    var user = { name: \"John\", age: 20 };\n    delete user.age;\n    \n    console.log(user); // {name: \"John\"}"
    },
    {
      "type": "LONG",
      "statement": "What is the typeof operator",
      "explanation": "You can use the JavaScript typeof operator to find the type of a JavaScript variable. It returns the type of a variable or an expression.\n\n    typeof \"John Abraham\"; // Returns \"string\"\n    typeof (1 + 2); // Returns \"number\""
    },
    {
      "type": "LONG",
      "statement": "What is undefined property",
      "explanation": "The undefined property indicates that a variable has not been assigned a value, or not declared at all. The type of undefined value is undefined too.\n\n    var user; // Value is undefined, type is undefined\n    console.log(typeof user); //undefined\n    \n\nAny variable can be emptied by setting the value to undefined.\n\n    user = undefined;"
    },
    {
      "type": "LONG",
      "statement": "What is null value",
      "explanation": "The value null represents the intentional absence of any object value. It is one of JavaScript's primitive values. The type of null value is object. You can empty the variable by setting the value to null.\n\n    var user = null;\n    console.log(typeof user); //object"
    },
    {
      "type": "LONG",
      "statement": "What is the difference between null and undefined",
      "explanation": "Below are the main differences between null and undefined,\n\n| Null | Undefined | | ----------------------------------------------------------------------------------------------- | ------------------------------------------------------------------------------------------------------- | | It is an assignment value which indicates that variable points to no object. | It is not an assignment value where a variable has been declared but has not yet been assigned a value. | | Type of null is object | Type of undefined is undefined | | The null value is a primitive value that represents the null, empty, or non-existent reference. | The undefined value is a primitive value used when a variable has not been assigned a value. | | Indicates the absence of a value for a variable | Indicates absence of variable itself | | Converted to zero (0) while performing primitive operations | Converted to NaN while performing primitive operations |"
    },
    {
      "type": "LONG",
      "statement": "What is eval",
      "explanation": "The eval() function evaluates JavaScript code represented as a string. The string can be a JavaScript expression, variable, statement, or sequence of statements.\n\n    console.log(eval(\"1 + 2\")); //  3"
    },
    {
      "type": "LONG",
      "statement": "What is the difference between window and document",
      "explanation": "Below are the main differences between window and document,\n\n| Window | Document | | ----------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------- | | It is the root level element in any web page | It is the direct child of the window object. This is also known as Document Object Model(DOM) | | By default window object is available implicitly in the page | You can access it via window.document or document. | | It has methods like alert(), confirm() and properties like document, location | It provides methods like getElementById, getElementByTagName, createElement etc |"
    },
    {
      "type": "LONG",
      "statement": "How do you access history in javascript",
      "explanation": "The window.history object contains the browser's history. You can load previous and next URLs in the history using back() and next() methods.\n\n    function goBack() {\n      window.history.back();\n    }\n    function goForward() {\n      window.history.forward();\n    }\n    \n\n**Note:** You can also access history without window prefix."
    },
    {
      "type": "LONG",
      "statement": "What are the javascript data types",
      "explanation": "Below are the list of javascript data types available\n\n1.  Number\n2.  String\n3.  Boolean\n4.  Object\n5.  Undefined"
    },
    {
      "type": "LONG",
      "statement": "What is isNaN",
      "explanation": "The isNaN() function is used to determine whether a value is an illegal number (Not-a-Number) or not. i.e, This function returns true if the value equates to NaN. Otherwise it returns false.\n\n    isNaN(\"Hello\"); //true\n    isNaN(\"100\"); //false"
    },
    {
      "type": "LONG",
      "statement": "What are the differences between undeclared and undefined variables",
      "explanation": "Below are the major differences between undeclared and undefined variables,\n\n| undeclared | undefined | | ------------------------------------------------------------------------------------------- | -------------------------------------------------------------------------------------- | | These variables do not exist in a program and are not declared | These variables declared in the program but have not assigned any value | | If you try to read the value of an undeclared variable, then a runtime error is encountered | If you try to read the value of an undefined variable, an undefined value is returned. |"
    },
    {
      "type": "LONG",
      "statement": "What are global variables",
      "explanation": "Global variables are those that are available throughout the length of the code without any scope. The var keyword is used to declare a local variable but if you omit it then it will become global variable\n\n    msg = \"Hello\"; // var is missing, it becomes global variable"
    },
    {
      "type": "LONG",
      "statement": "What are the problems with global variables",
      "explanation": "The problem with global variables is the conflict of variable names of local and global scope. It is also difficult to debug and test the code that relies on global variables."
    },
    {
      "type": "LONG",
      "statement": "What is NaN property",
      "explanation": "The NaN property is a global property that represents \"Not-a-Number\" value. i.e, It indicates that a value is not a legal number. It is very rare to use NaN in a program but it can be used as return value for few cases\n\n    Math.sqrt(-1);\n    parseInt(\"Hello\");"
    },
    {
      "type": "LONG",
      "statement": "What is the purpose of isFinite function",
      "explanation": "The isFinite() function is used to determine whether a number is a finite, legal number. It returns false if the value is +infinity, -infinity, or NaN (Not-a-Number), otherwise it returns true.\n\n    isFinite(Infinity); // false\n    isFinite(NaN); // false\n    isFinite(-Infinity); // false\n    \n    isFinite(100); // true"
    },
    {
      "type": "LONG",
      "statement": "What is an event flow",
      "explanation": "Event flow is the order in which event is received on the web page. When you click an element that is nested in various other elements, before your click actually reaches its destination, or target element, it must trigger the click event for each of its parent elements first, starting at the top with the global window object. There are two ways of event flow\n\n1.  Top to Bottom(Event Capturing)\n2.  Bottom to Top (Event Bubbling)"
    },
    {
      "type": "LONG",
      "statement": "What is event bubbling",
      "explanation": "Event bubbling is a type of event propagation where the event first triggers on the innermost target element, and then successively triggers on the ancestors (parents) of the target element in the same nesting hierarchy till it reaches the outermost DOM element."
    },
    {
      "type": "LONG",
      "statement": "What is event capturing",
      "explanation": "Event capturing is a type of event propagation where the event is first captured by the outermost element, and then successively triggers on the descendants (children) of the target element in the same nesting hierarchy till it reaches the innermost DOM element."
    },
    {
      "type": "LONG",
      "statement": "How do you submit a form using JavaScript",
      "explanation": "You can submit a form using JavaScript use document.form\\[0\\].submit(). All the form input's information is submitted using onsubmit event handler\n\n    function submit() {\n      document.form[0].submit();\n    }"
    },
    {
      "type": "LONG",
      "statement": "How do you find operating system details",
      "explanation": "The window.navigator object contains information about the visitor's browser OS details. Some of the OS properties are available under platform property,\n\n    console.log(navigator.platform);"
    },
    {
      "type": "LONG",
      "statement": "What is the difference between document load and DOMContentLoaded events",
      "explanation": "The `DOMContentLoaded` event is fired when the initial HTML document has been completely loaded and parsed, without waiting for assets(stylesheets, images, and subframes) to finish loading. Whereas The load event is fired when the whole page has loaded, including all dependent resources(stylesheets, images)."
    },
    {
      "type": "LONG",
      "statement": "What is the difference between native, host and user objects",
      "explanation": "`Native objects` are objects that are part of the JavaScript language defined by the ECMAScript specification. For example, String, Math, RegExp, Object, Function etc core objects defined in the ECMAScript spec. `Host objects` are objects provided by the browser or runtime environment (Node). For example, window, XmlHttpRequest, DOM nodes etc are considered as host objects. `User objects` are objects defined in the javascript code. For example, User objects created for profile information."
    },
    {
      "type": "LONG",
      "statement": "What are the tools or techniques used for debugging JavaScript code",
      "explanation": "You can use below tools or techniques for debugging javascript\n\n1.  Chrome Devtools\n2.  debugger statement\n3.  Good old console.log statement"
    },
    {
      "type": "LONG",
      "statement": "What are the pros and cons of promises over callbacks",
      "explanation": "Below are the list of pros and cons of promises over callbacks,\n\n**Pros:**\n\n1.  It avoids callback hell which is unreadable\n2.  Easy to write sequential asynchronous code with .then()\n3.  Easy to write parallel asynchronous code with Promise.all()\n4.  Solves some of the common problems of callbacks(call the callback too late, too early, many times and swallow errors/exceptions)\n\n**Cons:**\n\n1.  It makes little complex code\n2.  You need to load a polyfill if ES6 is not supported"
    },
    {
      "type": "LONG",
      "statement": "What is the difference between an attribute and a property",
      "explanation": "Attributes are defined on the HTML markup whereas properties are defined on the DOM. For example, the below HTML element has 2 attributes type and value,\n\n    <input type=\"text\" value=\"Name:\">\n    \n\nYou can retrieve the attribute value as below,\n\n    const input = document.querySelector(\"input\");\n    console.log(input.getAttribute(\"value\")); // Good morning\n    console.log(input.value); // Good morning\n    \n\nAnd after you change the value of the text field to \"Good evening\", it becomes like\n\n    console.log(input.getAttribute(\"value\")); // Good morning\n    console.log(input.value); // Good evening"
    },
    {
      "type": "LONG",
      "statement": "What is same-origin policy",
      "explanation": "The same-origin policy is a policy that prevents JavaScript from making requests across domain boundaries. An origin is defined as a combination of URI scheme, hostname, and port number. If you enable this policy then it prevents a malicious script on one page from obtaining access to sensitive data on another web page using Document Object Model(DOM)."
    },
    {
      "type": "LONG",
      "statement": "What is the purpose of void 0",
      "explanation": "Void(0) is used to prevent the page from refreshing. This will be helpful to eliminate the unwanted side-effect, because it will return the undefined primitive value. It is commonly used for HTML documents that use href=\"JavaScript:Void(0);\" within an `<a>` element. i.e, when you click a link, the browser loads a new page or refreshes the same page. But this behavior will be prevented using this expression. For example, the below link notify the message without reloading the page\n\n    <a href=\"JavaScript:void(0);\" onclick=\"alert('Well done!')\">\n      Click Me!\n    </a>"
    },
    {
      "type": "LONG",
      "statement": "Is JavaScript a compiled or interpreted language",
      "explanation": "JavaScript is an interpreted language, not a compiled language. An interpreter in the browser reads over the JavaScript code, interprets each line, and runs it. Nowadays modern browsers use a technology known as Just-In-Time (JIT) compilation, which compiles JavaScript to executable bytecode just as it is about to run."
    },
    {
      "type": "LONG",
      "statement": "Is JavaScript a case-sensitive language",
      "explanation": "Yes, JavaScript is a case sensitive language. The language keywords, variables, function & object names, and any other identifiers must always be typed with a consistent capitalization of letters."
    },
    {
      "type": "LONG",
      "statement": "Is there any relation between Java and JavaScript",
      "explanation": "No, they are entirely two different programming languages and have nothing to do with each other. But both of them are Object Oriented Programming languages and like many other languages, they follow similar syntax for basic features(if, else, for, switch, break, continue etc)."
    },
    {
      "type": "LONG",
      "statement": "What are events",
      "explanation": "Events are \"things\" that happen to HTML elements. When JavaScript is used in HTML pages, JavaScript can `react` on these events. Some of the examples of HTML events are,\n\n1.  Web page has finished loading\n2.  Input field was changed\n3.  Button was clicked\n\nLet's describe the behavior of click event for button element,\n\n    <!doctype html>\n    <html>\n     <head>\n       <script>\n         function greeting() {\n           alert('Hello! Good morning');\n         }\n       </script>\n     </head>\n     <body>\n       <button type=\"button\" onclick=\"greeting()\">Click me</button>\n     </body>\n    </html>"
    },
    {
      "type": "LONG",
      "statement": "Who created javascript",
      "explanation": "JavaScript was created by Brendan Eich in 1995 during his time at Netscape Communications. Initially it was developed under the name `Mocha`, but later the language was officially called `LiveScript` when it first shipped in beta releases of Netscape."
    },
    {
      "type": "LONG",
      "statement": "What is the use of preventDefault method",
      "explanation": "The preventDefault() method cancels the event if it is cancelable, meaning that the default action or behaviour that belongs to the event will not occur. For example, prevent form submission when clicking on submit button and prevent opening the page URL when clicking on hyperlink are some common use cases.\n\n    document\n      .getElementById(\"link\")\n      .addEventListener(\"click\", function (event) {\n        event.preventDefault();\n      });\n    \n\n**Note:** Remember that not all events are cancelable."
    },
    {
      "type": "LONG",
      "statement": "What is the use of stopPropagation method",
      "explanation": "The stopPropagation method is used to stop the event from bubbling up the event chain. For example, the below nested divs with stopPropagation method prevents default event propagation when clicking on nested div(Div1)\n\n    <p>Click DIV1 Element</p>\n    <div onclick=\"secondFunc()\">DIV 2\n      <div onclick=\"firstFunc(event)\">DIV 1</div>\n    </div>\n    \n    <script>\n    function firstFunc(event) {\n      alert(\"DIV 1\");\n      event.stopPropagation();\n    }\n    \n    function secondFunc() {\n      alert(\"DIV 2\");\n    }\n    </script>"
    },
    {
      "type": "LONG",
      "statement": "What are the steps involved in return false usage",
      "explanation": "The return false statement in event handlers performs the below steps,\n\n1.  First it stops the browser's default action or behaviour.\n2.  It prevents the event from propagating the DOM\n3.  Stops callback execution and returns immediately when called."
    },
    {
      "type": "LONG",
      "statement": "What is BOM",
      "explanation": "The Browser Object Model (BOM) allows JavaScript to \"talk to\" the browser. It consists of the objects navigator, history, screen, location and document which are children of the window. The Browser Object Model is not standardized and can change based on different browsers."
    },
    {
      "type": "LONG",
      "statement": "What is the use of setTimeout",
      "explanation": "The setTimeout() method is used to call a function or evaluate an expression after a specified number of milliseconds. For example, let's log a message after 2 seconds using setTimeout method,\n\n    setTimeout(function () {\n      console.log(\"Good morning\");\n    }, 2000);"
    },
    {
      "type": "LONG",
      "statement": "What is the use of setInterval",
      "explanation": "The setInterval() method is used to call a function or evaluate an expression at specified intervals (in milliseconds). For example, let's log a message after 2 seconds using setInterval method,\n\n    setInterval(function () {\n      console.log(\"Good morning\");\n    }, 2000);"
    },
    {
      "type": "LONG",
      "statement": "Why is JavaScript treated as Single threaded",
      "explanation": "JavaScript is a single-threaded language. Because the language specification does not allow the programmer to write code so that the interpreter can run parts of it in parallel in multiple threads or processes. Whereas languages like java, go, C++ can make multi-threaded and multi-process programs."
    },
    {
      "type": "LONG",
      "statement": "What is an event delegation",
      "explanation": "Event delegation is a technique for listening to events where you delegate a parent element as the listener for all of the events that happen inside it.\n\nFor example, if you wanted to detect field changes in inside a specific form, you can use event delegation technique,\n\n    var form = document.querySelector(\"#registration-form\");\n    \n    // Listen for changes to fields inside the form\n    form.addEventListener(\n      \"input\",\n      function (event) {\n        // Log the field that was changed\n        console.log(event.target);\n      },\n      false\n    );"
    },
    {
      "type": "LONG",
      "statement": "What is ECMAScript",
      "explanation": "ECMAScript is the scripting language that forms the basis of JavaScript. ECMAScript standardized by the ECMA International standards organization in the ECMA-262 and ECMA-402 specifications. The first edition of ECMAScript was released in 1997."
    },
    {
      "type": "LONG",
      "statement": "What is JSON",
      "explanation": "JSON (JavaScript Object Notation) is a lightweight format that is used for data interchanging. It is based on a subset of JavaScript language in the way objects are built in JavaScript."
    },
    {
      "type": "LONG",
      "statement": "What are the syntax rules of JSON",
      "explanation": "Below are the list of syntax rules of JSON\n\n1.  The data is in name/value pairs\n2.  The data is separated by commas\n3.  Curly braces hold objects\n4.  Square brackets hold arrays"
    },
    {
      "type": "LONG",
      "statement": "What is the purpose JSON stringify",
      "explanation": "When sending data to a web server, the data has to be in a string format. You can achieve this by converting JSON object into a string using stringify() method.\n\n    var userJSON = { name: \"John\", age: 31 };\n    var userString = JSON.stringify(user);\n    console.log(userString); //\"{\"name\":\"John\",\"age\":31}\""
    },
    {
      "type": "LONG",
      "statement": "How do you parse JSON string",
      "explanation": "When receiving the data from a web server, the data is always in a string format. But you can convert this string value to a javascript object using parse() method.\n\n    var userString = '{\"name\":\"John\",\"age\":31}';\n    var userJSON = JSON.parse(userString);\n    console.log(userJSON); // {name: \"John\", age: 31}"
    },
    {
      "type": "LONG",
      "statement": "Why do you need JSON",
      "explanation": "When exchanging data between a browser and a server, the data can only be text. Since JSON is text only, it can easily be sent to and from a server, and used as a data format by any programming language."
    },
    {
      "type": "LONG",
      "statement": "What are PWAs",
      "explanation": "Progressive web applications (PWAs) are a type of mobile app delivered through the web, built using common web technologies including HTML, CSS and JavaScript. These PWAs are deployed to servers, accessible through URLs, and indexed by search engines."
    },
    {
      "type": "LONG",
      "statement": "What is the purpose of clearTimeout method",
      "explanation": "The clearTimeout() function is used in javascript to clear the timeout which has been set by setTimeout()function before that. i.e, The return value of setTimeout() function is stored in a variable and it’s passed into the clearTimeout() function to clear the timer.\n\nFor example, the below setTimeout method is used to display the message after 3 seconds. This timeout can be cleared by the clearTimeout() method.\n\n    <script>\n    var msg;\n    function greeting() {\n       alert('Good morning');\n    }\n    function start() {\n      msg =setTimeout(greeting, 3000);\n    \n    }\n    \n    function stop() {\n        clearTimeout(msg);\n    }\n    </script>"
    },
    {
      "type": "LONG",
      "statement": "What is the purpose of clearInterval method",
      "explanation": "The clearInterval() function is used in javascript to clear the interval which has been set by setInterval() function. i.e, The return value returned by setInterval() function is stored in a variable and it’s passed into the clearInterval() function to clear the interval.\n\nFor example, the below setInterval method is used to display the message for every 3 seconds. This interval can be cleared by the clearInterval() method.\n\n    <script>\n    var msg;\n    function greeting() {\n       alert('Good morning');\n    }\n    function start() {\n      msg = setInterval(greeting, 3000);\n    \n    }\n    \n    function stop() {\n        clearInterval(msg);\n    }\n    </script>"
    },
    {
      "type": "LONG",
      "statement": "How do you redirect new page in javascript",
      "explanation": "In vanilla javascript, you can redirect to a new page using the `location` property of window object. The syntax would be as follows,\n\n    function redirect() {\n      window.location.href = \"newPage.html\";\n    }"
    },
    {
      "type": "LONG",
      "statement": "How do you check whether a string contains a substring",
      "explanation": "There are 3 possible ways to check whether a string contains a substring or not,\n\n1.  **Using includes:** ES6 provided `String.prototype.includes` method to test a string contains a substring\n\n    var mainString = \"hello\",\n      subString = \"hell\";\n    mainString.includes(subString);\n    \n\n1.  **Using indexOf:** In an ES5 or older environment, you can use `String.prototype.indexOf` which returns the index of a substring. If the index value is not equal to -1 then it means the substring exists in the main string.\n\n    var mainString = \"hello\",\n      subString = \"hell\";\n    mainString.indexOf(subString) !== -1;\n    \n\n1.  **Using RegEx:** The advanced solution is using Regular expression's test method(`RegExp.test`), which allows for testing for against regular expressions\n\n    var mainString = \"hello\",\n      regex = /hell/;\n    regex.test(mainString);"
    },
    {
      "type": "LONG",
      "statement": "How do you validate an email in javascript",
      "explanation": "You can validate an email in javascript using regular expressions. It is recommended to do validations on the server side instead of the client side. Because the javascript can be disabled on the client side.\n\n    function validateEmail(email) {\n      var re = /^(([^<>()\\[\\]\\\\.,;:\\s@\"]+(\\.[^<>()\\[\\]\\\\.,;:\\s@\"]+)*)|(\".+\"))@((\\[[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}\\])|(([a-zA-Z\\-0-9]+\\.)+[a-zA-Z]{2,}))$/;\n      return re.test(String(email).toLowerCase());\n    }\n    \n\nThe above regular expression accepts unicode characters."
    },
    {
      "type": "LONG",
      "statement": "How do you get the current url with javascript",
      "explanation": "You can use `window.location.href` expression to get the current url path and you can use the same expression for updating the URL too. You can also use `document.URL` for read-only purposes but this solution has issues in FF.\n\n    console.log(\"location.href\", window.location.href); // Returns full URL"
    },
    {
      "type": "LONG",
      "statement": "What are the various url properties of location object",
      "explanation": "The below `Location` object properties can be used to access URL components of the page,\n\n1.  href - The entire URL\n2.  protocol - The protocol of the URL\n3.  host - The hostname and port of the URL\n4.  hostname - The hostname of the URL\n5.  port - The port number in the URL\n6.  pathname - The path name of the URL\n7.  search - The query portion of the URL\n8.  hash - The anchor portion of the URL"
    },
    {
      "type": "LONG",
      "statement": "How do get query string values in javascript",
      "explanation": "You can use URLSearchParams to get query string values in javascript. Let's see an example to get the client code value from URL query string,\n\n    const urlParams = new URLSearchParams(window.location.search);\n    const clientCode = urlParams.get(\"clientCode\");"
    },
    {
      "type": "LONG",
      "statement": "How do you check if a key exists in an object",
      "explanation": "You can check whether a key exists in an object or not using three approaches,\n\n1.  **Using in operator:** You can use the in operator whether a key exists in an object or not\n\n    \"key\" in obj;\n    \n\nand If you want to check if a key doesn't exist, remember to use parenthesis,\n\n    !(\"key\" in obj);\n    \n\n1.  **Using hasOwnProperty method:** You can use `hasOwnProperty` to particularly test for properties of the object instance (and not inherited properties)\n\n    obj.hasOwnProperty(\"key\"); // true\n    \n\n1.  **Using undefined comparison:** If you access a non-existing property from an object, the result is undefined. Let’s compare the properties against undefined to determine the existence of the property.\n\n    const user = {\n      name: \"John\",\n    };\n    \n    console.log(user.name !== undefined); // true\n    console.log(user.nickName !== undefined); // false"
    },
    {
      "type": "LONG",
      "statement": "How do you loop through or enumerate javascript object",
      "explanation": "You can use the `for-in` loop to loop through javascript object. You can also make sure that the key you get is an actual property of an object, and doesn't come from the prototype using `hasOwnProperty` method.\n\n    var object = {\n      k1: \"value1\",\n      k2: \"value2\",\n      k3: \"value3\",\n    };\n    \n    for (var key in object) {\n      if (object.hasOwnProperty(key)) {\n        console.log(key + \" -> \" + object[key]); // k1 -> value1 ...\n      }\n    }"
    },
    {
      "type": "LONG",
      "statement": "How do you test for an empty object",
      "explanation": "There are different solutions based on ECMAScript versions\n\n1.  **Using Object entries(ECMA 7+):** You can use object entries length along with constructor type.\n\n    Object.entries(obj).length === 0 && obj.constructor === Object; // Since date object length is 0, you need to check constructor check as well\n    \n\n1.  **Using Object keys(ECMA 5+):** You can use object keys length along with constructor type.\n\n    Object.keys(obj).length === 0 && obj.constructor === Object; // Since date object length is 0, you need to check constructor check as well\n    \n\n1.  **Using for-in with hasOwnProperty(Pre-ECMA 5):** You can use a for-in loop along with hasOwnProperty.\n\n    function isEmpty(obj) {\n      for (var prop in obj) {\n        if (obj.hasOwnProperty(prop)) {\n          return false;\n        }\n      }\n    \n      return JSON.stringify(obj) === JSON.stringify({});\n    }"
    },
    {
      "type": "LONG",
      "statement": "What is an arguments object",
      "explanation": "The arguments object is an Array-like object accessible inside functions that contains the values of the arguments passed to that function. For example, let's see how to use arguments object inside sum function,\n\n    function sum() {\n      var total = 0;\n      for (var i = 0, len = arguments.length; i < len; ++i) {\n        total += arguments[i];\n      }\n      return total;\n    }\n    \n    sum(1, 2, 3); // returns 6\n    \n\n**Note:** You can't apply array methods on arguments object. But you can convert into a regular array as below.\n\n    var argsArray = Array.prototype.slice.call(arguments);"
    },
    {
      "type": "LONG",
      "statement": "How do you make first letter of the string in an uppercase",
      "explanation": "You can create a function which uses a chain of string methods such as charAt, toUpperCase and slice methods to generate a string with the first letter in uppercase.\n\n    function capitalizeFirstLetter(string) {\n      return string.charAt(0).toUpperCase() + string.slice(1);\n    }"
    },
    {
      "type": "LONG",
      "statement": "What are the pros and cons of for loop",
      "explanation": "The for-loop is a commonly used iteration syntax in javascript. It has both pros and cons ####Pros\n\n1.  Works on every environment\n2.  You can use break and continue flow control statements\n\n####Cons\n\n1.  Too verbose\n2.  Imperative\n3.  You might face one-by-off errors"
    },
    {
      "type": "LONG",
      "statement": "How do you display the current date in javascript",
      "explanation": "You can use `new Date()` to generate a new Date object containing the current date and time. For example, let's display the current date in mm/dd/yyyy\n\n    var today = new Date();\n    var dd = String(today.getDate()).padStart(2, \"0\");\n    var mm = String(today.getMonth() + 1).padStart(2, \"0\"); //January is 0!\n    var yyyy = today.getFullYear();\n    \n    today = mm + \"/\" + dd + \"/\" + yyyy;\n    document.write(today);"
    },
    {
      "type": "LONG",
      "statement": "How do you compare two date objects",
      "explanation": "You need to use date.getTime() method to compare date values instead of comparison operators (==, !=, ===, and !== operators)\n\n    var d1 = new Date();\n    var d2 = new Date(d1);\n    console.log(d1.getTime() === d2.getTime()); //True\n    console.log(d1 === d2); // False"
    },
    {
      "type": "LONG",
      "statement": "How do you check if a string starts with another string",
      "explanation": "You can use ECMAScript 6's `String.prototype.startsWith()` method to check if a string starts with another string or not. But it is not yet supported in all browsers. Let's see an example to see this usage,\n\n    \"Good morning\".startsWith(\"Good\"); // true\n    \"Good morning\".startsWith(\"morning\"); // false"
    },
    {
      "type": "LONG",
      "statement": "How do you trim a string in javascript",
      "explanation": "JavaScript provided a trim method on string types to trim any whitespaces present at the beginning or ending of the string.\n\n    \"  Hello World   \".trim(); //Hello World\n    \n\nIf your browser(<IE9) doesn't support this method then you can use below polyfill.\n\n    if (!String.prototype.trim) {\n      (function () {\n        // Make sure we trim BOM and NBSP\n        var rtrim = /^[\\s\\uFEFF\\xA0]+|[\\s\\uFEFF\\xA0]+$/g;\n        String.prototype.trim = function () {\n          return this.replace(rtrim, \"\");\n        };\n      })();\n    }"
    },
    {
      "type": "LONG",
      "statement": "How do you add a key value pair in javascript",
      "explanation": "There are two possible solutions to add new properties to an object. Let's take a simple object to explain these solutions.\n\n    var object = {\n      key1: value1,\n      key2: value2,\n    };\n    \n\n1.  **Using dot notation:** This solution is useful when you know the name of the property\n\n    object.key3 = \"value3\";\n    \n\n1.  **Using square bracket notation:** This solution is useful when the name of the property is dynamically determined.\n\n    obj[\"key3\"] = \"value3\";"
    },
    {
      "type": "LONG",
      "statement": "Is the !-- notation represents a special operator",
      "explanation": "No,that's not a special operator. But it is a combination of 2 standard operators one after the other,\n\n1.  A logical not (!)\n2.  A prefix decrement (--)\n\nAt first, the value decremented by one and then tested to see if it is equal to zero or not for determining the truthy/falsy value."
    },
    {
      "type": "LONG",
      "statement": "How do you assign default values to variables",
      "explanation": "You can use the logical or operator `||` in an assignment expression to provide a default value. The syntax looks like as below,\n\n    var a = b || c;\n    \n\nAs per the above expression, variable 'a 'will get the value of 'c' only if 'b' is falsy (if is null, false, undefined, 0, empty string, or NaN), otherwise 'a' will get the value of 'b'."
    },
    {
      "type": "LONG",
      "statement": "How do you define multiline strings",
      "explanation": "You can define multiline string literals using the '' character followed by line terminator.\n\n    var str =\n      \"This is a \\\n    very lengthy \\\n    sentence!\";\n    \n\nBut if you have a space after the '' character, the code will look exactly the same, but it will raise a SyntaxError."
    },
    {
      "type": "LONG",
      "statement": "What is an app shell model",
      "explanation": "An application shell (or app shell) architecture is one way to build a Progressive Web App that reliably and instantly loads on your users' screens, similar to what you see in native applications. It is useful for getting some initial HTML to the screen fast without a network."
    },
    {
      "type": "LONG",
      "statement": "Can we define properties for functions",
      "explanation": "Yes, We can define properties for functions because functions are also objects.\n\n    fn = function (x) {\n      //Function code goes here\n    };\n    \n    fn.name = \"John\";\n    \n    fn.profile = function (y) {\n      //Profile code goes here\n    };"
    },
    {
      "type": "LONG",
      "statement": "What is the way to find the number of parameters expected by a function",
      "explanation": "You can use `function.length` syntax to find the number of parameters expected by a function. Let's take an example of `sum` function to calculate the sum of numbers,\n\n    function sum(num1, num2, num3, num4) {\n      return num1 + num2 + num3 + num4;\n    }\n    sum.length; // 4 is the number of parameters expected."
    },
    {
      "type": "LONG",
      "statement": "What is a polyfill",
      "explanation": "A polyfill is a piece of JS code used to provide modern functionality on older browsers that do not natively support it. For example, Silverlight plugin polyfill can be used to mimic the functionality of an HTML Canvas element on Microsoft Internet Explorer 7."
    },
    {
      "type": "LONG",
      "statement": "What are break and continue statements",
      "explanation": "The break statement is used to \"jump out\" of a loop. i.e, It breaks the loop and continues executing the code after the loop.\n\n    for (i = 0; i < 10; i++) {\n      if (i === 5) {\n        break;\n      }\n      text += \"Number: \" + i + \"<br>\";\n    }\n    \n\nThe continue statement is used to \"jump over\" one iteration in the loop. i.e, It breaks one iteration (in the loop), if a specified condition occurs, and continues with the next iteration in the loop.\n\n    for (i = 0; i < 10; i++) {\n      if (i === 5) {\n        continue;\n      }\n      text += \"Number: \" + i + \"<br>\";\n    }"
    },
    {
      "type": "LONG",
      "statement": "What are js labels",
      "explanation": "The label statement allows us to name loops and blocks in JavaScript. We can then use these labels to refer back to the code later. For example, the below code with labels avoids printing the numbers when they are same,\n\n    var i, j;\n    \n    loop1: for (i = 0; i < 3; i++) {\n      loop2: for (j = 0; j < 3; j++) {\n        if (i === j) {\n          continue loop1;\n        }\n        console.log(\"i = \" + i + \", j = \" + j);\n      }\n    }\n    \n    // Output is:\n    //   \"i = 1, j = 0\"\n    //   \"i = 2, j = 0\"\n    //   \"i = 2, j = 1\""
    },
    {
      "type": "LONG",
      "statement": "What are the benefits of keeping declarations at the top",
      "explanation": "It is recommended to keep all declarations at the top of each script or function. The benefits of doing this are,\n\n1.  Gives cleaner code\n2.  It provides a single place to look for local variables\n3.  Easy to avoid unwanted global variables\n4.  It reduces the possibility of unwanted re-declarations"
    },
    {
      "type": "LONG",
      "statement": "What are the benefits of initializing variables",
      "explanation": "It is recommended to initialize variables because of the below benefits,\n\n1.  It gives cleaner code\n2.  It provides a single place to initialize variables\n3.  Avoid undefined values in the code"
    },
    {
      "type": "LONG",
      "statement": "What are the recommendations to create new object",
      "explanation": "It is recommended to avoid creating new objects using `new Object()`. Instead you can initialize values based on it's type to create the objects.\n\n1.  Assign {} instead of new Object()\n2.  Assign \"\" instead of new String()\n3.  Assign 0 instead of new Number()\n4.  Assign false instead of new Boolean()\n5.  Assign \\[\\] instead of new Array()\n6.  Assign /()/ instead of new RegExp()\n7.  Assign function (){} instead of new Function()\n\nYou can define them as an example,\n\n    var v1 = {};\n    var v2 = \"\";\n    var v3 = 0;\n    var v4 = false;\n    var v5 = [];\n    var v6 = /()/;\n    var v7 = function () {};"
    },
    {
      "type": "LONG",
      "statement": "How do you define JSON arrays",
      "explanation": "JSON arrays are written inside square brackets and arrays contain javascript objects. For example, the JSON array of users would be as below,\n\n    \"users\":[\n      {\"firstName\":\"John\", \"lastName\":\"Abrahm\"},\n      {\"firstName\":\"Anna\", \"lastName\":\"Smith\"},\n      {\"firstName\":\"Shane\", \"lastName\":\"Warn\"}\n    ]"
    },
    {
      "type": "LONG",
      "statement": "How do you generate random integers",
      "explanation": "You can use Math.random() with Math.floor() to return random integers. For example, if you want generate random integers between 1 to 10, the multiplication factor should be 10,\n\n    Math.floor(Math.random() * 10) + 1; // returns a random integer from 1 to 10\n    Math.floor(Math.random() * 100) + 1; // returns a random integer from 1 to 100\n    \n\n**Note:** Math.random() returns a random number between 0 (inclusive), and 1 (exclusive)"
    },
    {
      "type": "LONG",
      "statement": "Can you write a random integers function to print integers with in a range",
      "explanation": "Yes, you can create a proper random function to return a random number between min and max (both included)\n\n    function randomInteger(min, max) {\n      return Math.floor(Math.random() * (max - min + 1)) + min;\n    }\n    randomInteger(1, 100); // returns a random integer from 1 to 100\n    randomInteger(1, 1000); // returns a random integer from 1 to 1000"
    },
    {
      "type": "LONG",
      "statement": "What is tree shaking",
      "explanation": "Tree shaking is a form of dead code elimination. It means that unused modules will not be included in the bundle during the build process and for that it relies on the static structure of ES2015 module syntax,( i.e. import and export). Initially this has been popularized by the ES2015 module bundler `rollup`."
    },
    {
      "type": "LONG",
      "statement": "What is the need of tree shaking",
      "explanation": "Tree Shaking can significantly reduce the code size in any application. i.e, The less code we send over the wire the more performant the application will be. For example, if we just want to create a “Hello World” Application using SPA frameworks then it will take around a few MBs, but by tree shaking it can bring down the size to just a few hundred KBs. Tree shaking is implemented in Rollup and Webpack bundlers."
    },
    {
      "type": "LONG",
      "statement": "Is it recommended to use eval",
      "explanation": "No, it allows arbitrary code to be run which causes a security problem. As we know that the eval() function is used to run text as code. In most of the cases, it should not be necessary to use it."
    },
    {
      "type": "LONG",
      "statement": "What is a Regular Expression",
      "explanation": "A regular expression is a sequence of characters that forms a search pattern. You can use this search pattern for searching data in a text. These can be used to perform all types of text search and text replace operations. Let's see the syntax format now,\n\n    /pattern/defiimors;\n    \n\nFor example, the regular expression or search pattern with case-insensitive username would be,\n\n    /John/i;"
    },
    {
      "type": "LONG",
      "statement": "What are the string methods available in Regular expression",
      "explanation": "Regular Expressions has two string methods: search() and replace(). The search() method uses an expression to search for a match, and returns the position of the match.\n\n    var msg = \"Hello John\";\n    var n = msg.search(/John/i); // 6\n    \n\nThe replace() method is used to return a modified string where the pattern is replaced.\n\n    var msg = \"Hello John\";\n    var n = msg.replace(/John/i, \"Buttler\"); // Hello Buttler"
    },
    {
      "type": "LONG",
      "statement": "What are modifiers in regular expression",
      "explanation": "Modifiers can be used to perform case-insensitive and global searches. Let's list down some of the modifiers,\n\n| Modifier | Description | | -------- | ------------------------------------------------------- | | i | Perform case-insensitive matching | | g | Perform a global match rather than stops at first match | | m | Perform multiline matching |\n\nLet's take an example of global modifier,\n\n    var text = \"Learn JS one by one\";\n    var pattern = /one/g;\n    var result = text.match(pattern); // one,one"
    },
    {
      "type": "LONG",
      "statement": "What are regular expression patterns",
      "explanation": "Regular Expressions provide a group of patterns in order to match characters. Basically they are categorized into 3 types,\n\n1.  **Brackets:** These are used to find a range of characters. For example, below are some use cases,\n    1.  \\[abc\\]: Used to find any of the characters between the brackets(a,b,c)\n    2.  \\[0-9\\]: Used to find any of the digits between the brackets\n    3.  (a|b): Used to find any of the alternatives separated with |\n2.  **Metacharacters:** These are characters with a special meaning For example, below are some use cases,\n    1.  \\\\d: Used to find a digit\n    2.  \\\\s: Used to find a whitespace character\n    3.  \\\\b: Used to find a match at the beginning or ending of a word\n3.  **Quantifiers:** These are useful to define quantities For example, below are some use cases,\n    1.  n+: Used to find matches for any string that contains at least one n\n    2.  n\\*: Used to find matches for any string that contains zero or more occurrences of n\n    3.  n?: Used to find matches for any string that contains zero or one occurrences of n"
    },
    {
      "type": "LONG",
      "statement": "What is a RegExp object",
      "explanation": "RegExp object is a regular expression object with predefined properties and methods. Let's see the simple usage of RegExp object,\n\n    var regexp = new RegExp(\"\\\\w+\");\n    console.log(regexp);\n    // expected output: /\\w+/"
    },
    {
      "type": "LONG",
      "statement": "How do you search a string for a pattern",
      "explanation": "You can use the test() method of regular expression in order to search a string for a pattern, and return true or false depending on the result.\n\n    var pattern = /you/;\n    console.log(pattern.test(\"How are you?\")); //true"
    },
    {
      "type": "LONG",
      "statement": "What is the purpose of exec method",
      "explanation": "The purpose of exec method is similar to test method but it executes a search for a match in a specified string and returns a result array, or null instead of returning true/false.\n\n    var pattern = /you/;\n    console.log(pattern.exec(\"How are you?\")); //[\"you\", index: 8, input: \"How are you?\", groups: undefined]"
    },
    {
      "type": "LONG",
      "statement": "How do you change the style of a HTML element",
      "explanation": "You can change inline style or classname of a HTML element using javascript\n\n1.  **Using style property:** You can modify inline style using style property\n\n    document.getElementById(\"title\").style.fontSize = \"30px\";\n    \n\n1.  **Using ClassName property:** It is easy to modify element class using className property\n\n    document.getElementById(\"title\").style.className = \"custom-title\";"
    },
    {
      "type": "LONG",
      "statement": "What would be the result of 1+2+'3'",
      "explanation": "The output is going to be `33`. Since `1` and `2` are numeric values, the result of the first two digits is going to be a numeric value `3`. The next digit is a string type value because of that the addition of numeric value `3` and string type value `3` is just going to be a concatenation value `33`."
    },
    {
      "type": "LONG",
      "statement": "What is a debugger statement",
      "explanation": "The debugger statement invokes any available debugging functionality, such as setting a breakpoint. If no debugging functionality is available, this statement has no effect. For example, in the below function a debugger statement has been inserted. So execution is paused at the debugger statement just like a breakpoint in the script source.\n\n    function getProfile() {\n      // code goes here\n      debugger;\n      // code goes here\n    }"
    },
    {
      "type": "LONG",
      "statement": "What is the purpose of breakpoints in debugging",
      "explanation": "You can set breakpoints in the javascript code once the debugger statement is executed and the debugger window pops up. At each breakpoint, javascript will stop executing, and let you examine the JavaScript values. After examining values, you can resume the execution of code using the play button."
    },
    {
      "type": "LONG",
      "statement": "Can I use reserved words as identifiers",
      "explanation": "No, you cannot use the reserved words as variables, labels, object or function names. Let's see one simple example,\n\n    var else = \"hello\"; // Uncaught SyntaxError: Unexpected token else"
    },
    {
      "type": "LONG",
      "statement": "How do you detect a mobile browser",
      "explanation": "You can use regex which returns a true or false value depending on whether or not the user is browsing with a mobile.\n\n    window.mobilecheck = function () {\n      var mobileCheck = false;\n      (function (a) {\n        if (\n          /(android|bb\\d+|meego).+mobile|avantgo|bada\\/|blackberry|blazer|compal|elaine|fennec|hiptop|iemobile|ip(hone|od)|iris|kindle|lge |maemo|midp|mmp|mobile.+firefox|netfront|opera m(ob|in)i|palm( os)?|phone|p(ixi|re)\\/|plucker|pocket|psp|series(4|6)0|symbian|treo|up\\.(browser|link)|vodafone|wap|windows ce|xda|xiino/i.test(\n            a\n          ) ||\n          /1207|6310|6590|3gso|4thp|50[1-6]i|770s|802s|a wa|abac|ac(er|oo|s\\-)|ai(ko|rn)|al(av|ca|co)|amoi|an(ex|ny|yw)|aptu|ar(ch|go)|as(te|us)|attw|au(di|\\-m|r |s )|avan|be(ck|ll|nq)|bi(lb|rd)|bl(ac|az)|br(e|v)w|bumb|bw\\-(n|u)|c55\\/|capi|ccwa|cdm\\-|cell|chtm|cldc|cmd\\-|co(mp|nd)|craw|da(it|ll|ng)|dbte|dc\\-s|devi|dica|dmob|do(c|p)o|ds(12|\\-d)|el(49|ai)|em(l2|ul)|er(ic|k0)|esl8|ez([4-7]0|os|wa|ze)|fetc|fly(\\-|_)|g1 u|g560|gene|gf\\-5|g\\-mo|go(\\.w|od)|gr(ad|un)|haie|hcit|hd\\-(m|p|t)|hei\\-|hi(pt|ta)|hp( i|ip)|hs\\-c|ht(c(\\-| |_|a|g|p|s|t)|tp)|hu(aw|tc)|i\\-(20|go|ma)|i230|iac( |\\-|\\/)|ibro|idea|ig01|ikom|im1k|inno|ipaq|iris|ja(t|v)a|jbro|jemu|jigs|kddi|keji|kgt( |\\/)|klon|kpt |kwc\\-|kyo(c|k)|le(no|xi)|lg( g|\\/(k|l|u)|50|54|\\-[a-w])|libw|lynx|m1\\-w|m3ga|m50\\/|ma(te|ui|xo)|mc(01|21|ca)|m\\-cr|me(rc|ri)|mi(o8|oa|ts)|mmef|mo(01|02|bi|de|do|t(\\-| |o|v)|zz)|mt(50|p1|v )|mwbp|mywa|n10[0-2]|n20[2-3]|n30(0|2)|n50(0|2|5)|n7(0(0|1)|10)|ne((c|m)\\-|on|tf|wf|wg|wt)|nok(6|i)|nzph|o2im|op(ti|wv)|oran|owg1|p800|pan(a|d|t)|pdxg|pg(13|\\-([1-8]|c))|phil|pire|pl(ay|uc)|pn\\-2|po(ck|rt|se)|prox|psio|pt\\-g|qa\\-a|qc(07|12|21|32|60|\\-[2-7]|i\\-)|qtek|r380|r600|raks|rim9|ro(ve|zo)|s55\\/|sa(ge|ma|mm|ms|ny|va)|sc(01|h\\-|oo|p\\-)|sdk\\/|se(c(\\-|0|1)|47|mc|nd|ri)|sgh\\-|shar|sie(\\-|m)|sk\\-0|sl(45|id)|sm(al|ar|b3|it|t5)|so(ft|ny)|sp(01|h\\-|v\\-|v )|sy(01|mb)|t2(18|50)|t6(00|10|18)|ta(gt|lk)|tcl\\-|tdg\\-|tel(i|m)|tim\\-|t\\-mo|to(pl|sh)|ts(70|m\\-|m3|m5)|tx\\-9|up(\\.b|g1|si)|utst|v400|v750|veri|vi(rg|te)|vk(40|5[0-3]|\\-v)|vm40|voda|vulc|vx(52|53|60|61|70|80|81|83|85|98)|w3c(\\-| )|webc|whit|wi(g |nc|nw)|wmlb|wonu|x700|yas\\-|your|zeto|zte\\-/i.test(\n            a.substr(0, 4)\n          )\n        )\n          mobileCheck = true;\n      })(navigator.userAgent || navigator.vendor || window.opera);\n      return mobileCheck;\n    };"
    },
    {
      "type": "LONG",
      "statement": "How do you detect a mobile browser without regexp",
      "explanation": "You can detect mobile browsers by simply running through a list of devices and checking if the useragent matches anything. This is an alternative solution for RegExp usage,\n\n    function detectmob() {\n      if (\n        navigator.userAgent.match(/Android/i) ||\n        navigator.userAgent.match(/webOS/i) ||\n        navigator.userAgent.match(/iPhone/i) ||\n        navigator.userAgent.match(/iPad/i) ||\n        navigator.userAgent.match(/iPod/i) ||\n        navigator.userAgent.match(/BlackBerry/i) ||\n        navigator.userAgent.match(/Windows Phone/i)\n      ) {\n        return true;\n      } else {\n        return false;\n      }\n    }"
    },
    {
      "type": "LONG",
      "statement": "How do you get the image width and height using JS",
      "explanation": "You can programmatically get the image and check the dimensions(width and height) using Javascript.\n\n    var img = new Image();\n    img.onload = function () {\n      console.log(this.width + \"x\" + this.height);\n    };\n    img.src = \"http://www.google.com/intl/en_ALL/images/logo.gif\";"
    },
    {
      "type": "LONG",
      "statement": "How do you make synchronous HTTP request",
      "explanation": "Browsers provide an XMLHttpRequest object which can be used to make synchronous HTTP requests from JavaScript\n\n    function httpGet(theUrl) {\n      var xmlHttpReq = new XMLHttpRequest();\n      xmlHttpReq.open(\"GET\", theUrl, false); // false for synchronous request\n      xmlHttpReq.send(null);\n      return xmlHttpReq.responseText;\n    }"
    },
    {
      "type": "LONG",
      "statement": "How do you make asynchronous HTTP request",
      "explanation": "Browsers provide an XMLHttpRequest object which can be used to make asynchronous HTTP requests from JavaScript by passing the 3rd parameter as true.\n\n    function httpGetAsync(theUrl, callback) {\n      var xmlHttpReq = new XMLHttpRequest();\n      xmlHttpReq.onreadystatechange = function () {\n        if (xmlHttpReq.readyState == 4 && xmlHttpReq.status == 200)\n          callback(xmlHttpReq.responseText);\n      };\n      xmlHttp.open(\"GET\", theUrl, true); // true for asynchronous\n      xmlHttp.send(null);\n    }"
    },
    {
      "type": "LONG",
      "statement": "How do you convert date to another timezone in javascript",
      "explanation": "You can use the toLocaleString() method to convert dates in one timezone to another. For example, let's convert current date to British English timezone as below,\n\n    console.log(event.toLocaleString(\"en-GB\", { timeZone: \"UTC\" })); //29/06/2019, 09:56:00"
    },
    {
      "type": "LONG",
      "statement": "What are the properties used to get size of window",
      "explanation": "You can use innerWidth, innerHeight, clientWidth, clientHeight properties of windows, document element and document body objects to find the size of a window. Let's use them combination of these properties to calculate the size of a window or document,\n\n    var width =\n      window.innerWidth ||\n      document.documentElement.clientWidth ||\n      document.body.clientWidth;\n    \n    var height =\n      window.innerHeight ||\n      document.documentElement.clientHeight ||\n      document.body.clientHeight;"
    },
    {
      "type": "LONG",
      "statement": "What is a conditional operator in javascript",
      "explanation": "The conditional (ternary) operator is the only JavaScript operator that takes three operands which acts as a shortcut for if statements.\n\n    var isAuthenticated = false;\n    console.log(\n      isAuthenticated ? \"Hello, welcome\" : \"Sorry, you are not authenticated\"\n    ); //Sorry, you are not authenticated"
    },
    {
      "type": "LONG",
      "statement": "Can you apply chaining on conditional operator",
      "explanation": "Yes, you can apply chaining on conditional operators similar to if … else if … else if … else chain. The syntax is going to be as below,\n\n    function traceValue(someParam) {\n      return condition1\n        ? value1\n        : condition2\n        ? value2\n        : condition3\n        ? value3\n        : value4;\n    }\n    \n    // The above conditional operator is equivalent to:\n    \n    function traceValue(someParam) {\n      if (condition1) {\n        return value1;\n      } else if (condition2) {\n        return value2;\n      } else if (condition3) {\n        return value3;\n      } else {\n        return value4;\n      }\n    }"
    },
    {
      "type": "LONG",
      "statement": "What are the ways to execute javascript after page load",
      "explanation": "You can execute javascript after page load in many different ways,\n\n1.  **window.onload:**\n\n    window.onload = function ...\n    \n\n1.  **document.onload:**\n\n    document.onload = function ...\n    \n\n1.  **body onload:**\n\n    <body onload=\"script();\">"
    },
    {
      "type": "LONG",
      "statement": "What is the difference between proto and prototype",
      "explanation": "The `__proto__` object is the actual object that is used in the lookup chain to resolve methods, etc. Whereas `prototype` is the object that is used to build `__proto__` when you create an object with new\n\n    new Employee().__proto__ === Employee.prototype;\n    new Employee().prototype === undefined;"
    },
    {
      "type": "LONG",
      "statement": "Give an example where do you really need semicolon",
      "explanation": "It is recommended to use semicolons after every statement in JavaScript. For example, in the below case it throws an error \".. is not a function\" at runtime due to missing semicolon.\n\n    // define a function\n    var fn = (function () {\n      //...\n    })(\n      // semicolon missing at this line\n    \n      // then execute some code inside a closure\n      function () {\n        //...\n      }\n    )();\n    \n\nand it will be interpreted as\n\n    var fn = (function () {\n      //...\n    })(function () {\n      //...\n    })();\n    \n\nIn this case, we are passing the second function as an argument to the first function and then trying to call the result of the first function call as a function. Hence, the second function will fail with a \"... is not a function\" error at runtime."
    },
    {
      "type": "LONG",
      "statement": "What is a freeze method",
      "explanation": "The **freeze()** method is used to freeze an object. Freezing an object does not allow adding new properties to an object,prevents from removing and prevents changing the enumerability, configurability, or writability of existing properties. i.e, It returns the passed object and does not create a frozen copy.\n\n    const obj = {\n      prop: 100,\n    };\n    \n    Object.freeze(obj);\n    obj.prop = 200; // Throws an error in strict mode\n    \n    console.log(obj.prop); //100\n    \n\n**Note:** It causes a TypeError if the argument passed is not an object."
    },
    {
      "type": "LONG",
      "statement": "What is the purpose of freeze method",
      "explanation": "Below are the main benefits of using freeze method,\n\n1.  It is used for freezing objects and arrays.\n2.  It is used to make an object immutable."
    },
    {
      "type": "LONG",
      "statement": "Why do I need to use freeze method",
      "explanation": "In the Object-oriented paradigm, an existing API contains certain elements that are not intended to be extended, modified, or re-used outside of their current context. Hence it works as the `final` keyword which is used in various languages."
    },
    {
      "type": "LONG",
      "statement": "How do you detect a browser language preference",
      "explanation": "You can use navigator object to detect a browser language preference as below,\n\n    var language =\n      (navigator.languages && navigator.languages[0]) || // Chrome / Firefox\n      navigator.language || // All browsers\n      navigator.userLanguage; // IE <= 10\n    \n    console.log(language);"
    },
    {
      "type": "LONG",
      "statement": "How to convert string to title case with javascript",
      "explanation": "Title case means that the first letter of each word is capitalized. You can convert a string to title case using the below function,\n\n    function toTitleCase(str) {\n      return str.replace(/\\w\\S*/g, function (txt) {\n        return txt.charAt(0).toUpperCase() + txt.substr(1).toLowerCase();\n      });\n    }\n    toTitleCase(\"good morning john\"); // Good Morning John"
    },
    {
      "type": "LONG",
      "statement": "How do you detect javascript disabled in the page",
      "explanation": "You can use the `<noscript>` tag to detect javascript disabled or not. The code block inside `<noscript>` gets executed when JavaScript is disabled, and is typically used to display alternative content when the page generated in JavaScript.\n\n    <script type=\"javascript\">\n        // JS related code goes here\n    </script>\n    <noscript>\n        <a href=\"next_page.html?noJS=true\">JavaScript is disabled in the page. Please click Next Page</a>\n    </noscript>"
    },
    {
      "type": "LONG",
      "statement": "What are various operators supported by javascript",
      "explanation": "An operator is capable of manipulating(mathematical and logical computations) a certain value or operand. There are various operators supported by JavaScript as below,\n\n1.  **Arithmetic Operators:** Includes + (Addition),– (Subtraction), \\* (Multiplication), / (Division), % (Modulus), + + (Increment) and – – (Decrement)\n2.  **Comparison Operators:** Includes = =(Equal),!= (Not Equal), ===(Equal with type), > (Greater than),> = (Greater than or Equal to),< (Less than),<= (Less than or Equal to)\n3.  **Logical Operators:** Includes &&(Logical AND),||(Logical OR),!(Logical NOT)\n4.  **Assignment Operators:** Includes = (Assignment Operator), += (Add and Assignment Operator), – = (Subtract and Assignment Operator), \\*= (Multiply and Assignment), /= (Divide and Assignment), %= (Modules and Assignment)\n5.  **Ternary Operators:** It includes conditional(: ?) Operator\n6.  **typeof Operator:** It uses to find type of variable. The syntax looks like `typeof variable`"
    },
    {
      "type": "LONG",
      "statement": "What is a rest parameter",
      "explanation": "Rest parameter is an improved way to handle function parameters which allows us to represent an indefinite number of arguments as an array. The syntax would be as below,\n\n    function f(a, b, ...theArgs) {\n      // ...\n    }\n    \n\nFor example, let's take a sum example to calculate on dynamic number of parameters,\n\n    function total(…args){\n    let sum = 0;\n    for(let i of args){\n    sum+=i;\n    }\n    return sum;\n    }\n    console.log(fun(1,2)); //3\n    console.log(fun(1,2,3)); //6\n    console.log(fun(1,2,3,4)); //13\n    console.log(fun(1,2,3,4,5)); //15\n    \n\n**Note:** Rest parameter is added in ES2015 or ES6"
    },
    {
      "type": "LONG",
      "statement": "What happens if you do not use rest parameter as a last argument",
      "explanation": "The rest parameter should be the last argument, as its job is to collect all the remaining arguments into an array. For example, if you define a function like below it doesn’t make any sense and will throw an error.\n\n    function someFunc(a,…b,c){\n    //You code goes here\n    return;\n    }"
    },
    {
      "type": "LONG",
      "statement": "What are the bitwise operators available in javascript",
      "explanation": "Below are the list of bitwise logical operators used in JavaScript\n\n1.  Bitwise AND ( & )\n2.  Bitwise OR ( | )\n3.  Bitwise XOR ( ^ )\n4.  Bitwise NOT ( ~ )\n5.  Left Shift ( << )\n6.  Sign Propagating Right Shift ( >> )\n7.  Zero fill Right Shift ( >>> )"
    },
    {
      "type": "LONG",
      "statement": "What is a spread operator",
      "explanation": "Spread operator allows iterables( arrays / objects / strings ) to be expanded into single arguments/elements. Let's take an example to see this behavior,\n\n    function calculateSum(x, y, z) {\n      return x + y + z;\n    }\n    \n    const numbers = [1, 2, 3];\n    \n    console.log(calculateSum(...numbers)); // 6"
    },
    {
      "type": "LONG",
      "statement": "How do you determine whether object is frozen or not",
      "explanation": "Object.isFrozen() method is used to determine if an object is frozen or not.An object is frozen if all of the below conditions hold true,\n\n1.  If it is not extensible.\n2.  If all of its properties are non-configurable.\n3.  If all its data properties are non-writable. The usage is going to be as follows,\n\n    const object = {\n      property: \"Welcome JS world\",\n    };\n    Object.freeze(object);\n    console.log(Object.isFrozen(object));"
    },
    {
      "type": "LONG",
      "statement": "How do you determine two values same or not using object",
      "explanation": "The Object.is() method determines whether two values are the same value. For example, the usage with different types of values would be,\n\n    Object.is(\"hello\", \"hello\"); // true\n    Object.is(window, window); // true\n    Object.is([], []); // false\n    \n\nTwo values are the same if one of the following holds:\n\n1.  both undefined\n2.  both null\n3.  both true or both false\n4.  both strings of the same length with the same characters in the same order\n5.  both the same object (means both object have same reference)\n6.  both numbers and both +0 both -0 both NaN both non-zero and both not NaN and both have the same value."
    },
    {
      "type": "LONG",
      "statement": "What is the purpose of using object is method",
      "explanation": "Some of the applications of Object's `is` method are follows,\n\n1.  It is used for comparison of two strings.\n2.  It is used for comparison of two numbers.\n3.  It is used for comparing the polarity of two numbers.\n4.  It is used for comparison of two objects."
    },
    {
      "type": "LONG",
      "statement": "How do you copy properties from one object to other",
      "explanation": "You can use the Object.assign() method which is used to copy the values and properties from one or more source objects to a target object. It returns the target object which has properties and values copied from the target object. The syntax would be as below,\n\n    Object.assign(target, ...sources);\n    \n\nLet's take example with one source and one target object,\n\n    const target = { a: 1, b: 2 };\n    const source = { b: 3, c: 4 };\n    \n    const returnedTarget = Object.assign(target, source);\n    \n    console.log(target); // { a: 1, b: 3, c: 4 }\n    \n    console.log(returnedTarget); // { a: 1, b: 3, c: 4 }\n    \n\nAs observed in the above code, there is a common property(`b`) from source to target so it's value has been overwritten."
    },
    {
      "type": "LONG",
      "statement": "What are the applications of assign method",
      "explanation": "Below are the some of main applications of Object.assign() method,\n\n1.  It is used for cloning an object.\n2.  It is used to merge objects with the same properties."
    },
    {
      "type": "LONG",
      "statement": "What is a proxy object",
      "explanation": "The Proxy object is used to define custom behavior for fundamental operations such as property lookup, assignment, enumeration, function invocation, etc. The syntax would be as follows,\n\n    var p = new Proxy(target, handler);\n    \n\nLet's take an example of proxy object,\n\n    var handler = {\n      get: function (obj, prop) {\n        return prop in obj ? obj[prop] : 100;\n      },\n    };\n    \n    var p = new Proxy({}, handler);\n    p.a = 10;\n    p.b = null;\n    \n    console.log(p.a, p.b); // 10, null\n    console.log(\"c\" in p, p.c); // false, 100\n    \n\nIn the above code, it uses `get` handler which define the behavior of the proxy when an operation is performed on it"
    },
    {
      "type": "LONG",
      "statement": "What is the purpose of seal method",
      "explanation": "The **Object.seal()** method is used to seal an object, by preventing new properties from being added to it and marking all existing properties as non-configurable. But values of present properties can still be changed as long as they are writable. Let's see the below example to understand more about seal() method\n\n    const object = {\n      property: \"Welcome JS world\",\n    };\n    Object.seal(object);\n    object.property = \"Welcome to object world\";\n    console.log(Object.isSealed(object)); // true\n    delete object.property; // You cannot delete when sealed\n    console.log(object.property); //Welcome to object world"
    },
    {
      "type": "LONG",
      "statement": "What are the applications of seal method",
      "explanation": "Below are the main applications of Object.seal() method,\n\n1.  It is used for sealing objects and arrays.\n2.  It is used to make an object immutable."
    },
    {
      "type": "LONG",
      "statement": "What are the differences between freeze and seal methods",
      "explanation": "If an object is frozen using the Object.freeze() method then its properties become immutable and no changes can be made in them whereas if an object is sealed using the Object.seal() method then the changes can be made in the existing properties of the object."
    },
    {
      "type": "LONG",
      "statement": "How do you determine if an object is sealed or not",
      "explanation": "The Object.isSealed() method is used to determine if an object is sealed or not. An object is sealed if all of the below conditions hold true\n\n1.  If it is not extensible.\n2.  If all of its properties are non-configurable.\n3.  If it is not removable (but not necessarily non-writable). Let's see it in the action\n\n    const object = {\n      property: \"Hello, Good morning\",\n    };\n    \n    Object.seal(object); // Using seal() method to seal the object\n    \n    console.log(Object.isSealed(object)); // checking whether the object is sealed or not"
    },
    {
      "type": "LONG",
      "statement": "How do you get enumerable key and value pairs",
      "explanation": "The Object.entries() method is used to return an array of a given object's own enumerable string-keyed property \\[key, value\\] pairs, in the same order as that provided by a for...in loop. Let's see the functionality of object.entries() method in an example,\n\n    const object = {\n      a: \"Good morning\",\n      b: 100,\n    };\n    \n    for (let [key, value] of Object.entries(object)) {\n      console.log(`${key}: ${value}`); // a: 'Good morning'\n      // b: 100\n    }\n    \n\n**Note:** The order is not guaranteed as object defined."
    },
    {
      "type": "LONG",
      "statement": "What is the main difference between Object.values and Object.entries method",
      "explanation": "The Object.values() method's behavior is similar to Object.entries() method but it returns an array of values instead \\[key,value\\] pairs.\n\n    const object = {\n      a: \"Good morning\",\n      b: 100,\n    };\n    \n    for (let value of Object.values(object)) {\n      console.log(`${value}`); // 'Good morning'\n      100;\n    }"
    },
    {
      "type": "LONG",
      "statement": "How can you get the list of keys of any object",
      "explanation": "You can use the `Object.keys()` method which is used to return an array of a given object's own property names, in the same order as we get with a normal loop. For example, you can get the keys of a user object,\n\n    const user = {\n      name: \"John\",\n      gender: \"male\",\n      age: 40,\n    };\n    \n    console.log(Object.keys(user)); //['name', 'gender', 'age']"
    },
    {
      "type": "LONG",
      "statement": "How do you create an object with prototype",
      "explanation": "The Object.create() method is used to create a new object with the specified prototype object and properties. i.e, It uses an existing object as the prototype of the newly created object. It returns a new object with the specified prototype object and properties.\n\n    const user = {\n      name: \"John\",\n      printInfo: function () {\n        console.log(`My name is ${this.name}.`);\n      },\n    };\n    \n    const admin = Object.create(user);\n    \n    admin.name = \"Nick\"; // Remember that \"name\" is a property set on \"admin\" but not on \"user\" object\n    \n    admin.printInfo(); // My name is Nick"
    },
    {
      "type": "LONG",
      "statement": "What is a WeakSet",
      "explanation": "WeakSet is used to store a collection of weakly(weak references) held objects. The syntax would be as follows,\n\n    new WeakSet([iterable]);\n    \n\nLet's see the below example to explain it's behavior,\n\n    var ws = new WeakSet();\n    var user = {};\n    ws.add(user);\n    ws.has(user); // true\n    ws.delete(user); // removes user from the set\n    ws.has(user); // false, user has been removed"
    },
    {
      "type": "LONG",
      "statement": "What are the differences between WeakSet and Set",
      "explanation": "The main difference is that references to objects in Set are strong while references to objects in WeakSet are weak. i.e, An object in WeakSet can be garbage collected if there is no other reference to it. Other differences are,\n\n1.  Sets can store any value Whereas WeakSets can store only collections of objects\n2.  WeakSet does not have size property unlike Set\n3.  WeakSet does not have methods such as clear, keys, values, entries, forEach.\n4.  WeakSet is not iterable."
    },
    {
      "type": "LONG",
      "statement": "List down the collection of methods available on WeakSet",
      "explanation": "Below are the list of methods available on WeakSet,\n\n1.  add(value): A new object is appended with the given value to the weakset\n2.  delete(value): Deletes the value from the WeakSet collection.\n3.  has(value): It returns true if the value is present in the WeakSet Collection, otherwise it returns false.\n4.  length(): It returns the length of weakSetObject Let's see the functionality of all the above methods in an example,\n\n    var weakSetObject = new WeakSet();\n    var firstObject = {};\n    var secondObject = {};\n    // add(value)\n    weakSetObject.add(firstObject);\n    weakSetObject.add(secondObject);\n    console.log(weakSetObject.has(firstObject)); //true\n    console.log(weakSetObject.length()); //2\n    weakSetObject.delete(secondObject);"
    },
    {
      "type": "LONG",
      "statement": "What is a WeakMap",
      "explanation": "The WeakMap object is a collection of key/value pairs in which the keys are weakly referenced. In this case, keys must be objects and the values can be arbitrary values. The syntax is looking like as below,\n\n    new WeakMap([iterable]);\n    \n\nLet's see the below example to explain it's behavior,\n\n    var ws = new WeakMap();\n    var user = {};\n    ws.set(user);\n    ws.has(user); // true\n    ws.delete(user); // removes user from the map\n    ws.has(user); // false, user has been removed"
    },
    {
      "type": "LONG",
      "statement": "What are the differences between WeakMap and Map",
      "explanation": "The main difference is that references to key objects in Map are strong while references to key objects in WeakMap are weak. i.e, A key object in WeakMap can be garbage collected if there is no other reference to it. Other differences are,\n\n1.  Maps can store any key type Whereas WeakMaps can store only collections of key objects\n2.  WeakMap does not have size property unlike Map\n3.  WeakMap does not have methods such as clear, keys, values, entries, forEach.\n4.  WeakMap is not iterable."
    },
    {
      "type": "LONG",
      "statement": "List down the collection of methods available on WeakMap",
      "explanation": "Below are the list of methods available on WeakMap,\n\n1.  set(key, value): Sets the value for the key in the WeakMap object. Returns the WeakMap object.\n2.  delete(key): Removes any value associated to the key.\n3.  has(key): Returns a Boolean asserting whether a value has been associated to the key in the WeakMap object or not.\n4.  get(key): Returns the value associated to the key, or undefined if there is none. Let's see the functionality of all the above methods in an example,\n\n    var weakMapObject = new WeakMap();\n    var firstObject = {};\n    var secondObject = {};\n    // set(key, value)\n    weakMapObject.set(firstObject, \"John\");\n    weakMapObject.set(secondObject, 100);\n    console.log(weakMapObject.has(firstObject)); //true\n    console.log(weakMapObject.get(firstObject)); // John\n    weakMapObject.delete(secondObject);"
    },
    {
      "type": "LONG",
      "statement": "What is the purpose of uneval",
      "explanation": "The uneval() is an inbuilt function which is used to create a string representation of the source code of an Object. It is a top-level function and is not associated with any object. Let's see the below example to know more about it's functionality,\n\n    var a = 1;\n    uneval(a); // returns a String containing 1\n    uneval(function user() {}); // returns \"(function user(){})\""
    },
    {
      "type": "LONG",
      "statement": "How do you encode an URL",
      "explanation": "The encodeURI() function is used to encode complete URI which has special characters except (, / ? : @ & = + $ #) characters.\n\n    var uri = \"https://mozilla.org/?x=шеллы\";\n    var encoded = encodeURI(uri);\n    console.log(encoded); // https://mozilla.org/?x=%D1%88%D0%B5%D0%BB%D0%BB%D1%8B"
    },
    {
      "type": "LONG",
      "statement": "How do you decode an URL",
      "explanation": "The decodeURI() function is used to decode a Uniform Resource Identifier (URI) previously created by encodeURI().\n\n    var uri = \"https://mozilla.org/?x=шеллы\";\n    var encoded = encodeURI(uri);\n    console.log(encoded); // https://mozilla.org/?x=%D1%88%D0%B5%D0%BB%D0%BB%D1%8B\n    try {\n      console.log(decodeURI(encoded)); // \"https://mozilla.org/?x=шеллы\"\n    } catch (e) {\n      // catches a malformed URI\n      console.error(e);\n    }"
    },
    {
      "type": "LONG",
      "statement": "How do you print the contents of web page",
      "explanation": "The window object provided a print() method which is used to print the contents of the current window. It opens a Print dialog box which lets you choose between various printing options. Let's see the usage of print method in an example,\n\n    <input type=\"button\" value=\"Print\" onclick=\"window.print()\" />\n    \n\n**Note:** In most browsers, it will block while the print dialog is open."
    },
    {
      "type": "LONG",
      "statement": "What is the difference between uneval and eval",
      "explanation": "The `uneval` function returns the source of a given object; whereas the `eval` function does the opposite, by evaluating that source code in a different memory area. Let's see an example to clarify the difference,\n\n    var msg = uneval(function greeting() {\n      return \"Hello, Good morning\";\n    });\n    var greeting = eval(msg);\n    greeting(); // returns \"Hello, Good morning\""
    },
    {
      "type": "LONG",
      "statement": "What is an anonymous function",
      "explanation": "An anonymous function is a function without a name! Anonymous functions are commonly assigned to a variable name or used as a callback function. The syntax would be as below,\n\n    function (optionalParameters) {\n      //do something\n    }\n    \n    const myFunction = function(){ //Anonymous function assigned to a variable\n      //do something\n    };\n    \n    [1, 2, 3].map(function(element){ //Anonymous function used as a callback function\n      //do something\n    });\n    \n\nLet's see the above anonymous function in an example,\n\n    var x = function (a, b) {\n      return a * b;\n    };\n    var z = x(5, 10);\n    console.log(z); // 50"
    },
    {
      "type": "LONG",
      "statement": "What is the precedence order between local and global variables",
      "explanation": "A local variable takes precedence over a global variable with the same name. Let's see this behavior in an example.\n\n    var msg = \"Good morning\";\n    function greeting() {\n      msg = \"Good Evening\";\n      console.log(msg);\n    }\n    greeting();"
    },
    {
      "type": "LONG",
      "statement": "What are javascript accessors",
      "explanation": "ECMAScript 5 introduced javascript object accessors or computed properties through getters and setters. Getters uses the `get` keyword whereas Setters uses the `set` keyword.\n\n    var user = {\n      firstName: \"John\",\n      lastName : \"Abraham\",\n      language : \"en\",\n      get lang() {\n        return this.language;\n      }\n      set lang(lang) {\n      this.language = lang;\n      }\n    };\n    console.log(user.lang); // getter access lang as en\n    user.lang = 'fr';\n    console.log(user.lang); // setter used to set lang as fr"
    },
    {
      "type": "LONG",
      "statement": "How do you define property on Object constructor",
      "explanation": "The Object.defineProperty() static method is used to define a new property directly on an object, or modify an existing property on an object, and returns the object. Let's see an example to know how to define property,\n\n    const newObject = {};\n    \n    Object.defineProperty(newObject, \"newProperty\", {\n      value: 100,\n      writable: false,\n    });\n    \n    console.log(newObject.newProperty); // 100\n    \n    newObject.newProperty = 200; // It throws an error in strict mode due to writable setting"
    },
    {
      "type": "LONG",
      "statement": "What is the difference between get and defineProperty",
      "explanation": "Both have similar results until unless you use classes. If you use `get` the property will be defined on the prototype of the object whereas using `Object.defineProperty()` the property will be defined on the instance it is applied to."
    },
    {
      "type": "LONG",
      "statement": "What are the advantages of Getters and Setters",
      "explanation": "Below are the list of benefits of Getters and Setters,\n\n1.  They provide simpler syntax\n2.  They are used for defining computed properties, or accessors in JS.\n3.  Useful to provide equivalence relation between properties and methods\n4.  They can provide better data quality\n5.  Useful for doing things behind the scenes with the encapsulated logic."
    },
    {
      "type": "LONG",
      "statement": "Can I add getters and setters using defineProperty method",
      "explanation": "Yes, You can use the `Object.defineProperty()` method to add Getters and Setters. For example, the below counter object uses increment, decrement, add and subtract properties,\n\n    var obj = { counter: 0 };\n    \n    // Define getters\n    Object.defineProperty(obj, \"increment\", {\n      get: function () {\n        this.counter++;\n      },\n    });\n    Object.defineProperty(obj, \"decrement\", {\n      get: function () {\n        this.counter--;\n      },\n    });\n    \n    // Define setters\n    Object.defineProperty(obj, \"add\", {\n      set: function (value) {\n        this.counter += value;\n      },\n    });\n    Object.defineProperty(obj, \"subtract\", {\n      set: function (value) {\n        this.counter -= value;\n      },\n    });\n    \n    obj.add = 10;\n    obj.subtract = 5;\n    console.log(obj.increment); //6\n    console.log(obj.decrement); //5"
    },
    {
      "type": "LONG",
      "statement": "What is the purpose of switch-case",
      "explanation": "The switch case statement in JavaScript is used for decision making purposes. In a few cases, using the switch case statement is going to be more convenient than if-else statements. The syntax would be as below,\n\n    switch (expression)\n    {\n        case value1:\n            statement1;\n            break;\n        case value2:\n            statement2;\n            break;\n        .\n        .\n        case valueN:\n            statementN;\n            break;\n        default:\n            statementDefault;\n    }\n    \n\nThe above multi-way branch statement provides an easy way to dispatch execution to different parts of code based on the value of the expression."
    },
    {
      "type": "LONG",
      "statement": "What are the conventions to be followed for the usage of switch case",
      "explanation": "Below are the list of conventions should be taken care,\n\n1.  The expression can be of type either number or string.\n2.  Duplicate values are not allowed for the expression.\n3.  The default statement is optional. If the expression passed to switch does not match with any case value then the statement within default case will be executed.\n4.  The break statement is used inside the switch to terminate a statement sequence.\n5.  The break statement is optional. But if it is omitted, the execution will continue on into the next case."
    },
    {
      "type": "LONG",
      "statement": "What are primitive data types",
      "explanation": "A primitive data type is data that has a primitive value (which has no properties or methods). There are 5 types of primitive data types.\n\n1.  string\n2.  number\n3.  boolean\n4.  null\n5.  undefined"
    },
    {
      "type": "LONG",
      "statement": "What are the different ways to access object properties",
      "explanation": "There are 3 possible ways for accessing the property of an object.\n\n1.  **Dot notation:** It uses dot for accessing the properties\n\n    objectName.property;\n    \n\n1.  **Square brackets notation:** It uses square brackets for property access\n\n    objectName[\"property\"];\n    \n\n1.  **Expression notation:** It uses expression in the square brackets\n\n    objectName[expression];"
    },
    {
      "type": "LONG",
      "statement": "What are the function parameter rules",
      "explanation": "JavaScript functions follow below rules for parameters,\n\n1.  The function definitions do not specify data types for parameters.\n2.  Do not perform type checking on the passed arguments.\n3.  Do not check the number of arguments received. i.e, The below function follows the above rules,\n\n    function functionName(parameter1, parameter2, parameter3) {\n      console.log(parameter1); // 1\n    }\n    functionName(1);"
    },
    {
      "type": "LONG",
      "statement": "What is an error object",
      "explanation": "An error object is a built in error object that provides error information when an error occurs. It has two properties: name and message. For example, the below function logs error details,\n\n    try {\n      greeting(\"Welcome\");\n    } catch (err) {\n      console.log(err.name + \"<br>\" + err.message);\n    }"
    },
    {
      "type": "LONG",
      "statement": "When you get a syntax error",
      "explanation": "A SyntaxError is thrown if you try to evaluate code with a syntax error. For example, the below missing quote for the function parameter throws a syntax error\n\n    try {\n      eval(\"greeting('welcome)\"); // Missing ' will produce an error\n    } catch (err) {\n      console.log(err.name);\n    }"
    },
    {
      "type": "LONG",
      "statement": "What are the different error names from error object",
      "explanation": "There are 6 different types of error names returned from error object, | Error Name | Description | |---- | --------- | EvalError | An error has occurred in the eval() function | | RangeError | An error has occurred with a number \"out of range\" | | ReferenceError | An error due to an illegal reference| | SyntaxError | An error due to a syntax error| | TypeError | An error due to a type error | | URIError | An error due to encodeURI() |"
    },
    {
      "type": "LONG",
      "statement": "What are the various statements in error handling",
      "explanation": "Below are the list of statements used in an error handling,\n\n1.  **try:** This statement is used to test a block of code for errors\n2.  **catch:** This statement is used to handle the error\n3.  **throw:** This statement is used to create custom errors.\n4.  **finally:** This statement is used to execute code after try and catch regardless of the result."
    },
    {
      "type": "LONG",
      "statement": "What are the two types of loops in javascript",
      "explanation": "1.  **Entry Controlled loops:** In this kind of loop type, the test condition is tested before entering the loop body. For example, For Loop and While Loop comes under this category.\n2.  **Exit Controlled Loops:** In this kind of loop type, the test condition is tested or evaluated at the end of the loop body. i.e, the loop body will execute at least once irrespective of test condition true or false. For example, do-while loop comes under this category."
    },
    {
      "type": "LONG",
      "statement": "What is nodejs",
      "explanation": "Node.js is a server-side platform built on Chrome's JavaScript runtime for easily building fast and scalable network applications. It is an event-based, non-blocking, asynchronous I/O runtime that uses Google's V8 JavaScript engine and libuv library."
    },
    {
      "type": "LONG",
      "statement": "What is an Intl object",
      "explanation": "The Intl object is the namespace for the ECMAScript Internationalization API, which provides language sensitive string comparison, number formatting, and date and time formatting. It provides access to several constructors and language sensitive functions."
    },
    {
      "type": "LONG",
      "statement": "How do you perform language specific date and time formatting",
      "explanation": "You can use the `Intl.DateTimeFormat` object which is a constructor for objects that enable language-sensitive date and time formatting. Let's see this behavior with an example,\n\n    var date = new Date(Date.UTC(2019, 07, 07, 3, 0, 0));\n    console.log(new Intl.DateTimeFormat(\"en-GB\").format(date)); // 07/08/2019\n    console.log(new Intl.DateTimeFormat(\"en-AU\").format(date)); // 07/08/2019"
    },
    {
      "type": "LONG",
      "statement": "What is an Iterator",
      "explanation": "An iterator is an object which defines a sequence and a return value upon its termination. It implements the Iterator protocol with a `next()` method which returns an object with two properties: `value` (the next value in the sequence) and `done` (which is true if the last value in the sequence has been consumed)."
    },
    {
      "type": "LONG",
      "statement": "How does synchronous iteration works",
      "explanation": "Synchronous iteration was introduced in ES6 and it works with below set of components,\n\n**Iterable:** It is an object which can be iterated over via a method whose key is Symbol.iterator. **Iterator:** It is an object returned by invoking `[Symbol.iterator]()` on an iterable. This iterator object wraps each iterated element in an object and returns it via `next()` method one by one. **IteratorResult:** It is an object returned by `next()` method. The object contains two properties; the `value` property contains an iterated element and the `done` property determines whether the element is the last element or not.\n\nLet's demonstrate synchronous iteration with an array as below,\n\n    const iterable = [\"one\", \"two\", \"three\"];\n    const iterator = iterable[Symbol.iterator]();\n    console.log(iterator.next()); // { value: 'one', done: false }\n    console.log(iterator.next()); // { value: 'two', done: false }\n    console.log(iterator.next()); // { value: 'three', done: false }\n    console.log(iterator.next()); // { value: 'undefined, done: true }"
    },
    {
      "type": "LONG",
      "statement": "What is an event loop",
      "explanation": "The Event Loop is a queue of callback functions. When an async function executes, the callback function is pushed into the queue. The JavaScript engine doesn't start processing the event loop until the async function has finished executing the code. **Note:** It allows Node.js to perform non-blocking I/O operations even though JavaScript is single-threaded."
    },
    {
      "type": "LONG",
      "statement": "What is call stack",
      "explanation": "Call Stack is a data structure for javascript interpreters to keep track of function calls in the program. It has two major actions,\n\n1.  Whenever you call a function for its execution, you are pushing it to the stack.\n2.  Whenever the execution is completed, the function is popped out of the stack.\n\nLet's take an example and it's state representation in a diagram format\n\n    function hungry() {\n      eatFruits();\n    }\n    function eatFruits() {\n      return \"I'm eating fruits\";\n    }\n    \n    // Invoke the `hungry` function\n    hungry();\n    \n\nThe above code processed in a call stack as below,\n\n1.  Add the `hungry()` function to the call stack list and execute the code.\n2.  Add the `eatFruits()` function to the call stack list and execute the code.\n3.  Delete the `eatFruits()` function from our call stack list.\n4.  Delete the `hungry()` function from the call stack list since there are no items anymore."
    },
    {
      "type": "LONG",
      "statement": "What is an event queue",
      "explanation": ""
    },
    {
      "type": "LONG",
      "statement": "What is a decorator",
      "explanation": "A decorator is an expression that evaluates to a function and that takes the target, name, and decorator descriptor as arguments. Also, it optionally returns a decorator descriptor to install on the target object. Let's define admin decorator for user class at design time,\n\n    function admin(isAdmin) {\n       return function(target) {\n           target.isAdmin = isAdmin;\n       }\n    }\n    \n    @admin(true)\n    class User() {\n    }\n    console.log(User.isAdmin); //true\n    \n     @admin(false)\n     class User() {\n     }\n     console.log(User.isAdmin); //false"
    },
    {
      "type": "LONG",
      "statement": "What are the properties of Intl object",
      "explanation": "Below are the list of properties available on Intl object,\n\n1.  **Collator:** These are the objects that enable language-sensitive string comparison.\n2.  **DateTimeFormat:** These are the objects that enable language-sensitive date and time formatting.\n3.  **ListFormat:** These are the objects that enable language-sensitive list formatting.\n4.  **NumberFormat:** Objects that enable language-sensitive number formatting.\n5.  **PluralRules:** Objects that enable plural-sensitive formatting and language-specific rules for plurals.\n6.  **RelativeTimeFormat:** Objects that enable language-sensitive relative time formatting."
    },
    {
      "type": "LONG",
      "statement": "What is an Unary operator",
      "explanation": "The unary(+) operator is used to convert a variable to a number.If the variable cannot be converted, it will still become a number but with the value NaN. Let's see this behavior in an action.\n\n    var x = \"100\";\n    var y = +x;\n    console.log(typeof x, typeof y); // string, number\n    \n    var a = \"Hello\";\n    var b = +a;\n    console.log(typeof a, typeof b, b); // string, number, NaN"
    },
    {
      "type": "LONG",
      "statement": "How do you sort elements in an array",
      "explanation": "The sort() method is used to sort the elements of an array in place and returns the sorted array. The example usage would be as below,\n\n    var months = [\"Aug\", \"Sep\", \"Jan\", \"June\"];\n    months.sort();\n    console.log(months); //  [\"Aug\", \"Jan\", \"June\", \"Sep\"]"
    },
    {
      "type": "LONG",
      "statement": "What is the purpose of compareFunction while sorting arrays",
      "explanation": "The compareFunction is used to define the sort order. If omitted, the array elements are converted to strings, then sorted according to each character's Unicode code point value. Let's take an example to see the usage of compareFunction,\n\n    let numbers = [1, 2, 5, 3, 4];\n    numbers.sort((a, b) => b - a);\n    console.log(numbers); // [5, 4, 3, 2, 1]"
    },
    {
      "type": "LONG",
      "statement": "How do you reversing an array",
      "explanation": "You can use the reverse() method to reverse the elements in an array. This method is useful to sort an array in descending order. Let's see the usage of reverse() method in an example,\n\n    let numbers = [1, 2, 5, 3, 4];\n    numbers.sort((a, b) => b - a);\n    numbers.reverse();\n    console.log(numbers); // [1, 2, 3, 4 ,5]"
    },
    {
      "type": "LONG",
      "statement": "How do you find min and max value in an array",
      "explanation": "You can use `Math.min` and `Math.max` methods on array variables to find the minimum and maximum elements within an array. Let's create two functions to find the min and max value with in an array,\n\n    var marks = [50, 20, 70, 60, 45, 30];\n    function findMin(arr) {\n      return Math.min.apply(null, arr);\n    }\n    function findMax(arr) {\n      return Math.max.apply(null, arr);\n    }\n    \n    console.log(findMin(marks));\n    console.log(findMax(marks));"
    },
    {
      "type": "LONG",
      "statement": "How do you find min and max values without Math functions",
      "explanation": "You can write functions which loop through an array comparing each value with the lowest value or highest value to find the min and max values. Let's create those functions to find min and max values,\n\n    var marks = [50, 20, 70, 60, 45, 30];\n    function findMin(arr) {\n      var length = arr.length;\n      var min = Infinity;\n      while (length--) {\n        if (arr[length] < min) {\n          min = arr[len];\n        }\n      }\n      return min;\n    }\n    \n    function findMax(arr) {\n      var length = arr.length;\n      var max = -Infinity;\n      while (len--) {\n        if (arr[length] > max) {\n          max = arr[length];\n        }\n      }\n      return max;\n    }\n    \n    console.log(findMin(marks));\n    console.log(findMax(marks));"
    },
    {
      "type": "LONG",
      "statement": "What is an empty statement and purpose of it",
      "explanation": "The empty statement is a semicolon (;) indicating that no statement will be executed, even if JavaScript syntax requires one. Since there is no action with an empty statement you might think that it's usage is quite less, but the empty statement is occasionally useful when you want to create a loop that has an empty body. For example, you can initialize an array with zero values as below,\n\n    // Initialize an array a\n    for(int i=0; i < a.length; a[i++] = 0) ;"
    },
    {
      "type": "LONG",
      "statement": "How do you get metadata of a module",
      "explanation": "You can use the `import.meta` object which is a meta-property exposing context-specific meta data to a JavaScript module. It contains information about the current module, such as the module's URL. In browsers, you might get different meta data than NodeJS.\n\n    <script type=\"module\" src=\"welcome-module.js\"></script>;\n    console.log(import.meta); // { url: \"file:///home/user/welcome-module.js\" }"
    },
    {
      "type": "LONG",
      "statement": "What is a comma operator",
      "explanation": "The comma operator is used to evaluate each of its operands from left to right and returns the value of the last operand. This is totally different from comma usage within arrays, objects, and function arguments and parameters. For example, the usage for numeric expressions would be as below,\n\n    var x = 1;\n    x = (x++, x);\n    \n    console.log(x); // 2"
    },
    {
      "type": "LONG",
      "statement": "What is the advantage of a comma operator",
      "explanation": "It is normally used to include multiple expressions in a location that requires a single expression. One of the common usages of this comma operator is to supply multiple parameters in a `for` loop. For example, the below for loop uses multiple expressions in a single location using comma operator,\n\n    for (var a = 0, b =10; a <= 10; a++, b--)\n    \n\nYou can also use the comma operator in a return statement where it processes before returning.\n\n    function myFunction() {\n      var a = 1;\n      return (a += 10), a; // 11\n    }"
    },
    {
      "type": "LONG",
      "statement": "What is typescript",
      "explanation": "TypeScript is a typed superset of JavaScript created by Microsoft that adds optional types, classes, async/await, and many other features, and compiles to plain JavaScript. Angular built entirely in TypeScript and used as a primary language. You can install it globally as\n\n    npm install -g typescript\n    \n\nLet's see a simple example of TypeScript usage,\n\n    function greeting(name: string): string {\n      return \"Hello, \" + name;\n    }\n    \n    let user = \"Sudheer\";\n    \n    console.log(greeting(user));\n    \n\nThe greeting method allows only string type as argument."
    },
    {
      "type": "LONG",
      "statement": "What are the differences between javascript and typescript",
      "explanation": "Below are the list of differences between javascript and typescript,\n\n| feature | typescript | javascript | | ------------------- | ------------------------------------- | ----------------------------------------------- | | Language paradigm | Object oriented programming language | Scripting language | | Typing support | Supports static typing | It has dynamic typing | | Modules | Supported | Not supported | | Interface | It has interfaces concept | Doesn't support interfaces | | Optional parameters | Functions support optional parameters | No support of optional parameters for functions |"
    },
    {
      "type": "LONG",
      "statement": "What are the advantages of typescript over javascript",
      "explanation": "Below are some of the advantages of typescript over javascript,\n\n1.  TypeScript is able to find compile time errors at the development time only and it makes sures less runtime errors. Whereas javascript is an interpreted language.\n2.  TypeScript is strongly-typed or supports static typing which allows for checking type correctness at compile time. This is not available in javascript.\n3.  TypeScript compiler can compile the .ts files into ES3,ES4 and ES5 unlike ES6 features of javascript which may not be supported in some browsers."
    },
    {
      "type": "LONG",
      "statement": "What is an object initializer",
      "explanation": "An object initializer is an expression that describes the initialization of an Object. The syntax for this expression is represented as a comma-delimited list of zero or more pairs of property names and associated values of an object, enclosed in curly braces ({}). This is also known as literal notation. It is one of the ways to create an object.\n\n    var initObject = { a: \"John\", b: 50, c: {} };\n    \n    console.log(initObject.a); // John"
    },
    {
      "type": "LONG",
      "statement": "What is a constructor method",
      "explanation": "The constructor method is a special method for creating and initializing an object created within a class. If you do not specify a constructor method, a default constructor is used. The example usage of constructor would be as below,\n\n    class Employee {\n      constructor() {\n        this.name = \"John\";\n      }\n    }\n    \n    var employeeObject = new Employee();\n    \n    console.log(employeeObject.name); // John"
    },
    {
      "type": "LONG",
      "statement": "What happens if you write constructor more than once in a class",
      "explanation": "The \"constructor\" in a class is a special method and it should be defined only once in a class. i.e, If you write a constructor method more than once in a class it will throw a `SyntaxError` error.\n\n    class Employee {\n      constructor() {\n        this.name = \"John\";\n      }\n      constructor() {\n        //  Uncaught SyntaxError: A class may only have one constructor\n        this.age = 30;\n      }\n    }\n    \n    var employeeObject = new Employee();\n    \n    console.log(employeeObject.name);"
    },
    {
      "type": "LONG",
      "statement": "How do you call the constructor of a parent class",
      "explanation": "You can use the `super` keyword to call the constructor of a parent class. Remember that `super()` must be called before using 'this' reference. Otherwise it will cause a reference error. Let's the usage of it,\n\n    class Square extends Rectangle {\n      constructor(length) {\n        super(length, length);\n        this.name = \"Square\";\n      }\n    \n      get area() {\n        return this.width * this.height;\n      }\n    \n      set area(value) {\n        this.area = value;\n      }\n    }"
    },
    {
      "type": "LONG",
      "statement": "How do you get the prototype of an object",
      "explanation": "You can use the `Object.getPrototypeOf(obj)` method to return the prototype of the specified object. i.e. The value of the internal `prototype` property. If there are no inherited properties then `null` value is returned.\n\n    const newPrototype = {};\n    const newObject = Object.create(newPrototype);\n    \n    console.log(Object.getPrototypeOf(newObject) === newPrototype); // true"
    },
    {
      "type": "LONG",
      "statement": "What happens If I pass string type for getPrototype method",
      "explanation": "In ES5, it will throw a TypeError exception if the obj parameter isn't an object. Whereas in ES2015, the parameter will be coerced to an `Object`.\n\n    // ES5\n    Object.getPrototypeOf(\"James\"); // TypeError: \"James\" is not an object\n    // ES2015\n    Object.getPrototypeOf(\"James\"); // String.prototype"
    },
    {
      "type": "LONG",
      "statement": "How do you set prototype of one object to another",
      "explanation": "You can use the `Object.setPrototypeOf()` method that sets the prototype (i.e., the internal `Prototype` property) of a specified object to another object or null. For example, if you want to set prototype of a square object to rectangle object would be as follows,\n\n    Object.setPrototypeOf(Square.prototype, Rectangle.prototype);\n    Object.setPrototypeOf({}, null);"
    },
    {
      "type": "LONG",
      "statement": "How do you check whether an object can be extendable or not",
      "explanation": "The `Object.isExtensible()` method is used to determine if an object is extendable or not. i.e, Whether it can have new properties added to it or not.\n\n    const newObject = {};\n    console.log(Object.isExtensible(newObject)); //true\n    \n\n**Note:** By default, all the objects are extendable. i.e, The new properties can be added or modified."
    },
    {
      "type": "LONG",
      "statement": "How do you prevent an object to extend",
      "explanation": "The `Object.preventExtensions()` method is used to prevent new properties from ever being added to an object. In other words, it prevents future extensions to the object. Let's see the usage of this property,\n\n    const newObject = {};\n    Object.preventExtensions(newObject); // NOT extendable\n    \n    try {\n      Object.defineProperty(newObject, \"newProperty\", {\n        // Adding new property\n        value: 100,\n      });\n    } catch (e) {\n      console.log(e); // TypeError: Cannot define property newProperty, object is not extensible\n    }"
    },
    {
      "type": "LONG",
      "statement": "What are the different ways to make an object non-extensible",
      "explanation": "You can mark an object non-extensible in 3 ways,\n\n1.  Object.preventExtensions\n2.  Object.seal\n3.  Object.freeze\n\n    var newObject = {};\n    \n    Object.preventExtensions(newObject); // Prevent objects are non-extensible\n    Object.isExtensible(newObject); // false\n    \n    var sealedObject = Object.seal({}); // Sealed objects are non-extensible\n    Object.isExtensible(sealedObject); // false\n    \n    var frozenObject = Object.freeze({}); // Frozen objects are non-extensible\n    Object.isExtensible(frozenObject); // false"
    },
    {
      "type": "LONG",
      "statement": "How do you define multiple properties on an object",
      "explanation": "The `Object.defineProperties()` method is used to define new or modify existing properties directly on an object and returning the object. Let's define multiple properties on an empty object,\n\n    const newObject = {};\n    \n    Object.defineProperties(newObject, {\n      newProperty1: {\n        value: \"John\",\n        writable: true,\n      },\n      newProperty2: {},\n    });"
    },
    {
      "type": "LONG",
      "statement": "What is MEAN in javascript",
      "explanation": "The MEAN (MongoDB, Express, AngularJS, and Node.js) stack is the most popular open-source JavaScript software tech stack available for building dynamic web apps where you can write both the server-side and client-side halves of the web project entirely in JavaScript."
    },
    {
      "type": "LONG",
      "statement": "What Is Obfuscation in javascript",
      "explanation": "Obfuscation is the deliberate act of creating obfuscated javascript code(i.e, source or machine code) that is difficult for humans to understand. It is something similar to encryption, but a machine can understand the code and execute it. Let's see the below function before Obfuscation,\n\n    function greeting() {\n      console.log(\"Hello, welcome to JS world\");\n    }\n    \n\nAnd after the code Obfuscation, it would be appeared as below,\n\n    eval(\n      (function (p, a, c, k, e, d) {\n        e = function (c) {\n          return c;\n        };\n        if (!\"\".replace(/^/, String)) {\n          while (c--) {\n            d[c] = k[c] || c;\n          }\n          k = [\n            function (e) {\n              return d[e];\n            },\n          ];\n          e = function () {\n            return \"\\\\w+\";\n          };\n          c = 1;\n        }\n        while (c--) {\n          if (k[c]) {\n            p = p.replace(new RegExp(\"\\\\b\" + e(c) + \"\\\\b\", \"g\"), k[c]);\n          }\n        }\n        return p;\n      })(\n        \"2 1(){0.3('4, 7 6 5 8')}\",\n        9,\n        9,\n        \"console|greeting|function|log|Hello|JS|to|welcome|world\".split(\"|\"),\n        0,\n        {}\n      )\n    );"
    },
    {
      "type": "LONG",
      "statement": "Why do you need Obfuscation",
      "explanation": "Below are the few reasons for Obfuscation,\n\n1.  The Code size will be reduced. So data transfers between server and client will be fast.\n2.  It hides the business logic from outside world and protects the code from others\n3.  Reverse engineering is highly difficult\n4.  The download time will be reduced"
    },
    {
      "type": "LONG",
      "statement": "What is Minification",
      "explanation": "Minification is the process of removing all unnecessary characters(empty spaces are removed) and variables will be renamed without changing it's functionality. It is also a type of obfuscation ."
    },
    {
      "type": "LONG",
      "statement": "What are the advantages of minification",
      "explanation": "Normally it is recommended to use minification for heavy traffic and intensive requirements of resources. It reduces file sizes with below benefits,\n\n1.  Decreases loading times of a web page\n2.  Saves bandwidth usages"
    },
    {
      "type": "LONG",
      "statement": "What are the differences between Obfuscation and Encryption",
      "explanation": "Below are the main differences between Obfuscation and Encryption,\n\n| Feature | Obfuscation | Encryption | | ------------------ | ----------------------------------------------- | ----------------------------------------------------------------------- | | Definition | Changing the form of any data in any other form | Changing the form of information to an unreadable format by using a key | | A key to decode | It can be decoded without any key | It is required | | Target data format | It will be converted to a complex form | Converted into an unreadable format |"
    },
    {
      "type": "LONG",
      "statement": "What are the common tools used for minification",
      "explanation": "There are many online/offline tools to minify the javascript files,\n\n1.  Google's Closure Compiler\n2.  UglifyJS2\n3.  jsmin\n4.  javascript-minifier.com/\n5.  prettydiff.com"
    },
    {
      "type": "LONG",
      "statement": "How do you perform form validation using javascript",
      "explanation": "JavaScript can be used to perform HTML form validation. For example, if the form field is empty, the function needs to notify, and return false, to prevent the form being submitted. Lets' perform user login in an html form,\n\n    <form name=\"myForm\" onsubmit=\"return validateForm()\" method=\"post\">\n      User name: <input type=\"text\" name=\"uname\" />\n      <input type=\"submit\" value=\"Submit\" />\n    </form>\n    \n\nAnd the validation on user login is below,\n\n    function validateForm() {\n      var x = document.forms[\"myForm\"][\"uname\"].value;\n      if (x == \"\") {\n        alert(\"The username shouldn't be empty\");\n        return false;\n      }\n    }"
    },
    {
      "type": "LONG",
      "statement": "How do you perform form validation without javascript",
      "explanation": "You can perform HTML form validation automatically without using javascript. The validation enabled by applying the `required` attribute to prevent form submission when the input is empty.\n\n    <form method=\"post\">\n      <input type=\"text\" name=\"uname\" required />\n      <input type=\"submit\" value=\"Submit\" />\n    </form>\n    \n\n**Note:** Automatic form validation does not work in Internet Explorer 9 or earlier."
    },
    {
      "type": "LONG",
      "statement": "What are the DOM methods available for constraint validation",
      "explanation": "The below DOM methods are available for constraint validation on an invalid input,\n\n1.  checkValidity(): It returns true if an input element contains valid data.\n2.  setCustomValidity(): It is used to set the validationMessage property of an input element. Let's take an user login form with DOM validations\n\n    function myFunction() {\n      var userName = document.getElementById(\"uname\");\n      if (!userName.checkValidity()) {\n        document.getElementById(\"message\").innerHTML =\n          userName.validationMessage;\n      } else {\n        document.getElementById(\"message\").innerHTML =\n          \"Entered a valid username\";\n      }\n    }"
    },
    {
      "type": "LONG",
      "statement": "What are the available constraint validation DOM properties",
      "explanation": "Below are the list of some of the constraint validation DOM properties available,\n\n1.  validity: It provides a list of boolean properties related to the validity of an input element.\n2.  validationMessage: It displays the message when the validity is false.\n3.  willValidate: It indicates if an input element will be validated or not."
    },
    {
      "type": "LONG",
      "statement": "What are the list of validity properties",
      "explanation": "The validity property of an input element provides a set of properties related to the validity of data.\n\n1.  customError: It returns true, if a custom validity message is set.\n2.  patternMismatch: It returns true, if an element's value does not match its pattern attribute.\n3.  rangeOverflow: It returns true, if an element's value is greater than its max attribute.\n4.  rangeUnderflow: It returns true, if an element's value is less than its min attribute.\n5.  stepMismatch: It returns true, if an element's value is invalid according to step attribute.\n6.  tooLong: It returns true, if an element's value exceeds its maxLength attribute.\n7.  typeMismatch: It returns true, if an element's value is invalid according to type attribute.\n8.  valueMissing: It returns true, if an element with a required attribute has no value.\n9.  valid: It returns true, if an element's value is valid."
    },
    {
      "type": "LONG",
      "statement": "Give an example usage of rangeOverflow property",
      "explanation": "If an element's value is greater than its max attribute then rangeOverflow property returns true. For example, the below form submission throws an error if the value is more than 100,\n\n    <input id=\"age\" type=\"number\" max=\"100\" />\n    <button onclick=\"myOverflowFunction()\">OK</button>\n    \n\n    function myOverflowFunction() {\n      if (document.getElementById(\"age\").validity.rangeOverflow) {\n        alert(\"The mentioned age is not allowed\");\n      }\n    }"
    },
    {
      "type": "LONG",
      "statement": "Is enums feature available in javascript",
      "explanation": "No, javascript does not natively support enums. But there are different kinds of solutions to simulate them even though they may not provide exact equivalents. For example, you can use freeze or seal on object,\n\n    var DaysEnum = Object.freeze({\"monday\":1, \"tuesday\":2, \"wednesday\":3, ...})"
    },
    {
      "type": "LONG",
      "statement": "What is an enum",
      "explanation": "An enum is a type restricting variables to one value from a predefined set of constants. JavaScript has no enums but typescript provides built-in enum support.\n\n    enum Color {\n     RED, GREEN, BLUE\n    }"
    },
    {
      "type": "LONG",
      "statement": "How do you list all properties of an object",
      "explanation": "You can use the `Object.getOwnPropertyNames()` method which returns an array of all properties found directly in a given object. Let's the usage of it in an example,\n\n    const newObject = {\n      a: 1,\n      b: 2,\n      c: 3,\n    };\n    \n    console.log(Object.getOwnPropertyNames(newObject));\n    [\"a\", \"b\", \"c\"];"
    },
    {
      "type": "LONG",
      "statement": "How do you get property descriptors of an object",
      "explanation": "You can use the `Object.getOwnPropertyDescriptors()` method which returns all own property descriptors of a given object. The example usage of this method is below,\n\n    const newObject = {\n      a: 1,\n      b: 2,\n      c: 3,\n    };\n    const descriptorsObject = Object.getOwnPropertyDescriptors(newObject);\n    console.log(descriptorsObject.a.writable); //true\n    console.log(descriptorsObject.a.configurable); //true\n    console.log(descriptorsObject.a.enumerable); //true\n    console.log(descriptorsObject.a.value); // 1"
    },
    {
      "type": "LONG",
      "statement": "What are the attributes provided by a property descriptor",
      "explanation": "A property descriptor is a record which has the following attributes\n\n1.  value: The value associated with the property\n2.  writable: Determines whether the value associated with the property can be changed or not\n3.  configurable: Returns true if the type of this property descriptor can be changed and if the property can be deleted from the corresponding object.\n4.  enumerable: Determines whether the property appears during enumeration of the properties on the corresponding object or not.\n5.  set: A function which serves as a setter for the property\n6.  get: A function which serves as a getter for the property"
    },
    {
      "type": "LONG",
      "statement": "How do you extend classes",
      "explanation": "The `extends` keyword is used in class declarations/expressions to create a class which is a child of another class. It can be used to subclass custom classes as well as built-in objects. The syntax would be as below,\n\n    class ChildClass extends ParentClass { ... }\n    \n\nLet's take an example of Square subclass from Polygon parent class,\n\n    class Square extends Rectangle {\n      constructor(length) {\n        super(length, length);\n        this.name = \"Square\";\n      }\n    \n      get area() {\n        return this.width * this.height;\n      }\n    \n      set area(value) {\n        this.area = value;\n      }\n    }"
    },
    {
      "type": "LONG",
      "statement": "How do I modify the url without reloading the page",
      "explanation": "The `window.location.url` property will be helpful to modify the url but it reloads the page. HTML5 introduced the `history.pushState()` and `history.replaceState()` methods, which allow you to add and modify history entries, respectively. For example, you can use pushState as below,\n\n    window.history.pushState(\"page2\", \"Title\", \"/page2.html\");"
    },
    {
      "type": "LONG",
      "statement": "How do you check whether an array includes a particular value or not",
      "explanation": "The `Array#includes()` method is used to determine whether an array includes a particular value among its entries by returning either true or false. Let's see an example to find an element(numeric and string) within an array.\n\n    var numericArray = [1, 2, 3, 4];\n    console.log(numericArray.includes(3)); // true\n    \n    var stringArray = [\"green\", \"yellow\", \"blue\"];\n    console.log(stringArray.includes(\"blue\")); //true"
    },
    {
      "type": "LONG",
      "statement": "How do you compare scalar arrays",
      "explanation": "You can use length and every method of arrays to compare two scalar(compared directly using ===) arrays. The combination of these expressions can give the expected result,\n\n    const arrayFirst = [1, 2, 3, 4, 5];\n    const arraySecond = [1, 2, 3, 4, 5];\n    console.log(\n      arrayFirst.length === arraySecond.length &&\n        arrayFirst.every((value, index) => value === arraySecond[index])\n    ); // true\n    \n\nIf you would like to compare arrays irrespective of order then you should sort them before,\n\n    const arrayFirst = [2, 3, 1, 4, 5];\n    const arraySecond = [1, 2, 3, 4, 5];\n    console.log(\n      arrayFirst.length === arraySecond.length &&\n        arrayFirst.sort().every((value, index) => value === arraySecond[index])\n    ); //true"
    },
    {
      "type": "LONG",
      "statement": "How to get the value from get parameters",
      "explanation": "The `new URL()` object accepts the url string and `searchParams` property of this object can be used to access the get parameters. Remember that you may need to use polyfill or `window.location` to access the URL in older browsers(including IE).\n\n    let urlString = \"http://www.some-domain.com/about.html?x=1&y=2&z=3\"; //window.location.href\n    let url = new URL(urlString);\n    let parameterZ = url.searchParams.get(\"z\");\n    console.log(parameterZ); // 3"
    },
    {
      "type": "LONG",
      "statement": "How do you print numbers with commas as thousand separators",
      "explanation": "You can use the `Number.prototype.toLocaleString()` method which returns a string with a language-sensitive representation such as thousand separator,currency etc of this number.\n\n    function convertToThousandFormat(x) {\n      return x.toLocaleString(); // 12,345.679\n    }\n    \n    console.log(convertToThousandFormat(12345.6789));"
    },
    {
      "type": "LONG",
      "statement": "What is the difference between java and javascript",
      "explanation": "Both are totally unrelated programming languages and no relation between them. Java is statically typed, compiled, runs on its own VM. Whereas Javascript is dynamically typed, interpreted, and runs in a browser and nodejs environments. Let's see the major differences in a tabular format, | Feature | Java | JavaScript | |---- | ---- | ----- | Typed | It's a strongly typed language | It's a dynamic typed language | | Paradigm | Object oriented programming | Prototype based programming | | Scoping | Block scoped | Function-scoped | | Concurrency | Thread based | event based | | Memory | Uses more memory | Uses less memory. Hence it will be used for web pages |"
    },
    {
      "type": "LONG",
      "statement": "Is javascript supports namespace",
      "explanation": "JavaScript doesn’t support namespace by default. So if you create any element(function, method, object, variable) then it becomes global and pollutes the global namespace. Let's take an example of defining two functions without any namespace,\n\n    function func1() {\n      console.log(\"This is a first definition\");\n    }\n    function func1() {\n      console.log(\"This is a second definition\");\n    }\n    func1(); // This is a second definition\n    \n\nIt always calls the second function definition. In this case, namespace will solve the name collision problem."
    },
    {
      "type": "LONG",
      "statement": "How do you declare namespace",
      "explanation": "Even though JavaScript lacks namespaces, we can use Objects , IIFE to create namespaces.\n\n1.  **Using Object Literal Notation:** Let's wrap variables and functions inside an Object literal which acts as a namespace. After that you can access them using object notation\n\n    var namespaceOne = {\n       function func1() {\n           console.log(\"This is a first definition\");\n       }\n    }\n    var namespaceTwo = {\n         function func1() {\n             console.log(\"This is a second definition\");\n         }\n     }\n    namespaceOne.func1(); // This is a first definition\n    namespaceTwo.func1(); // This is a second definition\n    \n\n1.  **Using IIFE (Immediately invoked function expression):** The outer pair of parentheses of IIFE creates a local scope for all the code inside of it and makes the anonymous function a function expression. Due to that, you can create the same function in two different function expressions to act as a namespace.\n\n    (function () {\n      function fun1() {\n        console.log(\"This is a first definition\");\n      }\n      fun1();\n    })();\n    \n    (function () {\n      function fun1() {\n        console.log(\"This is a second definition\");\n      }\n      fun1();\n    })();\n    \n\n1.  **Using a block and a let/const declaration:** In ECMAScript 6, you can simply use a block and a let declaration to restrict the scope of a variable to a block.\n\n    {\n      let myFunction = function fun1() {\n        console.log(\"This is a first definition\");\n      };\n      myFunction();\n    }\n    //myFunction(): ReferenceError: myFunction is not defined.\n    \n    {\n      let myFunction = function fun1() {\n        console.log(\"This is a second definition\");\n      };\n      myFunction();\n    }\n    //myFunction(): ReferenceError: myFunction is not defined."
    },
    {
      "type": "LONG",
      "statement": "How do you invoke javascript code in an iframe from parent page",
      "explanation": "Initially iFrame needs to be accessed using either `document.getElementBy` or `window.frames`. After that `contentWindow` property of iFrame gives the access for targetFunction\n\n    document.getElementById(\"targetFrame\").contentWindow.targetFunction();\n    window.frames[0].frameElement.contentWindow.targetFunction(); // Accessing iframe this way may not work in latest versions chrome and firefox"
    },
    {
      "type": "LONG",
      "statement": "How do get the timezone offset from date",
      "explanation": "You can use the `getTimezoneOffset` method of the date object. This method returns the time zone difference, in minutes, from current locale (host system settings) to UTC\n\n    var offset = new Date().getTimezoneOffset();\n    console.log(offset); // -480"
    },
    {
      "type": "LONG",
      "statement": "How do you load CSS and JS files dynamically",
      "explanation": "You can create both link and script elements in the DOM and append them as child to head tag. Let's create a function to add script and style resources as below,\n\n    function loadAssets(filename, filetype) {\n      if (filetype == \"css\") {\n        // External CSS file\n        var fileReference = document.createElement(\"link\");\n        fileReference.setAttribute(\"rel\", \"stylesheet\");\n        fileReference.setAttribute(\"type\", \"text/css\");\n        fileReference.setAttribute(\"href\", filename);\n      } else if (filetype == \"js\") {\n        // External JavaScript file\n        var fileReference = document.createElement(\"script\");\n        fileReference.setAttribute(\"type\", \"text/javascript\");\n        fileReference.setAttribute(\"src\", filename);\n      }\n      if (typeof fileReference != \"undefined\")\n        document.getElementsByTagName(\"head\")[0].appendChild(fileReference);\n    }"
    },
    {
      "type": "LONG",
      "statement": "What are the different methods to find HTML elements in DOM",
      "explanation": "If you want to access any element in an HTML page, you need to start with accessing the document object. Later you can use any of the below methods to find the HTML element,\n\n1.  document.getElementById(id): It finds an element by Id\n2.  document.getElementsByTagName(name): It finds an element by tag name\n3.  document.getElementsByClassName(name): It finds an element by class name"
    },
    {
      "type": "LONG",
      "statement": "What is jQuery",
      "explanation": "jQuery is a popular cross-browser JavaScript library that provides Document Object Model (DOM) traversal, event handling, animations and AJAX interactions by minimizing the discrepancies across browsers. It is widely famous with its philosophy of “Write less, do more”. For example, you can display welcome message on the page load using jQuery as below,\n\n    $(document).ready(function () {\n      // It selects the document and apply the function on page load\n      alert(\"Welcome to jQuery world\");\n    });\n    \n\n**Note:** You can download it from jquery's official site or install it from CDNs, like google."
    },
    {
      "type": "LONG",
      "statement": "What is V8 JavaScript engine",
      "explanation": "V8 is an open source high-performance JavaScript engine used by the Google Chrome browser, written in C++. It is also being used in the node.js project. It implements ECMAScript and WebAssembly, and runs on Windows 7 or later, macOS 10.12+, and Linux systems that use x64, IA-32, ARM, or MIPS processors. **Note:** It can run standalone, or can be embedded into any C++ application."
    },
    {
      "type": "LONG",
      "statement": "Why do we call javascript as dynamic language",
      "explanation": "JavaScript is a loosely typed or a dynamic language because variables in JavaScript are not directly associated with any particular value type, and any variable can be assigned/reassigned with values of all types.\n\n    let age = 50; // age is a number now\n    age = \"old\"; // age is a string now\n    age = true; // age is a boolean"
    },
    {
      "type": "LONG",
      "statement": "What is a void operator",
      "explanation": "The `void` operator evaluates the given expression and then returns undefined(i.e, without returning value). The syntax would be as below,\n\n    void expression;\n    void expression;\n    \n\nLet's display a message without any redirection or reload\n\n    <a href=\"javascript:void(alert('Welcome to JS world'))\">\n      Click here to see a message\n    </a>\n    \n\n**Note:** This operator is often used to obtain the undefined primitive value, using \"void(0)\"."
    },
    {
      "type": "LONG",
      "statement": "How to set the cursor to wait",
      "explanation": "The cursor can be set to wait in JavaScript by using the property \"cursor\". Let's perform this behavior on page load using the below function.\n\n    function myFunction() {\n      window.document.body.style.cursor = \"wait\";\n    }\n    \n\nand this function invoked on page load\n\n    <body onload=\"myFunction()\"></body>"
    },
    {
      "type": "LONG",
      "statement": "How do you create an infinite loop",
      "explanation": "You can create infinite loops using for and while loops without using any expressions. The for loop construct or syntax is better approach in terms of ESLint and code optimizer tools,\n\n    for (;;) {}\n    while (true) {}"
    },
    {
      "type": "LONG",
      "statement": "Why do you need to avoid with statement",
      "explanation": "JavaScript's with statement was intended to provide a shorthand for writing recurring accesses to objects. So it can help reduce file size by reducing the need to repeat a lengthy object reference without performance penalty. Let's take an example where it is used to avoid redundancy when accessing an object several times.\n\n    a.b.c.greeting = \"welcome\";\n    a.b.c.age = 32;\n    \n\nUsing `with` it turns this into:\n\n    with (a.b.c) {\n      greeting = \"welcome\";\n      age = 32;\n    }\n    \n\nBut this `with` statement creates performance problems since one cannot predict whether an argument will refer to a real variable or to a property inside the with argument."
    },
    {
      "type": "LONG",
      "statement": "What is the output of below for loops",
      "explanation": "    for (var i = 0; i < 4; i++) {\n      // global scope\n      setTimeout(() => console.log(i));\n    }\n    \n    for (let i = 0; i < 4; i++) {\n      // block scope\n      setTimeout(() => console.log(i));\n    }\n    \n\nThe output of the above for loops is 4 4 4 4 and 0 1 2 3 **Explanation:** Due to the event queue/loop of javascript, the `setTimeout` callback function is called after the loop has been executed. Since the variable i is declared with the `var` keyword it became a global variable and the value was equal to 4 using iteration when the time setTimeout function is invoked. Hence, the output of the first loop is `4 4 4 4`. Whereas in the second loop, the variable i is declared as the `let` keyword it becomes a block scoped variable and it holds a new value(0, 1 ,2 3) for each iteration. Hence, the output of the first loop is `0 1 2 3`."
    },
    {
      "type": "LONG",
      "statement": "List down some of the features of ES6",
      "explanation": "Below are the list of some new features of ES6,\n\n1.  Support for constants or immutable variables\n2.  Block-scope support for variables, constants and functions\n3.  Arrow functions\n4.  Default parameters\n5.  Rest and Spread Parameters\n6.  Template Literals\n7.  Multi-line Strings\n8.  Destructuring Assignment\n9.  Enhanced Object Literals\n10.  Promises\n11.  Classes\n12.  Modules"
    },
    {
      "type": "LONG",
      "statement": "What is ES6",
      "explanation": "ES6 is the sixth edition of the javascript language and it was released in June 2015. It was initially known as ECMAScript 6 (ES6) and later renamed to ECMAScript 2015. Almost all the modern browsers support ES6 but for the old browsers there are many transpilers, like Babel.js etc."
    },
    {
      "type": "LONG",
      "statement": "Can I redeclare let and const variables",
      "explanation": "No, you cannot redeclare let and const variables. If you do, it throws below error\n\n    Uncaught SyntaxError: Identifier 'someVariable' has already been declared\n    \n\n**Explanation:** The variable declaration with `var` keyword refers to a function scope and the variable is treated as if it were declared at the top of the enclosing scope due to hoisting feature. So all the multiple declarations contributing to the same hoisted variable without any error. Let's take an example of re-declaring variables in the same scope for both var and let/const variables.\n\n    var name = \"John\";\n    function myFunc() {\n      var name = \"Nick\";\n      var name = \"Abraham\"; // Re-assigned in the same function block\n      alert(name); // Abraham\n    }\n    myFunc();\n    alert(name); // John\n    \n\nThe block-scoped multi-declaration throws syntax error,\n\n    let name = \"John\";\n    function myFunc() {\n      let name = \"Nick\";\n      let name = \"Abraham\"; // Uncaught SyntaxError: Identifier 'name' has already been declared\n      alert(name);\n    }\n    \n    myFunc();\n    alert(name);"
    },
    {
      "type": "LONG",
      "statement": "Is const variable makes the value immutable",
      "explanation": "No, the const variable doesn't make the value immutable. But it disallows subsequent assignments(i.e, You can declare with assignment but can't assign another value later)\n\n    const userList = [];\n    userList.push(\"John\"); // Can mutate even though it can't re-assign\n    console.log(userList); // ['John']"
    },
    {
      "type": "LONG",
      "statement": "What are default parameters",
      "explanation": "In E5, we need to depend on logical OR operators to handle default values of function parameters. Whereas in ES6, Default function parameters feature allows parameters to be initialized with default values if no value or undefined is passed. Let's compare the behavior with an examples,\n\n    //ES5\n    var calculateArea = function (height, width) {\n      height = height || 50;\n      width = width || 60;\n    \n      return width * height;\n    };\n    console.log(calculateArea()); //300\n    \n\nThe default parameters makes the initialization more simpler,\n\n    //ES6\n    var calculateArea = function (height = 50, width = 60) {\n      return width * height;\n    };\n    \n    console.log(calculateArea()); //300"
    },
    {
      "type": "LONG",
      "statement": "What are template literals",
      "explanation": "Template literals or template strings are string literals allowing embedded expressions. These are enclosed by the back-tick (\\`) character instead of double or single quotes. In E6, this feature enables using dynamic expressions as below,\n\n    var greeting = `Welcome to JS World, Mr. ${firstName} ${lastName}.`;\n    \n\nIn ES5, you need break string like below,\n\n    var greeting = 'Welcome to JS World, Mr. ' + firstName + ' ' + lastName.`\n    \n\n**Note:** You can use multi-line strings and string interpolation features with template literals."
    },
    {
      "type": "LONG",
      "statement": "How do you write multi-line strings in template literals",
      "explanation": "In ES5, you would have to use newline escape characters('\\\\n') and concatenation symbols(+) in order to get multi-line strings.\n\n    console.log(\"This is string sentence 1\\n\" + \"This is string sentence 2\");\n    \n\nWhereas in ES6, You don't need to mention any newline sequence character,\n\n    console.log(`This is string sentence\n    'This is string sentence 2`);"
    },
    {
      "type": "LONG",
      "statement": "What are nesting templates",
      "explanation": "The nesting template is a feature supported within template literals syntax to allow inner backticks inside a placeholder ${ } within the template. For example, the below nesting template is used to display the icons based on user permissions whereas outer template checks for platform type,\n\n    const iconStyles = `icon ${\n      isMobilePlatform()\n        ? \"\"\n        : `icon-${user.isAuthorized ? \"submit\" : \"disabled\"}`\n    }`;\n    \n\nYou can write the above use case without nesting template features as well. However, the nesting template feature is more compact and readable.\n\n    //Without nesting templates\n     const iconStyles = `icon ${ isMobilePlatform() ? '' :\n      (user.isAuthorized ? 'icon-submit' : 'icon-disabled'}`;"
    },
    {
      "type": "LONG",
      "statement": "What are tagged templates",
      "explanation": "Tagged templates are the advanced form of templates in which tags allow you to parse template literals with a function. The tag function accepts the first parameter as an array of strings and remaining parameters as expressions. This function can also return manipulated strings based on parameters. Let's see the usage of this tagged template behavior of an IT professional skill set in an organization,\n\n    var user1 = 'John';\n    var skill1 = 'JavaScript';\n    var experience1 = 15;\n    \n    var user2 = 'Kane';\n    var skill2 = 'JavaScript';\n    var experience2 = 5;\n    \n    function myInfoTag(strings, userExp, experienceExp, skillExp) {\n      var str0 = strings[0]; // \"Mr/Ms. \"\n      var str1 = strings[1]; // \" is a/an \"\n      var str2 = strings[2]; // \"in\"\n    \n      var expertiseStr;\n      if (experienceExp > 10){\n        expertiseStr = 'expert developer';\n      } else if(skillExp > 5 && skillExp <= 10) {\n        expertiseStr = 'senior developer';\n      } else {\n        expertiseStr = 'junior developer';\n      }\n    \n      return ${str0}${userExp}${str1}${expertiseStr}${str2}${skillExp};\n    }\n    \n    var output1 = myInfoTag`Mr/Ms. ${ user1 } is a/an ${ experience1 } in ${skill1}`;\n    var output2 = myInfoTag`Mr/Ms. ${ user2 } is a/an ${ experience2 } in ${skill2}`;\n    \n    console.log(output1);// Mr/Ms. John is a/an expert developer in JavaScript\n    console.log(output2);// Mr/Ms. Kane is a/an junior developer in JavaScript"
    },
    {
      "type": "LONG",
      "statement": "What are raw strings",
      "explanation": "ES6 provides a raw strings feature using the `String.raw()` method which is used to get the raw string form of template strings. This feature allows you to access the raw strings as they were entered, without processing escape sequences. For example, the usage would be as below,\n\n    var calculationString = String.raw`The sum of numbers is \\n${\n      1 + 2 + 3 + 4\n    }!`;\n    console.log(calculationString); // The sum of numbers is 10\n    \n\nIf you don't use raw strings, the newline character sequence will be processed by displaying the output in multiple lines\n\n    var calculationString = `The sum of numbers is \\n${1 + 2 + 3 + 4}!`;\n    console.log(calculationString);\n    // The sum of numbers is\n    // 10\n    \n\nAlso, the raw property is available on the first argument to the tag function\n\n    function tag(strings) {\n      console.log(strings.raw[0]);\n    }"
    },
    {
      "type": "LONG",
      "statement": "What is destructuring assignment",
      "explanation": "The destructuring assignment is a JavaScript expression that makes it possible to unpack values from arrays or properties from objects into distinct variables. Let's get the month values from an array using destructuring assignment\n\n    var [one, two, three] = [\"JAN\", \"FEB\", \"MARCH\"];\n    \n    console.log(one); // \"JAN\"\n    console.log(two); // \"FEB\"\n    console.log(three); // \"MARCH\"\n    \n\nand you can get user properties of an object using destructuring assignment,\n\n    var { name, age } = { name: \"John\", age: 32 };\n    \n    console.log(name); // John\n    console.log(age); // 32"
    },
    {
      "type": "LONG",
      "statement": "What are default values in destructuring assignment",
      "explanation": "A variable can be assigned a default value when the value unpacked from the array or object is undefined during destructuring assignment. It helps to avoid setting default values separately for each assignment. Let's take an example for both arrays and object use cases,\n\n**Arrays destructuring:**\n\n    var x, y, z;\n    \n    [x = 2, y = 4, z = 6] = [10];\n    console.log(x); // 10\n    console.log(y); // 4\n    console.log(z); // 6\n    \n\n**Objects destructuring:**\n\n    var { x = 2, y = 4, z = 6 } = { x: 10 };\n    \n    console.log(x); // 10\n    console.log(y); // 4\n    console.log(z); // 6"
    },
    {
      "type": "LONG",
      "statement": "How do you swap variables in destructuring assignment",
      "explanation": "If you don't use destructuring assignment, swapping two values requires a temporary variable. Whereas using a destructuring feature, two variable values can be swapped in one destructuring expression. Let's swap two number variables in array destructuring assignment,\n\n    var x = 10,\n      y = 20;\n    \n    [x, y] = [y, x];\n    console.log(x); // 20\n    console.log(y); // 10"
    },
    {
      "type": "LONG",
      "statement": "What are enhanced object literals",
      "explanation": "Object literals make it easy to quickly create objects with properties inside the curly braces. For example, it provides shorter syntax for common object property definition as below.\n\n    //ES6\n    var x = 10,\n      y = 20;\n    obj = { x, y };\n    console.log(obj); // {x: 10, y:20}\n    //ES5\n    var x = 10,\n      y = 20;\n    obj = { x: x, y: y };\n    console.log(obj); // {x: 10, y:20}"
    },
    {
      "type": "LONG",
      "statement": "What are dynamic imports",
      "explanation": "The dynamic imports using `import()` function syntax allows us to load modules on demand by using promises or the async/await syntax. Currently this feature is in [stage4 proposal](https://github.com/tc39/proposal-dynamic-import). The main advantage of dynamic imports is reduction of our bundle's sizes, the size/payload response of our requests and overall improvements in the user experience. The syntax of dynamic imports would be as below,\n\n    import(\"./Module\").then((Module) => Module.method());"
    },
    {
      "type": "LONG",
      "statement": "What are the use cases for dynamic imports",
      "explanation": "Below are some of the use cases of using dynamic imports over static imports,\n\n1.  Import a module on-demand or conditionally. For example, if you want to load a polyfill on legacy browser\n\n    if (isLegacyBrowser()) {\n        import(···)\n        .then(···);\n    }\n    \n\n1.  Compute the module specifier at runtime. For example, you can use it for internationalization.\n\n    import(`messages_${getLocale()}.js`).then(···);\n    \n\n1.  Import a module from within a regular script instead a module."
    },
    {
      "type": "LONG",
      "statement": "What are typed arrays",
      "explanation": "Typed arrays are array-like objects from ECMAScript 6 API for handling binary data. JavaScript provides 8 Typed array types,\n\n1.  Int8Array: An array of 8-bit signed integers\n2.  Int16Array: An array of 16-bit signed integers\n3.  Int32Array: An array of 32-bit signed integers\n4.  Uint8Array: An array of 8-bit unsigned integers\n5.  Uint16Array: An array of 16-bit unsigned integers\n6.  Uint32Array: An array of 32-bit unsigned integers\n7.  Float32Array: An array of 32-bit floating point numbers\n8.  Float64Array: An array of 64-bit floating point numbers\n\nFor example, you can create an array of 8-bit signed integers as below\n\n    const a = new Int8Array();\n    // You can pre-allocate n bytes\n    const bytes = 1024;\n    const a = new Int8Array(bytes);"
    },
    {
      "type": "LONG",
      "statement": "What are the advantages of module loaders",
      "explanation": "The module loaders provides the below features,\n\n1.  Dynamic loading\n2.  State isolation\n3.  Global namespace isolation\n4.  Compilation hooks\n5.  Nested virtualization"
    },
    {
      "type": "LONG",
      "statement": "What is collation",
      "explanation": "Collation is used for sorting a set of strings and searching within a set of strings. It is parameterized by locale and aware of Unicode. Let's take comparison and sorting features,\n\n1.  **Comparison:**\n\n    var list = [\"ä\", \"a\", \"z\"]; // In German,  \"ä\" sorts with \"a\" Whereas in Swedish, \"ä\" sorts after \"z\"\n    var l10nDE = new Intl.Collator(\"de\");\n    var l10nSV = new Intl.Collator(\"sv\");\n    console.log(l10nDE.compare(\"ä\", \"z\") === -1); // true\n    console.log(l10nSV.compare(\"ä\", \"z\") === +1); // true\n    \n\n1.  **Sorting:**\n\n    var list = [\"ä\", \"a\", \"z\"]; // In German,  \"ä\" sorts with \"a\" Whereas in Swedish, \"ä\" sorts after \"z\"\n    var l10nDE = new Intl.Collator(\"de\");\n    var l10nSV = new Intl.Collator(\"sv\");\n    console.log(list.sort(l10nDE.compare)); // [ \"a\", \"ä\", \"z\" ]\n    console.log(list.sort(l10nSV.compare)); // [ \"a\", \"z\", \"ä\" ]"
    },
    {
      "type": "LONG",
      "statement": "What is for...of statement",
      "explanation": "The for...of statement creates a loop iterating over iterable objects or elements such as built-in String, Array, Array-like objects (like arguments or NodeList), TypedArray, Map, Set, and user-defined iterables. The basic usage of for...of statement on arrays would be as below,\n\n    let arrayIterable = [10, 20, 30, 40, 50];\n    \n    for (let value of arrayIterable) {\n      value++;\n      console.log(value); // 11 21 31 41 51\n    }"
    },
    {
      "type": "LONG",
      "statement": "What is the output of below spread operator array",
      "explanation": "    [...\"John Resig\"];\n    \n\nThe output of the array is \\['J', 'o', 'h', 'n', '', 'R', 'e', 's', 'i', 'g'\\] **Explanation:** The string is an iterable type and the spread operator within an array maps every character of an iterable to one element. Hence, each character of a string becomes an element within an Array."
    },
    {
      "type": "LONG",
      "statement": "Is PostMessage secure",
      "explanation": "Yes, postMessages can be considered very secure as long as the programmer/developer is careful about checking the origin and source of an arriving message. But if you try to send/receive a message without verifying its source will create cross-site scripting attacks."
    },
    {
      "type": "LONG",
      "statement": "What are the problems with postmessage target origin as wildcard",
      "explanation": "The second argument of postMessage method specifies which origin is allowed to receive the message. If you use the wildcard “\\*” as an argument then any origin is allowed to receive the message. In this case, there is no way for the sender window to know if the target window is at the target origin when sending the message. If the target window has been navigated to another origin, the other origin would receive the data. Hence, this may lead to XSS vulnerabilities.\n\n    targetWindow.postMessage(message, \"*\");"
    },
    {
      "type": "LONG",
      "statement": "How do you avoid receiving postMessages from attackers",
      "explanation": "Since the listener listens for any message, an attacker can trick the application by sending a message from the attacker’s origin, which gives an impression that the receiver received the message from the actual sender’s window. You can avoid this issue by validating the origin of the message on the receiver's end using the “message.origin” attribute. For examples, let's check the sender's origin [http://www.some-sender.com](http://www.some-sender.com) on receiver side [www.some-receiver.com](www.some-receiver.com),\n\n    //Listener on http://www.some-receiver.com/\n    window.addEventListener(\"message\", function(message){\n        if(/^http://www\\.some-sender\\.com$/.test(message.origin)){\n             console.log('You received the data from valid sender', message.data);\n       }\n    });"
    },
    {
      "type": "LONG",
      "statement": "Can I avoid using postMessages completely",
      "explanation": "You cannot avoid using postMessages completely(or 100%). Even though your application doesn’t use postMessage considering the risks, a lot of third party scripts use postMessage to communicate with the third party service. So your application might be using postMessage without your knowledge."
    },
    {
      "type": "LONG",
      "statement": "Is postMessages synchronous",
      "explanation": "The postMessages are synchronous in IE8 browser but they are asynchronous in IE9 and all other modern browsers (i.e, IE9+, Firefox, Chrome, Safari).Due to this asynchronous behaviour, we use a callback mechanism when the postMessage is returned."
    },
    {
      "type": "LONG",
      "statement": "What paradigm is Javascript",
      "explanation": "JavaScript is a multi-paradigm language, supporting imperative/procedural programming, Object-Oriented Programming and functional programming. JavaScript supports Object-Oriented Programming with prototypical inheritance."
    },
    {
      "type": "LONG",
      "statement": "What is the difference between internal and external javascript",
      "explanation": "**Internal JavaScript:** It is the source code within the script tag. **External JavaScript:** The source code is stored in an external file(stored with .js extension) and referred with in the tag."
    },
    {
      "type": "LONG",
      "statement": "Is JavaScript faster than server side script",
      "explanation": "Yes, JavaScript is faster than server side script. Because JavaScript is a client-side script it does not require any web server’s help for its computation or calculation. So JavaScript is always faster than any server-side script like ASP, PHP, etc."
    },
    {
      "type": "LONG",
      "statement": "How do you get the status of a checkbox",
      "explanation": "You can apply the `checked` property on the selected checkbox in the DOM. If the value is `True` means the checkbox is checked otherwise it is unchecked. For example, the below HTML checkbox element can be access using javascript as below,\n\n    <input type=\"checkbox\" name=\"checkboxname\" value=\"Agree\" /> Agree the\n    conditions<br />\n    \n\n    console.log(document.getElementById(‘checkboxname’).checked); // true or false"
    },
    {
      "type": "LONG",
      "statement": "What is the purpose of double tilde operator",
      "explanation": "The double tilde operator(~~) is known as double NOT bitwise operator. This operator is going to be a quicker substitute for Math.floor()."
    },
    {
      "type": "LONG",
      "statement": "How do you convert character to ASCII code",
      "explanation": "You can use the `String.prototype.charCodeAt()` method to convert string characters to ASCII numbers. For example, let's find ASCII code for the first letter of 'ABC' string,\n\n    \"ABC\".charCodeAt(0); // returns 65\n    \n\nWhereas `String.fromCharCode()` method converts numbers to equal ASCII characters.\n\n    String.fromCharCode(65, 66, 67); // returns 'ABC'"
    },
    {
      "type": "LONG",
      "statement": "What is ArrayBuffer",
      "explanation": "An ArrayBuffer object is used to represent a generic, fixed-length raw binary data buffer. You can create it as below,\n\n    let buffer = new ArrayBuffer(16); // create a buffer of length 16\n    alert(buffer.byteLength); // 16\n    \n\nTo manipulate an ArrayBuffer, we need to use a “view” object.\n\n    //Create a DataView referring to the buffer\n    let view = new DataView(buffer);"
    },
    {
      "type": "LONG",
      "statement": "What is the output of below string expression",
      "explanation": "    console.log(\"Welcome to JS world\"[0]);\n    \n\nThe output of the above expression is \"W\". **Explanation:** The bracket notation with specific index on a string returns the character at a specific location. Hence, it returns the character \"W\" of the string. Since this is not supported in IE7 and below versions, you may need to use the .charAt() method to get the desired result."
    },
    {
      "type": "LONG",
      "statement": "What is the purpose of Error object",
      "explanation": "The Error constructor creates an error object and the instances of error objects are thrown when runtime errors occur. The Error object can also be used as a base object for user-defined exceptions. The syntax of error object would be as below,\n\n    new Error([message[, fileName[, lineNumber]]])\n    \n\nYou can throw user defined exceptions or errors using Error object in try...catch block as below,\n\n    try {\n      if (withdraw > balance)\n        throw new Error(\"Oops! You don't have enough balance\");\n    } catch (e) {\n      console.log(e.name + \": \" + e.message);\n    }"
    },
    {
      "type": "LONG",
      "statement": "What is the purpose of EvalError object",
      "explanation": "The EvalError object indicates an error regarding the global `eval()` function. Even though this exception is not thrown by JavaScript anymore, the EvalError object remains for compatibility. The syntax of this expression would be as below,\n\n    new EvalError([message[, fileName[, lineNumber]]])\n    \n\nYou can throw EvalError with in try...catch block as below,\n\n    try {\n      throw new EvalError('Eval function error', 'someFile.js', 100);\n    } catch (e) {\n      console.log(e.message, e.name, e.fileName);              // \"Eval function error\", \"EvalError\", \"someFile.js\""
    },
    {
      "type": "LONG",
      "statement": "What are the list of cases error thrown from non-strict mode to strict mode",
      "explanation": "When you apply 'use strict'; syntax, some of the below cases will throw a SyntaxError before executing the script\n\n1.  When you use Octal syntax\n\n    var n = 022;\n    \n\n1.  Using `with` statement\n2.  When you use delete operator on a variable name\n3.  Using eval or arguments as variable or function argument name\n4.  When you use newly reserved keywords\n5.  When you declare a function in a block\n\n    if (someCondition) {\n      function f() {}\n    }\n    \n\nHence, the errors from above cases are helpful to avoid errors in development/production environments."
    },
    {
      "type": "LONG",
      "statement": "Is all objects have prototypes",
      "explanation": "No. All objects have prototypes except for the base object which is created by the user, or an object that is created using the new keyword."
    },
    {
      "type": "LONG",
      "statement": "What is the difference between a parameter and an argument",
      "explanation": "Parameter is the variable name of a function definition whereas an argument represents the value given to a function when it is invoked. Let's explain this with a simple function\n\n    function myFunction(parameter1, parameter2, parameter3) {\n      console.log(arguments[0]); // \"argument1\"\n      console.log(arguments[1]); // \"argument2\"\n      console.log(arguments[2]); // \"argument3\"\n    }\n    myFunction(\"argument1\", \"argument2\", \"argument3\");"
    },
    {
      "type": "LONG",
      "statement": "What is the purpose of some method in arrays",
      "explanation": "The some() method is used to test whether at least one element in the array passes the test implemented by the provided function. The method returns a boolean value. Let's take an example to test for any odd elements,\n\n    var array = [1, 2, 3, 4, 5, 6 ,7, 8, 9, 10];\n    \n    var odd = element ==> element % 2 !== 0;\n    \n    console.log(array.some(odd)); // true (the odd element exists)"
    },
    {
      "type": "LONG",
      "statement": "How do you combine two or more arrays",
      "explanation": "The concat() method is used to join two or more arrays by returning a new array containing all the elements. The syntax would be as below,\n\n    array1.concat(array2, array3, ..., arrayX)\n    \n\nLet's take an example of array's concatenation with veggies and fruits arrays,\n\n    var veggies = [\"Tomato\", \"Carrot\", \"Cabbage\"];\n    var fruits = [\"Apple\", \"Orange\", \"Pears\"];\n    var veggiesAndFruits = veggies.concat(fruits);\n    console.log(veggiesAndFruits); // Tomato, Carrot, Cabbage, Apple, Orange, Pears"
    },
    {
      "type": "LONG",
      "statement": "What is the difference between Shallow and Deep copy",
      "explanation": "There are two ways to copy an object,\n\n**Shallow Copy:** Shallow copy is a bitwise copy of an object. A new object is created that has an exact copy of the values in the original object. If any of the fields of the object are references to other objects, just the reference addresses are copied i.e., only the memory address is copied.\n\n**Example**\n\n    var empDetails = {\n      name: \"John\",\n      age: 25,\n      expertise: \"Software Developer\",\n    };\n    \n\nto create a duplicate\n\n    var empDetailsShallowCopy = empDetails; //Shallow copying!\n    \n\nif we change some property value in the duplicate one like this:\n\n    empDetailsShallowCopy.name = \"Johnson\";\n    \n\nThe above statement will also change the name of `empDetails`, since we have a shallow copy. That means we're losing the original data as well.\n\n**Deep copy:** A deep copy copies all fields, and makes copies of dynamically allocated memory pointed to by the fields. A deep copy occurs when an object is copied along with the objects to which it refers.\n\n**Example**\n\n    var empDetails = {\n      name: \"John\",\n      age: 25,\n      expertise: \"Software Developer\",\n    };\n    \n\nCreate a deep copy by using the properties from the original object into new variable\n\n    var empDetailsDeepCopy = {\n      name: empDetails.name,\n      age: empDetails.age,\n      expertise: empDetails.expertise,\n    };\n    \n\nNow if you change `empDetailsDeepCopy.name`, it will only affect `empDetailsDeepCopy` & not `empDetails`"
    },
    {
      "type": "LONG",
      "statement": "How do you create specific number of copies of a string",
      "explanation": "The `repeat()` method is used to construct and return a new string which contains the specified number of copies of the string on which it was called, concatenated together. Remember that this method has been added to the ECMAScript 2015 specification. Let's take an example of Hello string to repeat it 4 times,\n\n    \"Hello\".repeat(4); // 'HelloHelloHelloHello'"
    },
    {
      "type": "LONG",
      "statement": "How do you return all matching strings against a regular expression",
      "explanation": "The `matchAll()` method can be used to return an iterator of all results matching a string against a regular expression. For example, the below example returns an array of matching string results against a regular expression,\n\n    let regexp = /Hello(\\d?))/g;\n    let greeting = \"Hello1Hello2Hello3\";\n    \n    let greetingList = [...greeting.matchAll(regexp)];\n    \n    console.log(greetingList[0]); //Hello1\n    console.log(greetingList[1]); //Hello2\n    console.log(greetingList[2]); //Hello3"
    },
    {
      "type": "LONG",
      "statement": "How do you trim a string at the beginning or ending",
      "explanation": "The `trim` method of string prototype is used to trim on both sides of a string. But if you want to trim especially at the beginning or ending of the string then you can use `trimStart/trimLeft` and `trimEnd/trimRight` methods. Let's see an example of these methods on a greeting message,\n\n    var greeting = \"   Hello, Goodmorning!   \";\n    \n    console.log(greeting); // \"   Hello, Goodmorning!   \"\n    console.log(greeting.trimStart()); // \"Hello, Goodmorning!   \"\n    console.log(greeting.trimLeft()); // \"Hello, Goodmorning!   \"\n    \n    console.log(greeting.trimEnd()); // \"   Hello, Goodmorning!\"\n    console.log(greeting.trimRight()); // \"   Hello, Goodmorning!\""
    },
    {
      "type": "LONG",
      "statement": "What is the output of below console statement with unary operator",
      "explanation": "Let's take console statement with unary operator as given below,\n\n    console.log(+\"Hello\");\n    \n\nThe output of the above console log statement returns NaN. Because the element is prefixed by the unary operator and the JavaScript interpreter will try to convert that element into a number type. Since the conversion fails, the value of the statement results in NaN value."
    },
    {
      "type": "LONG",
      "statement": "Does javascript uses mixins",
      "explanation": ""
    },
    {
      "type": "LONG",
      "statement": "What is a thunk function",
      "explanation": "A thunk is just a function which delays the evaluation of the value. It doesn’t take any arguments but gives the value whenever you invoke the thunk. i.e, It is used not to execute now but it will be sometime in the future. Let's take a synchronous example,\n\n    const add = (x, y) => x + y;\n    \n    const thunk = () => add(2, 3);\n    \n    thunk(); // 5"
    },
    {
      "type": "LONG",
      "statement": "What are asynchronous thunks",
      "explanation": "The asynchronous thunks are useful to make network requests. Let's see an example of network requests,\n\n    function fetchData(fn) {\n      fetch(\"https://jsonplaceholder.typicode.com/todos/1\")\n        .then((response) => response.json())\n        .then((json) => fn(json));\n    }\n    \n    const asyncThunk = function () {\n      return fetchData(function getData(data) {\n        console.log(data);\n      });\n    };\n    \n    asyncThunk();\n    \n\nThe `getData` function won't be called immediately but it will be invoked only when the data is available from API endpoint. The setTimeout function is also used to make our code asynchronous. The best real time example is redux state management library which uses the asynchronous thunks to delay the actions to dispatch."
    },
    {
      "type": "LONG",
      "statement": "What is the output of below function calls",
      "explanation": "**Code snippet:**\n\n    const circle = {\n      radius: 20,\n      diameter() {\n        return this.radius * 2;\n      },\n      perimeter: () => 2 * Math.PI * this.radius,\n    };\n    \n\nconsole.log(circle.diameter()); console.log(circle.perimeter());\n\n**Output:**\n\nThe output is 40 and NaN. Remember that diameter is a regular function, whereas the value of perimeter is an arrow function. The `this` keyword of a regular function(i.e, diameter) refers to the surrounding scope which is a class(i.e, Shape object). Whereas this keyword of perimeter function refers to the surrounding scope which is a window object. Since there is no radius property on window objects it returns an undefined value and the multiple of number value returns NaN value."
    },
    {
      "type": "LONG",
      "statement": "How to remove all line breaks from a string",
      "explanation": "The easiest approach is using regular expressions to detect and replace newlines in the string. In this case, we use replace function along with string to replace with, which in our case is an empty string.\n\n    function remove_linebreaks( var message ) {\n        return message.replace( /[\\r\\n]+/gm, \"\" );\n    }\n    \n\nIn the above expression, g and m are for global and multiline flags."
    },
    {
      "type": "LONG",
      "statement": "What is the difference between reflow and repaint",
      "explanation": "A _repaint_ occurs when changes are made which affect the visibility of an element, but not its layout. Examples of this include outline, visibility, or background color. A _reflow_ involves changes that affect the layout of a portion of the page (or the whole page). Resizing the browser window, changing the font, content changing (such as user typing text), using JavaScript methods involving computed styles, adding or removing elements from the DOM, and changing an element's classes are a few of the things that can trigger reflow. Reflow of an element causes the subsequent reflow of all child and ancestor elements as well as any elements following it in the DOM."
    },
    {
      "type": "LONG",
      "statement": "What happens with negating an array",
      "explanation": "Negating an array with `!` character will coerce the array into a boolean. Since Arrays are considered to be truthy So negating it will return `false`.\n\n    console.log(![]); // false"
    },
    {
      "type": "LONG",
      "statement": "What happens if we add two arrays",
      "explanation": "If you add two arrays together, it will convert them both to strings and concatenate them. For example, the result of adding arrays would be as below,\n\n    console.log([\"a\"] + [\"b\"]); // \"ab\"\n    console.log([] + []); // \"\"\n    console.log(![] + []); // \"false\", because ![] returns false."
    },
    {
      "type": "LONG",
      "statement": "What is the output of prepend additive operator on falsy values",
      "explanation": "If you prepend the additive(+) operator on falsy values(null, undefined, NaN, false, \"\"), the falsy value converts to a number value zero. Let's display them on browser console as below,\n\n    console.log(+null); // 0\n    console.log(+undefined); // NaN\n    console.log(+false); // 0\n    console.log(+NaN); // NaN\n    console.log(+\"\"); // 0"
    },
    {
      "type": "LONG",
      "statement": "How do you create self string using special characters",
      "explanation": "The self string can be formed with the combination of `[]()!+` characters. You need to remember the below conventions to achieve this pattern.\n\n1.  Since Arrays are truthful values, negating the arrays will produce false: !\\[\\] === false\n2.  As per JavaScript coercion rules, the addition of arrays together will toString them: \\[\\] + \\[\\] === \"\"\n3.  Prepend an array with + operator will convert an array to false, the negation will make it true and finally converting the result will produce value '1': +(!(+\\[\\])) === 1\n\nBy applying the above rules, we can derive below conditions\n\n    (![] + [] === \"false\" + !+[]) === 1;\n    \n\nNow the character pattern would be created as below,\n\n          s               e               l               f\n     ^^^^^^^^^^^^^   ^^^^^^^^^^^^^   ^^^^^^^^^^^^^   ^^^^^^^^^^^^^\n    \n     (![] + [])[3] + (![] + [])[4] + (![] + [])[2] + (![] + [])[0]\n     ^^^^^^^^^^^^^   ^^^^^^^^^^^^^   ^^^^^^^^^^^^^   ^^^^^^^^^^^^^\n    (![] + [])[+!+[]+!+[]+!+[]] +\n    (![] + [])[+!+[]+!+[]+!+[]+!+[]] +\n    (![] + [])[+!+[]+!+[]] +\n    (![] + [])[+[]]\n    ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n    (![]+[])[+!+[]+!+[]+!+[]]+(![]+[])[+!+[]+!+[]+!+[]+!+[]]+(![]+[])[+!+[]+!+[]]+(![]+[])[+[]]"
    },
    {
      "type": "LONG",
      "statement": "How do you remove falsy values from an array",
      "explanation": "You can apply the filter method on the array by passing Boolean as a parameter. This way it removes all falsy values(0, undefined, null, false and \"\") from the array.\n\n    const myArray = [false, null, 1, 5, undefined];\n    myArray.filter(Boolean); // [1, 5] // is same as myArray.filter(x => x);"
    },
    {
      "type": "LONG",
      "statement": "How do you get unique values of an array",
      "explanation": "You can get unique values of an array with the combination of `Set` and rest expression/spread(...) syntax.\n\n    console.log([...new Set([1, 2, 4, 4, 3])]); // [1, 2, 4, 3]"
    },
    {
      "type": "LONG",
      "statement": "What is destructuring aliases",
      "explanation": "Sometimes you would like to have a destructured variable with a different name than the property name. In that case, you'll use a `: newName` to specify a name for the variable. This process is called destructuring aliases.\n\n    const obj = { x: 1 };\n    // Grabs obj.x as as { otherName }\n    const { x: otherName } = obj;"
    },
    {
      "type": "LONG",
      "statement": "How do you map the array values without using map method",
      "explanation": "You can map the array values without using the `map` method by just using the `from` method of Array. Let's map city names from Countries array,\n\n    const countries = [\n      { name: \"India\", capital: \"Delhi\" },\n      { name: \"US\", capital: \"Washington\" },\n      { name: \"Russia\", capital: \"Moscow\" },\n      { name: \"Singapore\", capital: \"Singapore\" },\n      { name: \"China\", capital: \"Beijing\" },\n      { name: \"France\", capital: \"Paris\" },\n    ];\n    \n    const cityNames = Array.from(countries, ({ capital }) => capital);\n    console.log(cityNames); // ['Delhi, 'Washington', 'Moscow', 'Singapore', 'Beijing', 'Paris']"
    },
    {
      "type": "LONG",
      "statement": "How do you empty an array",
      "explanation": "You can empty an array quickly by setting the array length to zero.\n\n    let cities = [\"Singapore\", \"Delhi\", \"London\"];\n    cities.length = 0; // cities becomes []"
    },
    {
      "type": "LONG",
      "statement": "How do you rounding numbers to certain decimals",
      "explanation": "You can round numbers to a certain number of decimals using `toFixed` method from native javascript.\n\n    let pie = 3.141592653;\n    pie = pie.toFixed(3); // 3.142"
    },
    {
      "type": "LONG",
      "statement": "What is the easiest way to convert an array to an object",
      "explanation": "You can convert an array to an object with the same data using spread(...) operator.\n\n    var fruits = [\"banana\", \"apple\", \"orange\", \"watermelon\"];\n    var fruitsObject = { ...fruits };\n    console.log(fruitsObject); // {0: \"banana\", 1: \"apple\", 2: \"orange\", 3: \"watermelon\"}"
    },
    {
      "type": "LONG",
      "statement": "How do you create an array with some data",
      "explanation": "You can create an array with some data or an array with the same values using `fill` method.\n\n    var newArray = new Array(5).fill(\"0\");\n    console.log(newArray); // [\"0\", \"0\", \"0\", \"0\", \"0\"]"
    },
    {
      "type": "LONG",
      "statement": "What are the placeholders from console object",
      "explanation": "Below are the list of placeholders available from console object,\n\n1.  %o — It takes an object,\n2.  %s — It takes a string,\n3.  %d — It is used for a decimal or integer These placeholders can be represented in the console.log as below\n\n    const user = { name: \"John\", id: 1, city: \"Delhi\" };\n    console.log(\n      \"Hello %s, your details %o are available in the object form\",\n      \"John\",\n      user\n    ); // Hello John, your details {name: \"John\", id: 1, city: \"Delhi\"} are available in object"
    },
    {
      "type": "LONG",
      "statement": "Is it possible to add CSS to console messages",
      "explanation": "Yes, you can apply CSS styles to console messages similar to html text on the web page.\n\n    console.log(\n      \"%c The text has blue color, with large font and red background\",\n      \"color: blue; font-size: x-large; background: red\"\n    );\n    \n\n**Note:** All CSS styles can be applied to console messages."
    },
    {
      "type": "LONG",
      "statement": "What is the purpose of dir method of console object",
      "explanation": "The `console.dir()` is used to display an interactive list of the properties of the specified JavaScript object as JSON.\n\n    const user = { name: \"John\", id: 1, city: \"Delhi\" };\n    console.dir(user);"
    },
    {
      "type": "LONG",
      "statement": "Is it possible to debug HTML elements in console",
      "explanation": "Yes, it is possible to get and debug HTML elements in the console just like inspecting elements.\n\n    const element = document.getElementsByTagName(\"body\")[0];\n    console.log(element);\n    \n\nIt prints the HTML element in the console,"
    },
    {
      "type": "LONG",
      "statement": "How do you display data in a tabular format using console object",
      "explanation": "The `console.table()` is used to display data in the console in a tabular format to visualize complex arrays or objects.\n\n    const users = [\n      { name: \"John\", id: 1, city: \"Delhi\" },\n      { name: \"Max\", id: 2, city: \"London\" },\n      { name: \"Rod\", id: 3, city: \"Paris\" },\n    ];\n    console.table(users);\n    \n\nThe data visualized in a table format,"
    },
    {
      "type": "LONG",
      "statement": "How do you verify that an argument is a Number or not",
      "explanation": "The combination of IsNaN and isFinite methods are used to confirm whether an argument is a number or not.\n\n    function isNumber(n) {\n      return !isNaN(parseFloat(n)) && isFinite(n);\n    }"
    },
    {
      "type": "LONG",
      "statement": "How do you create copy to clipboard button",
      "explanation": "You need to select the content(using .select() method) of the input element and execute the copy command with execCommand (i.e, execCommand('copy')). You can also execute other system commands like cut and paste.\n\n    document.querySelector(\"#copy-button\").onclick = function () {\n      // Select the content\n      document.querySelector(\"#copy-input\").select();\n      // Copy to the clipboard\n      document.execCommand(\"copy\");\n    };"
    },
    {
      "type": "LONG",
      "statement": "What is the shortcut to get timestamp",
      "explanation": "You can use `new Date().getTime()` to get the current timestamp. There is an alternative shortcut to get the value.\n\n    console.log(+new Date());\n    console.log(Date.now());"
    },
    {
      "type": "LONG",
      "statement": "How do you flattening multi dimensional arrays",
      "explanation": "Flattening bi-dimensional arrays is trivial with Spread operator.\n\n    const biDimensionalArr = [11, [22, 33], [44, 55], [66, 77], 88, 99];\n    const flattenArr = [].concat(...biDimensionalArr); // [11, 22, 33, 44, 55, 66, 77, 88, 99]\n    \n\nBut you can make it work with multi-dimensional arrays by recursive calls,\n\n    function flattenMultiArray(arr) {\n      const flattened = [].concat(...arr);\n      return flattened.some((item) => Array.isArray(item))\n        ? flattenMultiArray(flattened)\n        : flattened;\n    }\n    const multiDimensionalArr = [11, [22, 33], [44, [55, 66, [77, [88]], 99]]];\n    const flatArr = flattenMultiArray(multiDimensionalArr); // [11, 22, 33, 44, 55, 66, 77, 88, 99]"
    },
    {
      "type": "LONG",
      "statement": "What is the easiest multi condition checking",
      "explanation": "You can use `indexOf` to compare input with multiple values instead of checking each value as one condition.\n\n    // Verbose approach\n    if (\n      input === \"first\" ||\n      input === 1 ||\n      input === \"second\" ||\n      input === 2\n    ) {\n      someFunction();\n    }\n    // Shortcut\n    if ([\"first\", 1, \"second\", 2].indexOf(input) !== -1) {\n      someFunction();\n    }"
    },
    {
      "type": "LONG",
      "statement": "How do you capture browser back button",
      "explanation": "The `window.onbeforeunload` method is used to capture browser back button events. This is helpful to warn users about losing the current data.\n\n    window.onbeforeunload = function () {\n      alert(\"You work will be lost\");\n    };"
    },
    {
      "type": "LONG",
      "statement": "How do you disable right click in the web page",
      "explanation": "The right click on the page can be disabled by returning false from the `oncontextmenu` attribute on the body element.\n\n    <body oncontextmenu=\"return false;\"></body>"
    },
    {
      "type": "LONG",
      "statement": "What are wrapper objects",
      "explanation": "Primitive Values like string,number and boolean don't have properties and methods but they are temporarily converted or coerced to an object(Wrapper object) when you try to perform actions on them. For example, if you apply toUpperCase() method on a primitive string value, it does not throw an error but returns uppercase of the string.\n\n    let name = \"john\";\n    \n    console.log(name.toUpperCase()); // Behind the scenes treated as console.log(new String(name).toUpperCase());\n    \n\ni.e, Every primitive except null and undefined have Wrapper Objects and the list of wrapper objects are String,Number,Boolean,Symbol and BigInt."
    },
    {
      "type": "LONG",
      "statement": "What is AJAX",
      "explanation": "AJAX stands for Asynchronous JavaScript and XML and it is a group of related technologies(HTML, CSS, JavaScript, XMLHttpRequest API etc) used to display data asynchronously. i.e. We can send data to the server and get data from the server without reloading the web page."
    },
    {
      "type": "LONG",
      "statement": "What are the different ways to deal with Asynchronous Code",
      "explanation": "Below are the list of different ways to deal with Asynchronous code.\n\n1.  Callbacks\n2.  Promises\n3.  Async/await\n4.  Third-party libraries such as async.js,bluebird etc"
    },
    {
      "type": "LONG",
      "statement": "How to cancel a fetch request",
      "explanation": "Until a few days back, One shortcoming of native promises is no direct way to cancel a fetch request. But the new `AbortController` from js specification allows you to use a signal to abort one or multiple fetch calls. The basic flow of cancelling a fetch request would be as below,\n\n1.  Create an `AbortController` instance\n2.  Get the signal property of an instance and pass the signal as a fetch option for signal\n3.  Call the AbortController's abort property to cancel all fetches that use that signal For example, let's pass the same signal to multiple fetch calls will cancel all requests with that signal,\n\n    const controller = new AbortController();\n    const { signal } = controller;\n    \n    fetch(\"http://localhost:8000\", { signal })\n      .then((response) => {\n        console.log(`Request 1 is complete!`);\n      })\n      .catch((e) => {\n        if (e.name === \"AbortError\") {\n          // We know it's been canceled!\n        }\n      });\n    \n    fetch(\"http://localhost:8000\", { signal })\n      .then((response) => {\n        console.log(`Request 2 is complete!`);\n      })\n      .catch((e) => {\n        if (e.name === \"AbortError\") {\n          // We know it's been canceled!\n        }\n      });\n    \n    // Wait 2 seconds to abort both requests\n    setTimeout(() => controller.abort(), 2000);"
    },
    {
      "type": "LONG",
      "statement": "What is web speech API",
      "explanation": "Web speech API is used to enable modern browsers recognize and synthesize speech(i.e, voice data into web apps). This API has been introduced by W3C Community in the year 2012. It has two main parts,\n\n1.  **SpeechRecognition (Asynchronous Speech Recognition or Speech-to-Text):** It provides the ability to recognize voice context from an audio input and respond accordingly. This is accessed by the `SpeechRecognition` interface. The below example shows on how to use this API to get text from speech,\n\n    window.SpeechRecognition =\n      window.webkitSpeechRecognition || window.SpeechRecognition; // webkitSpeechRecognition for Chrome and SpeechRecognition for FF\n    const recognition = new window.SpeechRecognition();\n    recognition.onresult = (event) => {\n      // SpeechRecognitionEvent type\n      const speechToText = event.results[0][0].transcript;\n      console.log(speechToText);\n    };\n    recognition.start();\n    \n\nIn this API, browser is going to ask you for permission to use your microphone\n\n1.  **SpeechSynthesis (Text-to-Speech):** It provides the ability to recognize voice context from an audio input and respond. This is accessed by the `SpeechSynthesis` interface. For example, the below code is used to get voice/speech from text,\n\n    if (\"speechSynthesis\" in window) {\n      var speech = new SpeechSynthesisUtterance(\"Hello World!\");\n      speech.lang = \"en-US\";\n      window.speechSynthesis.speak(speech);\n    }"
    },
    {
      "type": "LONG",
      "statement": "What is minimum timeout throttling",
      "explanation": "Both browser and NodeJS javascript environments throttles with a minimum delay that is greater than 0ms. That means even though setting a delay of 0ms will not happen instantaneously. **Browsers:** They have a minimum delay of 4ms. This throttle occurs when successive calls are triggered due to callback nesting(certain depth) or after a certain number of successive intervals. Note: The older browsers have a minimum delay of 10ms. **Nodejs:** They have a minimum delay of 1ms. This throttle happens when the delay is larger than 2147483647 or less than 1. The best example to explain this timeout throttling behavior is the order of below code snippet.\n\n    function runMeFirst() {\n      console.log(\"My script is initialized\");\n    }\n    setTimeout(runMeFirst, 0);\n    console.log(\"Script loaded\");\n    \n\nand the output would be in\n\n    Script loaded\n    My script is initialized\n    \n\nIf you don't use `setTimeout`, the order of logs will be sequential.\n\n    function runMeFirst() {\n      console.log(\"My script is initialized\");\n    }\n    runMeFirst();\n    console.log(\"Script loaded\");\n    \n\nand the output is,\n\n    My script is initialized\n    Script loaded"
    },
    {
      "type": "LONG",
      "statement": "How do you implement zero timeout in modern browsers",
      "explanation": "You can't use setTimeout(fn, 0) to execute the code immediately due to minimum delay of greater than 0ms. But you can use window.postMessage() to achieve this behavior."
    },
    {
      "type": "LONG",
      "statement": "What are tasks in event loop",
      "explanation": "A task is any javascript code/program which is scheduled to be run by the standard mechanisms such as initially starting to run a program, run an event callback, or an interval or timeout being fired. All these tasks are scheduled on a task queue. Below are the list of use cases to add tasks to the task queue,\n\n1.  When a new javascript program is executed directly from console or running by the `<script>` element, the task will be added to the task queue.\n2.  When an event fires, the event callback added to task queue\n3.  When a setTimeout or setInterval is reached, the corresponding callback added to task queue"
    },
    {
      "type": "LONG",
      "statement": "What is microtask",
      "explanation": "Microtask is the javascript code which needs to be executed immediately after the currently executing task/microtask is completed. They are kind of blocking in nature. i.e, The main thread will be blocked until the microtask queue is empty. The main sources of microtasks are Promise.resolve, Promise.reject, MutationObservers, IntersectionObservers etc"
    },
    {
      "type": "LONG",
      "statement": "What are different event loops",
      "explanation": ""
    },
    {
      "type": "LONG",
      "statement": "What is the purpose of queueMicrotask",
      "explanation": ""
    },
    {
      "type": "LONG",
      "statement": "How do you use javascript libraries in typescript file",
      "explanation": "It is known that not all JavaScript libraries or frameworks have TypeScript declaration files. But if you still want to use libraries or frameworks in our TypeScript files without getting compilation errors, the only solution is `declare` keyword along with a variable declaration. For example, let's imagine you have a library called `customLibrary` that doesn’t have a TypeScript declaration and have a namespace called `customLibrary` in the global namespace. You can use this library in typescript code as below,\n\n    declare var customLibrary;\n    \n\nIn the runtime, typescript will provide the type to the `customLibrary` variable as `any` type. The another alternative without using declare keyword is below\n\n    var customLibrary: any;"
    },
    {
      "type": "LONG",
      "statement": "What are the differences between promises and observables",
      "explanation": "Some of the major difference in a tabular form\n\n| Promises | Observables | | ------------------------------------------------------------------ | ---------------------------------------------------------------------------------------- | | Emits only a single value at a time | Emits multiple values over a period of time(stream of values ranging from 0 to multiple) | | Eager in nature; they are going to be called immediately | Lazy in nature; they require subscription to be invoked | | Promise is always asynchronous even though it resolved immediately | Observable can be either synchronous or asynchronous | | Doesn't provide any operators | Provides operators such as map, forEach, filter, reduce, retry, and retryWhen etc | | Cannot be canceled | Canceled by using unsubscribe() method |"
    },
    {
      "type": "LONG",
      "statement": "What is heap",
      "explanation": "Heap(Or memory heap) is the memory location where objects are stored when we define variables. i.e, This is the place where all the memory allocations and de-allocation take place. Both heap and call-stack are two containers of JS runtime. Whenever runtime comes across variables and function declarations in the code it stores them in the Heap."
    },
    {
      "type": "LONG",
      "statement": "What is an event table",
      "explanation": "Event Table is a data structure that stores and keeps track of all the events which will be executed asynchronously like after some time interval or after the resolution of some API requests. i.e Whenever you call a setTimeout function or invoke async operation, it is added to the Event Table. It doesn't not execute functions on it’s own. The main purpose of the event table is to keep track of events and send them to the Event Queue as shown in the below diagram."
    },
    {
      "type": "LONG",
      "statement": "What is a microTask queue",
      "explanation": "Microtask Queue is the new queue where all the tasks initiated by promise objects get processed before the callback queue. The microtasks queue are processed before the next rendering and painting jobs. But if these microtasks are running for a long time then it leads to visual degradation."
    },
    {
      "type": "LONG",
      "statement": "What is the difference between shim and polyfill",
      "explanation": "A shim is a library that brings a new API to an older environment, using only the means of that environment. It isn't necessarily restricted to a web application. For example, es5-shim.js is used to emulate ES5 features on older browsers (mainly pre IE9). Whereas polyfill is a piece of code (or plugin) that provides the technology that you, the developer, expect the browser to provide natively. In a simple sentence, A polyfill is a shim for a browser API."
    },
    {
      "type": "LONG",
      "statement": "How do you detect primitive or non primitive value type",
      "explanation": "In JavaScript, primitive types include boolean, string, number, BigInt, null, Symbol and undefined. Whereas non-primitive types include the Objects. But you can easily identify them with the below function,\n\n    var myPrimitive = 30;\n    var myNonPrimitive = {};\n    function isPrimitive(val) {\n      return Object(val) !== val;\n    }\n    \n    isPrimitive(myPrimitive);\n    isPrimitive(myNonPrimitive);\n    \n\nIf the value is a primitive data type, the Object constructor creates a new wrapper object for the value. But If the value is a non-primitive data type (an object), the Object constructor will give the same object."
    },
    {
      "type": "LONG",
      "statement": "What is babel",
      "explanation": "Babel is a JavaScript transpiler to convert ECMAScript 2015+ code into a backwards compatible version of JavaScript in current and older browsers or environments. Some of the main features are listed below,\n\n1.  Transform syntax\n2.  Polyfill features that are missing in your target environment (using @babel/polyfill)\n3.  Source code transformations (or codemods)"
    },
    {
      "type": "LONG",
      "statement": "Is Node.js completely single threaded",
      "explanation": "Node is a single thread, but some of the functions included in the Node.js standard library(e.g, fs module functions) are not single threaded. i.e, Their logic runs outside of the Node.js single thread to improve the speed and performance of a program."
    },
    {
      "type": "LONG",
      "statement": "What are the common use cases of observables",
      "explanation": "Some of the most common use cases of observables are web sockets with push notifications, user input changes, repeating intervals, etc"
    },
    {
      "type": "LONG",
      "statement": "What is RxJS",
      "explanation": "RxJS (Reactive Extensions for JavaScript) is a library for implementing reactive programming using observables that makes it easier to compose asynchronous or callback-based code. It also provides utility functions for creating and working with observables."
    },
    {
      "type": "LONG",
      "statement": "What is the difference between Function constructor and function declaration",
      "explanation": "The functions which are created with `Function constructor` do not create closures to their creation contexts but they are always created in the global scope. i.e, the function can access its own local variables and global scope variables only. Whereas function declarations can access outer function variables(closures) too.\n\nLet's see this difference with an example,\n\n**Function Constructor:**\n\n    var a = 100;\n    function createFunction() {\n      var a = 200;\n      return new Function(\"return a;\");\n    }\n    console.log(createFunction()()); // 100\n    \n\n**Function declaration:**\n\n    var a = 100;\n    function createFunction() {\n      var a = 200;\n      return function func() {\n        return a;\n      };\n    }\n    console.log(createFunction()()); // 200"
    },
    {
      "type": "LONG",
      "statement": "What is a Short circuit condition",
      "explanation": "Short circuit conditions are meant for condensed way of writing simple if statements. Let's demonstrate the scenario using an example. If you would like to login to a portal with an authentication condition, the expression would be as below,\n\n    if (authenticate) {\n      loginToPorta();\n    }\n    \n\nSince the javascript logical operators evaluated from left to right, the above expression can be simplified using && logical operator\n\n    authenticate && loginToPorta();"
    },
    {
      "type": "LONG",
      "statement": "What is the easiest way to resize an array",
      "explanation": "The length property of an array is useful to resize or empty an array quickly. Let's apply length property on number array to resize the number of elements from 5 to 2,\n\n    var array = [1, 2, 3, 4, 5];\n    console.log(array.length); // 5\n    \n    array.length = 2;\n    console.log(array.length); // 2\n    console.log(array); // [1,2]\n    \n\nand the array can be emptied too\n\n    var array = [1, 2, 3, 4, 5];\n    array.length = 0;\n    console.log(array.length); // 0\n    console.log(array); // []"
    },
    {
      "type": "LONG",
      "statement": "What is an observable",
      "explanation": "An Observable is basically a function that can return a stream of values either synchronously or asynchronously to an observer over time. The consumer can get the value by calling `subscribe()` method. Let's look at a simple example of an Observable\n\n    import { Observable } from \"rxjs\";\n    \n    const observable = new Observable((observer) => {\n      setTimeout(() => {\n        observer.next(\"Message from a Observable!\");\n      }, 3000);\n    });\n    \n    observable.subscribe((value) => console.log(value));\n    \n\n**Note:** Observables are not part of the JavaScript language yet but they are being proposed to be added to the language"
    },
    {
      "type": "LONG",
      "statement": "What is the difference between function and class declarations",
      "explanation": "The main difference between function declarations and class declarations is `hoisting`. The function declarations are hoisted but not class declarations.\n\n**Classes:**\n\n    const user = new User(); // ReferenceError\n    \n    class User {}\n    \n\n**Constructor Function:**\n\n    const user = new User(); // No error\n    \n    function User() {}"
    },
    {
      "type": "LONG",
      "statement": "What is an async function",
      "explanation": "An async function is a function declared with the `async` keyword which enables asynchronous, promise-based behavior to be written in a cleaner style by avoiding promise chains. These functions can contain zero or more `await` expressions.\n\nLet's take a below async function example,\n\n    async function logger() {\n      let data = await fetch(\"http://someapi.com/users\"); // pause until fetch returns\n      console.log(data);\n    }\n    logger();\n    \n\nIt is basically syntax sugar over ES2015 promises and generators."
    },
    {
      "type": "LONG",
      "statement": "How do you prevent promises swallowing errors",
      "explanation": "While using asynchronous code, JavaScript’s ES6 promises can make your life a lot easier without having callback pyramids and error handling on every second line. But Promises have some pitfalls and the biggest one is swallowing errors by default.\n\nLet's say you expect to print an error to the console for all the below cases,\n\n    Promise.resolve(\"promised value\").then(function () {\n      throw new Error(\"error\");\n    });\n    \n    Promise.reject(\"error value\").catch(function () {\n      throw new Error(\"error\");\n    });\n    \n    new Promise(function (resolve, reject) {\n      throw new Error(\"error\");\n    });\n    \n\nBut there are many modern JavaScript environments that won't print any errors. You can fix this problem in different ways,\n\n1.  **Add catch block at the end of each chain:** You can add catch block to the end of each of your promise chains\n    \n        Promise.resolve(\"promised value\")\n          .then(function () {\n            throw new Error(\"error\");\n          })\n          .catch(function (error) {\n            console.error(error.stack);\n          });\n        \n    \n    But it is quite difficult to type for each promise chain and verbose too.\n    \n2.  **Add done method:** You can replace first solution's then and catch blocks with done method\n    \n        Promise.resolve(\"promised value\").done(function () {\n          throw new Error(\"error\");\n        });\n        \n    \n    Let's say you want to fetch data using HTTP and later perform processing on the resulting data asynchronously. You can write `done` block as below,\n    \n        getDataFromHttp()\n          .then(function (result) {\n            return processDataAsync(result);\n          })\n          .done(function (processed) {\n            displayData(processed);\n          });\n        \n    \n    In future, if the processing library API changed to synchronous then you can remove `done` block as below,\n    \n        getDataFromHttp().then(function (result) {\n          return displayData(processDataAsync(result));\n        });\n        \n    \n    and then you forgot to add `done` block to `then` block leads to silent errors.\n    \n3.  **Extend ES6 Promises by Bluebird:** Bluebird extends the ES6 Promises API to avoid the issue in the second solution. This library has a “default” onRejection handler which will print all errors from rejected Promises to stderr. After installation, you can process unhandled rejections\n    \n        Promise.onPossiblyUnhandledRejection(function (error) {\n          throw error;\n        });\n        \n    \n    and discard a rejection, just handle it with an empty catch\n    \n        Promise.reject(\"error value\").catch(function () {});"
    },
    {
      "type": "LONG",
      "statement": "What is deno",
      "explanation": "Deno is a simple, modern and secure runtime for JavaScript and TypeScript that uses V8 JavaScript engine and the Rust programming language."
    },
    {
      "type": "LONG",
      "statement": "How do you make an object iterable in javascript",
      "explanation": "By default, plain objects are not iterable. But you can make the object iterable by defining a `Symbol.iterator` property on it.\n\nLet's demonstrate this with an example,\n\n    const collection = {\n      one: 1,\n      two: 2,\n      three: 3,\n      [Symbol.iterator]() {\n        const values = Object.keys(this);\n        let i = 0;\n        return {\n          next: () => {\n            return {\n              value: this[values[i++]],\n              done: i > values.length,\n            };\n          },\n        };\n      },\n    };\n    \n    const iterator = collection[Symbol.iterator]();\n    \n    console.log(iterator.next()); // → {value: 1, done: false}\n    console.log(iterator.next()); // → {value: 2, done: false}\n    console.log(iterator.next()); // → {value: 3, done: false}\n    console.log(iterator.next()); // → {value: undefined, done: true}\n    \n\nThe above process can be simplified using a generator function,\n\n    const collection = {\n      one: 1,\n      two: 2,\n      three: 3,\n      [Symbol.iterator]: function* () {\n        for (let key in this) {\n          yield this[key];\n        }\n      },\n    };\n    const iterator = collection[Symbol.iterator]();\n    console.log(iterator.next()); // {value: 1, done: false}\n    console.log(iterator.next()); // {value: 2, done: false}\n    console.log(iterator.next()); // {value: 3, done: false}\n    console.log(iterator.next()); // {value: undefined, done: true}"
    },
    {
      "type": "LONG",
      "statement": "What is a Proper Tail Call",
      "explanation": "First, we should know about tail call before talking about \"Proper Tail Call\". A tail call is a subroutine or function call performed as the final action of a calling function. Whereas **Proper tail call(PTC)** is a technique where the program or code will not create additional stack frames for a recursion when the function call is a tail call.\n\nFor example, the below classic or head recursion of factorial function relies on stack for each step. Each step need to be processed upto `n * factorial(n - 1)`\n\n    function factorial(n) {\n      if (n === 0) {\n        return 1;\n      }\n      return n * factorial(n - 1);\n    }\n    console.log(factorial(5)); //120\n    \n\nBut if you use Tail recursion functions, they keep passing all the necessary data it needs down the recursion without relying on the stack.\n\n    function factorial(n, acc = 1) {\n      if (n === 0) {\n        return acc;\n      }\n      return factorial(n - 1, n * acc);\n    }\n    console.log(factorial(5)); //120\n    \n\nThe above pattern returns the same output as the first one. But the accumulator keeps track of total as an argument without using stack memory on recursive calls."
    },
    {
      "type": "LONG",
      "statement": "How do you check an object is a promise or not",
      "explanation": "If you don't know if a value is a promise or not, wrapping the value as `Promise.resolve(value)` which returns a promise\n\n    function isPromise(object) {\n      if (Promise && Promise.resolve) {\n        return Promise.resolve(object) == object;\n      } else {\n        throw \"Promise not supported in your environment\";\n      }\n    }\n    \n    var i = 1;\n    var promise = new Promise(function (resolve, reject) {\n      resolve();\n    });\n    \n    console.log(isPromise(i)); // false\n    console.log(isPromise(p)); // true\n    \n\nAnother way is to check for `.then()` handler type\n\n    function isPromise(value) {\n      return Boolean(value && typeof value.then === \"function\");\n    }\n    var i = 1;\n    var promise = new Promise(function (resolve, reject) {\n      resolve();\n    });\n    \n    console.log(isPromise(i)); // false\n    console.log(isPromise(promise)); // true"
    },
    {
      "type": "LONG",
      "statement": "How to detect if a function is called as constructor",
      "explanation": "You can use `new.target` pseudo-property to detect whether a function was called as a constructor(using the new operator) or as a regular function call.\n\n1.  If a constructor or function invoked using the new operator, new.target returns a reference to the constructor or function.\n2.  For function calls, new.target is undefined.\n\n    function Myfunc() {\n       if (new.target) {\n          console.log('called with new');\n       } else {\n          console.log('not called with new');\n       }\n    }\n    \n    new Myfunc(); // called with new\n    Myfunc(); // not called with new\n    Myfunc.call({}); not called with new"
    },
    {
      "type": "LONG",
      "statement": "What are the differences between arguments object and rest parameter",
      "explanation": "There are three main differences between arguments object and rest parameters\n\n1.  The arguments object is an array-like but not an array. Whereas the rest parameters are array instances.\n2.  The arguments object does not support methods such as sort, map, forEach, or pop. Whereas these methods can be used in rest parameters.\n3.  The rest parameters are only the ones that haven’t been given a separate name, while the arguments object contains all arguments passed to the function"
    },
    {
      "type": "LONG",
      "statement": "What are the differences between spread operator and rest parameter",
      "explanation": "Rest parameter collects all remaining elements into an array. Whereas Spread operator allows iterables( arrays / objects / strings ) to be expanded into single arguments/elements. i.e, Rest parameter is opposite to the spread operator."
    },
    {
      "type": "LONG",
      "statement": "What are the different kinds of generators",
      "explanation": "There are five kinds of generators,\n\n1.  **Generator function declaration:**\n    \n        function* myGenFunc() {\n          yield 1;\n          yield 2;\n          yield 3;\n        }\n        const genObj = myGenFunc();\n        \n    \n2.  **Generator function expressions:**\n    \n        const myGenFunc = function* () {\n          yield 1;\n          yield 2;\n          yield 3;\n        };\n        const genObj = myGenFunc();\n        \n    \n3.  **Generator method definitions in object literals:**\n    \n        const myObj = {\n          *myGeneratorMethod() {\n            yield 1;\n            yield 2;\n            yield 3;\n          },\n        };\n        const genObj = myObj.myGeneratorMethod();\n        \n    \n4.  **Generator method definitions in class:**\n    \n        class MyClass {\n          *myGeneratorMethod() {\n            yield 1;\n            yield 2;\n            yield 3;\n          }\n        }\n        const myObject = new MyClass();\n        const genObj = myObject.myGeneratorMethod();\n        \n    \n5.  **Generator as a computed property:**\n    \n        const SomeObj = {\n          *[Symbol.iterator]() {\n            yield 1;\n            yield 2;\n            yield 3;\n          },\n        };\n        \n        console.log(Array.from(SomeObj)); // [ 1, 2, 3 ]"
    },
    {
      "type": "LONG",
      "statement": "What are the built-in iterables",
      "explanation": "Below are the list of built-in iterables in javascript,\n\n1.  Arrays and TypedArrays\n2.  Strings: Iterate over each character or Unicode code-points\n3.  Maps: iterate over its key-value pairs\n4.  Sets: iterates over their elements\n5.  arguments: An array-like special variable in functions\n6.  DOM collection such as NodeList"
    },
    {
      "type": "LONG",
      "statement": "What are the differences between for...of and for...in statements",
      "explanation": "Both for...in and for...of statements iterate over js data structures. The only difference is over what they iterate:\n\n1.  for..in iterates over all enumerable property keys of an object\n2.  for..of iterates over the values of an iterable object.\n\nLet's explain this difference with an example,\n\n    let arr = [\"a\", \"b\", \"c\"];\n    \n    arr.newProp = \"newVlue\";\n    \n    // key are the property keys\n    for (let key in arr) {\n      console.log(key);\n    }\n    \n    // value are the property values\n    for (let value of arr) {\n      console.log(value);\n    }\n    \n\nSince for..in loop iterates over the keys of the object, the first loop logs 0, 1, 2 and newProp while iterating over the array object. The for..of loop iterates over the values of a arr data structure and logs a, b, c in the console."
    },
    {
      "type": "LONG",
      "statement": "How do you define instance and non-instance properties",
      "explanation": "The Instance properties must be defined inside of class methods. For example, name and age properties defined insider constructor as below,\n\n    class Person {\n      constructor(name, age) {\n        this.name = name;\n        this.age = age;\n      }\n    }\n    \n\nBut Static(class) and prototype data properties must be defined outside of the ClassBody declaration. Let's assign the age value for Person class as below,\n\n    Person.staticAge = 30;\n    Person.prototype.prototypeAge = 40;"
    },
    {
      "type": "LONG",
      "statement": "What is the difference between isNaN and Number.isNaN?",
      "explanation": "1.  **isNaN**: The global function `isNaN` converts the argument to a Number and returns true if the resulting value is NaN.\n2.  **Number.isNaN**: This method does not convert the argument. But it returns true when the type is a Number and value is NaN.\n\nLet's see the difference with an example,\n\n    isNaN(‘hello’);   // true\n    Number.isNaN('hello'); // false"
    },
    {
      "type": "LONG",
      "statement": "How to invoke an IIFE without any extra brackets?",
      "explanation": "Immediately Invoked Function Expressions(IIFE) requires a pair of parenthesis to wrap the function which contains set of statements.\n\n    (function (dt) {\n      console.log(dt.toLocaleTimeString());\n    })(new Date());\n    \n\nSince both IIFE and void operator discard the result of an expression, you can avoid the extra brackets using `void operator` for IIFE as below,\n\n    void (function (dt) {\n      console.log(dt.toLocaleTimeString());\n    })(new Date());"
    },
    {
      "type": "LONG",
      "statement": "Is that possible to use expressions in switch cases?",
      "explanation": "You might have seen expressions used in switch condition but it is also possible to use for switch cases by assigning true value for the switch condition. Let's see the weather condition based on temparature as an example,\n\n    const weather = (function getWeather(temp) {\n      switch (true) {\n        case temp < 0:\n          return \"freezing\";\n        case temp < 10:\n          return \"cold\";\n        case temp < 24:\n          return \"cool\";\n        default:\n          return \"unknown\";\n      }\n    })(10);"
    },
    {
      "type": "LONG",
      "statement": "What is the easiest way to ignore promise errors?",
      "explanation": "The easiest and safest way to ignore promise errors is void that error. This approach is ESLint friendly too.\n\n    await promise.catch((e) => void e);"
    },
    {
      "type": "LONG",
      "statement": "How do style the console output using CSS?",
      "explanation": "You can add CSS styling to the console output using the CSS format content specifier %c. The console string message can be appended after the specifier and CSS style in another argument. Let's print the red the color text using console.log and CSS specifier as below,\n\n    console.log(\"%cThis is a red text\", \"color:red\");\n    \n\nIt is also possible to add more styles for the content. For example, the font-size can be modified for the above text\n\n    console.log(\n      \"%cThis is a red text with bigger font\",\n      \"color:red; font-size:20px\"\n    );"
    }
  ]
}
